	0x1		常數	_化祿
	0x10	常數	_化權
	0x100	常數	_化科
	0x1000	常數	_化忌


			
	:  星情四化 create
			0 , \ 所在的地支
			0 , \ 藏干
			0 , \ 廟陷
			0 , \ 生年四化
			0 , \ 大限四化
			0 , \ 小限四化
			0 , \ 流年四化
			0 , \ 流月四化
			0 , \ 流日四化
			0 , \ 流時四化
			0 , \ 本命命宮四化
			0 , \ 本命兄弟宮四化
			0 , \ 本命夫妻宮四化
			0 , \ 本命子女宮四化
			0 , \ 本命財帛宮四化
			0 , \ 本命疾厄宮四化
			0 , \ 本命遷移宮四化
			0 , \ 本命僕役宮四化
			0 , \ 本命官祿宮四化
			0 , \ 本命命田宅宮四化
			0 , \ 本命福德宮四化
			0 , \ 本命父母宮四化
			0 , \ 大限命宮四化
			0 , \ 大限兄弟宮四化
			0 , \ 大限夫妻宮四化
			0 , \ 大限子女宮四化
			0 , \ 大限財帛宮四化
			0 , \ 大限疾厄宮四化
			0 , \ 大限遷移宮四化
			0 , \ 大限僕役宮四化
			0 , \ 大限命官祿宮四化
			0 , \ 大限命田宅宮四化
			0 , \ 大限福德宮四化
			0 , \ 大限父母宮四化
			0 , \ 小限命宮四化
			0 , \ 小限兄弟宮四化
			0 , \ 小限夫妻宮四化
			0 , \ 小限子女宮四化
			0 , \ 小限財帛宮四化
			0 , \ 小限疾厄宮四化
			0 , \ 小限遷移宮四化
			0 , \ 小限僕役宮四化
			0 , \ 小限命官祿宮四化
			0 , \ 小限命田宅宮四化
			0 , \ 小限福德宮四化
			0 , \ 小限父母宮四化
			0 , \ 流年命宮四化
			0 , \ 流年兄弟宮四化
			0 , \ 流年夫妻宮四化
			0 , \ 流年子女宮四化
			0 , \ 流年財帛宮四化
			0 , \ 流年疾厄宮四化
			0 , \ 流年遷移宮四化
			0 , \ 流年僕役宮四化
			0 , \ 流年命官祿宮四化
			0 , \ 流年命田宅宮四化
			0 , \ 流年福德宮四化
			0 , \ 流年父母宮四化
			0 , \ 流月命宮四化
			0 , \ 流月兄弟宮四化
			0 , \ 流月夫妻宮四化
			0 , \ 流月子女宮四化
			0 , \ 流月財帛宮四化
			0 , \ 流月疾厄宮四化
			0 , \ 流月遷移宮四化
			0 , \ 流月僕役宮四化
			0 , \ 流月命官祿宮四化
			0 , \ 流月命田宅宮四化
			0 , \ 流月福德宮四化
			0 , \ 流月父母宮四化
			0 , \ 流日命宮四化
			0 , \ 流日兄弟宮四化
			0 , \ 流日夫妻宮四化
			0 , \ 流日子女宮四化
			0 , \ 流日財帛宮四化
			0 , \ 流日疾厄宮四化
			0 , \ 流日遷移宮四化
			0 , \ 流日僕役宮四化
			0 , \ 流日命官祿宮四化
			0 , \ 流日命田宅宮四化
			0 , \ 流日福德宮四化
			0 , \ 流日父母宮四化
			0 , \ 流時命宮四化
			0 , \ 流時兄弟宮四化
			0 , \ 流時夫妻宮四化
			0 , \ 流時子女宮四化
			0 , \ 流時財帛宮四化
			0 , \ 流時疾厄宮四化
			0 , \ 流時遷移宮四化
			0 , \ 流時僕役宮四化
			0 , \ 流時命官祿宮四化
			0 , \ 流時命田宅宮四化
			0 , \ 流時福德宮四化
			0 , \ 流時父母宮四化
			;
			
	: _的地支	0 cells  ;
	: _藏干			1 cells  ;
	: _廟陷			2 cells  ;
	: _生年四化		3 cells  ;
	: _大限四化		4 cells  ;
	: _小限四化		5 cells  ;
	: _流年四化		6 cells  ;
	: _流月四化		7 cells  ;
	: _流日四化		8 cells  ;
	: _流時四化		9 cells  ;
	: _本命命宮四化		10 cells  ;
	: _本命兄弟宮四化	11 cells  ;
	: _本命夫妻宮四化	12 cells  ;
	: _本命子女宮四化	13 cells  ;
	: _本命財帛宮四化	14 cells  ;
	: _本命疾厄宮四化	15 cells  ;
	: _本命遷移宮四化	16 cells  ;
	: _本命僕役宮四化	17 cells  ;
	: _本命官祿宮四化	18 cells  ;
	: _本命田宅宮四化	19 cells  ;
	: _本命福德宮四化	20 cells  ;
	: _本命父母宮四化	21 cells  ;
	: _大限命宮四化		22 cells  ;
	: _大限兄弟宮四化	23 cells  ;
	: _大限夫妻宮四化	24 cells  ;
	: _大限子女宮四化	25 cells  ;
	: _大限財帛宮四化	26 cells  ;
	: _大限疾厄宮四化	27 cells  ;
	: _大限遷移宮四化	28 cells  ;
	: _大限僕役宮四化	29 cells  ;
	: _大限官祿宮四化	30 cells  ;
	: _大限田宅宮四化	31 cells  ;
	: _大限福德宮四化	32 cells  ;
	: _大限父母宮四化	33 cells  ;
	: _小限命宮四化		34 cells  ;
	: _小限兄弟宮四化	35 cells  ;
	: _小限夫妻宮四化	36 cells  ;
	: _小限子女宮四化	37 cells  ;
	: _小限財帛宮四化	38 cells  ;
	: _小限疾厄宮四化	39 cells  ;
	: _小限遷移宮四化	40 cells  ;
	: _小限僕役宮四化	41 cells  ;
	: _小限官祿宮四化	42 cells  ;
	: _小限田宅宮四化	43 cells  ;
	: _小限福德宮四化	44 cells  ;
	: _小限父母宮四化	45 cells  ;
	: _流年命宮四化		46 cells  ;
	: _流年兄弟宮四化	47 cells  ;
	: _流年夫妻宮四化	48 cells  ;
	: _流年子女宮四化	49 cells  ;
	: _流年財帛宮四化	50 cells  ;
	: _流年疾厄宮四化	51 cells  ;
	: _流年遷移宮四化	52 cells  ;
	: _流年僕役宮四化	53 cells  ;
	: _流年官祿宮四化	54 cells  ;
	: _流年田宅宮四化	55 cells  ;
	: _流年福德宮四化	56 cells  ;
	: _流年父母宮四化	57 cells  ;
	: _流月命宮四化		58 cells  ;
	: _流月兄弟宮四化	59 cells  ;
	: _流月夫妻宮四化	60 cells  ;
	: _流月子女宮四化	61 cells  ;
	: _流月財帛宮四化	62 cells  ;
	: _流月疾厄宮四化	63 cells  ;
	: _流月遷移宮四化	64 cells  ;
	: _流月僕役宮四化	65 cells  ;
	: _流月官祿宮四化	66 cells  ;
	: _流月田宅宮四化	67 cells  ;
	: _流月福德宮四化	68 cells  ;
	: _流月父母宮四化	69 cells  ;
	: _流日命宮四化		70 cells  ;
	: _流日兄弟宮四化	71 cells  ;
	: _流日夫妻宮四化	72 cells  ;
	: _流日子女宮四化	73 cells  ;
	: _流日財帛宮四化	74 cells  ;
	: _流日疾厄宮四化	75 cells  ;
	: _流日遷移宮四化	76 cells  ;
	: _流日僕役宮四化	77 cells  ;
	: _流日官祿宮四化	78 cells  ;
	: _流日田宅宮四化	79 cells  ;
	: _流日福德宮四化	80 cells  ;
	: _流日父母宮四化	81 cells  ;
	: _流時命宮四化		82 cells  ;
	: _流時兄弟宮四化	83 cells  ;
	: _流時夫妻宮四化	84 cells  ;
	: _流時子女宮四化	85 cells  ;
	: _流時財帛宮四化	86 cells  ;
	: _流時疾厄宮四化	87 cells  ;
	: _流時遷移宮四化	88 cells  ;
	: _流時僕役宮四化	89 cells  ;
	: _流時官祿宮四化	90 cells  ;
	: _流時田宅宮四化	91 cells  ;
	: _流時福德宮四化	92 cells  ;
	: _流時父母宮四化	93 cells  ;
	: 星情四化總長	94 cells  ;
	
	星情四化 廉貞
	星情四化 破軍
	星情四化 武曲
	星情四化 太陽
	星情四化 天機
	星情四化 天梁
	星情四化 紫微
	星情四化 太陰
	星情四化 天同
	星情四化 文昌
	星情四化 巨門
	星情四化 貪狼
	星情四化 右弼
	星情四化 文曲
	星情四化 左輔
	星情四化 七殺	
	星情四化 祿存
	星情四化 陀羅
	星情四化 擎羊
	星情四化 火星
	星情四化 鈴星


	: 安四化 ( 天干 四化位  --- )
		>r
  		case
  			甲	of	
  					_化祿	r@ 廉貞 + !
  					_化權	r@ 破軍 + !
  					_化科	r@ 武曲 + !
  					_化忌	r@ 太陽 + !
  				endof
  			乙	of	
  					_化祿	r@ 天機 + !
  					_化權	r@ 天梁 + !
  					_化科	r@ 紫微 + !
  					_化忌	r@ 太陰 + !
  				endof
  			丙	of	
  					_化祿	r@ 天同 + !
  					_化權	r@ 天機 + !
  					_化科	r@ 文昌 + !
  					_化忌	r@ 廉貞 + !
  				endof
  			丁	of	
  					_化祿	r@ 太陰 + !
  					_化權	r@ 天同 + !
  					_化科	r@ 天機 + !
  					_化忌	r@ 巨門 + !
  				endof
  			戊	of	
  					_化祿	r@ 貪狼 + !
  					_化權	r@ 太陰 + !
  					_化科	r@ 右弼 + !
  					_化忌	r@ 天機 + !
  				endof
  			己	of	
  					_化祿	r@ 武曲 + !
  					_化權	r@ 貪狼 + !
  					_化科	r@ 天梁 + !
  					_化忌	r@ 文曲 + !
  				endof
  			庚	of	
  					_化祿	r@ 太陽 + !
  					_化權	r@ 武曲 + !
  					_化科	r@ 天同 + !
  					_化忌	r@ 太陰 + !
  				endof
  			辛	of	
  					_化祿	r@ 巨門 + !
  					_化權	r@ 太陽 + !
  					_化科	r@ 文曲 + !
  					_化忌	r@ 文昌 + !
  				endof
  			壬	of	
  					_化祿	r@ 天梁 + !
  					_化權	r@ 紫微 + !
  					_化科	r@ 左輔 + !
  					_化忌	r@ 武曲 + !
  				endof
  			癸	of	
  					_化祿	r@ 破軍 + !
  					_化權	r@ 巨門 + !
  					_化科	r@ 太陰 + !
  					_化忌	r@ 貪狼 + !
  				endof
  		endcase
  		r>drop	
		;
	
	0	變數		四化的旺度
	
	: 化祿的旺度? ( 化祿的地支 --- )
		case
			子	of	吉陷	endof
			丑	of	吉不	endof
			寅	of	吉廟	endof
			卯	of	吉陷	endof			
			辰	of	吉不	endof
			巳	of	吉地	endof			
			午	of	吉陷	endof
			未	of	吉不	endof			
			申	of	吉廟	endof
			酉	of	吉陷	endof			
			戌	of	吉不	endof
			亥	of	吉地	endof	
		endcase
			to 四化的旺度
		;
	
	: 化權的旺度? ( 化權的地支 --- )
		case
			子	of	吉不	endof
			丑	of	吉廟	endof
			寅	of	吉利	endof
			卯	of	吉地	endof			
			辰	of	吉平	endof
			巳	of	吉平	endof			
			午	of	吉平	endof
			未	of	吉利	endof			
			申	of	吉不	endof
			酉	of	吉不	endof			
			戌	of	吉地	endof
			亥	of	吉平	endof	
		endcase
			to 四化的旺度
		;

	: 化科的旺度? ( 化科的地支 --- )
		case
			子	of	吉平	endof
			丑	of	吉廟	endof
			寅	of	吉地	endof
			卯	of	吉旺	endof			
			辰	of	吉廟	endof
			巳	of	吉地	endof			
			午	of	吉旺	endof
			未	of	吉地	endof			
			申	of	吉旺	endof
			酉	of	吉不	endof			
			戌	of	吉廟	endof
			亥	of	吉平	endof	
		endcase
			to 四化的旺度
		;

	: 化忌的旺度? ( 化忌的地支 --- )
		case
			子	of	吉廟	endof
			丑	of	吉廟	endof
			寅	of	吉陷	endof
			卯	of	吉地	endof			
			辰	of	吉利	endof
			巳	of	吉陷	endof			
			午	of	吉陷	endof
			未	of	吉利	endof			
			申	of	吉不	endof
			酉	of	吉不	endof			
			戌	of	吉陷	endof
			亥	of	吉陷	endof	
		endcase
			to 四化的旺度
		;
	
	: 化祿 ( 天干 --- 化祿的地支 )
  		case
  			甲	of	廉貞的地支	dup 廉貞吉凶?  to 吉凶旺度 dup 化祿的旺度? endof
  			乙	of	天機的地支	dup 天機吉凶?  to 吉凶旺度 dup 化祿的旺度? endof
  			丙	of	天同的地支	dup 天同吉凶?  to 吉凶旺度 dup 化祿的旺度? endof
  			丁	of	太陰的地支	dup 太陰吉凶?  to 吉凶旺度 dup 化祿的旺度? endof
  			戊	of	貪狼的地支	dup 貪狼吉凶?  to 吉凶旺度 dup 化祿的旺度? endof
  			己	of	武曲的地支	dup 武曲吉凶?  to 吉凶旺度 dup 化祿的旺度? endof
  			庚	of	太陽的地支	dup 太陽吉凶?  to 吉凶旺度 dup 化祿的旺度? endof
  			辛	of	巨門的地支	dup 巨門吉凶?  to 吉凶旺度 dup 化祿的旺度? endof
  			壬	of	天梁的地支	dup 天梁吉凶?  to 吉凶旺度 dup 化祿的旺度? endof
  			癸	of	破軍的地支	dup 破軍吉凶?  to 吉凶旺度 dup 化祿的旺度? endof
  		endcase
		;
	
	: 化權 ( 天干  --- 化權的地支 )
  		case
  			甲	of	破軍的地支	dup 破軍吉凶?  to 吉凶旺度 dup 化權的旺度? endof
  			乙	of	天梁的地支	dup 天梁吉凶?  to 吉凶旺度 dup 化權的旺度? endof
  			丙	of	天機的地支	dup 天機吉凶?  to 吉凶旺度 dup 化權的旺度? endof
  			丁	of	天同的地支	dup 天同吉凶?  to 吉凶旺度 dup 化權的旺度? endof
  			戊	of	太陰的地支	dup 太陰吉凶?  to 吉凶旺度 dup 化權的旺度? endof
  			己	of	貪狼的地支	dup 貪狼吉凶?  to 吉凶旺度 dup 化權的旺度? endof
  			庚	of	武曲的地支	dup 武曲吉凶?  to 吉凶旺度 dup 化權的旺度? endof
  			辛	of	太陽的地支	dup 太陽吉凶?  to 吉凶旺度 dup 化權的旺度? endof
  			壬	of	紫微的地支	dup 紫微吉凶?  to 吉凶旺度 dup 化權的旺度? endof
  			癸	of	巨門的地支	dup 巨門吉凶?  to 吉凶旺度 dup 化權的旺度? endof
  		endcase	
		;	
	
	: 化科 ( 天干 --- 化科的地支 )
  		case
  			甲	of	武曲的地支	dup 武曲吉凶?  to 吉凶旺度 dup 化科的旺度? endof
  			乙	of	紫微的地支	dup 紫微吉凶?  to 吉凶旺度 dup 化科的旺度? endof
  			丙	of	文昌的地支	dup 文昌吉凶?  to 吉凶旺度 dup 化科的旺度? endof
  			丁	of	天機的地支	dup 天機吉凶?  to 吉凶旺度 dup 化科的旺度? endof
  			戊	of	右弼的地支	dup 右弼吉凶?  to 吉凶旺度 dup 化科的旺度? endof
  			己	of	天梁的地支	dup 天梁吉凶?  to 吉凶旺度 dup 化科的旺度? endof
  			庚	of	天同的地支	dup 天同吉凶?  to 吉凶旺度 dup 化科的旺度? endof
  			辛	of	文曲的地支	dup 文曲吉凶?  to 吉凶旺度 dup 化科的旺度? endof
  			壬	of	左輔的地支	dup 左輔吉凶?  to 吉凶旺度 dup 化科的旺度? endof
  			癸	of	太陰的地支	dup 太陰吉凶?  to 吉凶旺度 dup 化科的旺度? endof
  		endcase
		;	
	
	: 化忌 ( 天干 --- 化忌的地支 )
  		case
  			甲	of	太陽的地支	dup 太陽吉凶?  to 吉凶旺度 dup 化忌的旺度? endof
  			乙	of	太陰的地支	dup 太陰吉凶?  to 吉凶旺度 dup 化忌的旺度? endof
  			丙	of	廉貞的地支	dup 廉貞吉凶?  to 吉凶旺度 dup 化忌的旺度? endof
  			丁	of	巨門的地支	dup 巨門吉凶?  to 吉凶旺度 dup 化忌的旺度? endof
  			戊	of	天機的地支	dup 天機吉凶?  to 吉凶旺度 dup 化忌的旺度? endof
  			己	of	文曲的地支	dup 文曲吉凶?  to 吉凶旺度 dup 化忌的旺度? endof
  			庚	of	太陰的地支	dup 太陰吉凶?  to 吉凶旺度 dup 化忌的旺度? endof
  			辛	of	文昌的地支	dup 文昌吉凶?  to 吉凶旺度 dup 化忌的旺度? endof
  			壬	of	武曲的地支	dup 武曲吉凶?  to 吉凶旺度 dup 化忌的旺度? endof
  			癸	of	貪狼的地支	dup 貪狼吉凶?  to 吉凶旺度 dup 化忌的旺度? endof
  		endcase
		;	
	
	
	
	
	
		
	: 諸星四化歸零 ( --- )
		廉貞 星情四化總長 歸零
		破軍 星情四化總長 歸零
		武曲 星情四化總長 歸零
		太陽 星情四化總長 歸零
		天機 星情四化總長 歸零
		天梁 星情四化總長 歸零
		紫微 星情四化總長 歸零
		太陰 星情四化總長 歸零
		天同 星情四化總長 歸零
		文昌 星情四化總長 歸零
		巨門 星情四化總長 歸零
		貪狼 星情四化總長 歸零
		右弼 星情四化總長 歸零
		文曲 星情四化總長 歸零
		左輔 星情四化總長 歸零
		;		
	: 四化歸零 ( 四化位 --- )
		>r
		R@ 廉貞  + 1 cells 歸零
		R@ 破軍  + 1 cells  歸零
		R@ 武曲  + 1 cells  歸零
		R@ 太陽  + 1 cells  歸零
		R@ 天機  + 1 cells  歸零
		R@ 天梁  + 1 cells  歸零
		R@ 紫微  + 1 cells  歸零
		R@ 太陰  + 1 cells  歸零
		R@ 天同  + 1 cells  歸零
		R@ 文昌  + 1 cells  歸零
		R@ 巨門  + 1 cells  歸零
		R@ 貪狼  + 1 cells  歸零
		R@ 右弼  + 1 cells  歸零
		R@ 文曲  + 1 cells  歸零
		r> 左輔  + 1 cells  歸零
		;
		
	: 十二宮四化歸零 ( 四化位 --- )
		>r
		R@ 廉貞  + 12 cells 歸零
		R@ 破軍  + 12 cells  歸零
		R@ 武曲  + 12 cells  歸零
		R@ 太陽  + 12 cells  歸零
		R@ 天機  + 12 cells  歸零
		R@ 天梁  + 12 cells  歸零
		R@ 紫微  + 12 cells  歸零
		R@ 太陰  + 12 cells  歸零
		R@ 天同  + 12 cells  歸零
		R@ 文昌  + 12 cells  歸零
		R@ 巨門  + 12 cells  歸零
		R@ 貪狼  + 12 cells  歸零
		R@ 右弼  + 12 cells  歸零
		R@ 文曲  + 12 cells  歸零
		R> 左輔  + 12 cells  歸零
		;

 	: 生年四化 ( --- )
 		_生年四化 四化歸零
 		生年的天干 _生年四化 安四化
 		;
 	
 	: 本命十二宮四化 ( --- )
 		_本命命宮四化 十二宮四化歸零
		命宮的天干		_本命命宮四化  安四化
		兄弟宮的天干	_本命兄弟宮四化 安四化
		夫妻宮的天干	_本命夫妻宮四化 安四化
		子女宮的天干	_本命子女宮四化 安四化
		財帛宮的天干	_本命財帛宮四化 安四化
		疾厄宮的天干	_本命疾厄宮四化 安四化
		遷移宮的天干	_本命遷移宮四化 安四化
		僕役宮的天干	_本命僕役宮四化 安四化
		官祿宮的天干	_本命官祿宮四化 安四化
		田宅宮的天干	_本命田宅宮四化 安四化
		福德宮的天干	_本命福德宮四化 安四化
		父母宮的天干	_本命父母宮四化 安四化
		;
		
	: 大限四化 ( --- )
		_大限四化 四化歸零	
 		大限的天干 _大限四化 安四化
 		;
 		
 	: 大限十二宮四化 ( --- )
 		_大限命宮四化 十二宮四化歸零
		大限命宮的天干		_大限命宮四化  安四化
		大限兄弟宮的天干	_大限兄弟宮四化 安四化
		大限夫妻宮的天干	_大限夫妻宮四化 安四化
		大限子女宮的天干	_大限子女宮四化 安四化
		大限財帛宮的天干	_大限財帛宮四化 安四化
		大限疾厄宮的天干	_大限疾厄宮四化 安四化
		大限遷移宮的天干	_大限遷移宮四化 安四化
		大限僕役宮的天干	_大限僕役宮四化 安四化
		大限官祿宮的天干	_大限官祿宮四化 安四化
		大限田宅宮的天干	_大限田宅宮四化 安四化
		大限福德宮的天干	_大限福德宮四化 安四化
		大限父母宮的天干	_大限父母宮四化 安四化
		;

	: 小限四化 ( --- )
		_小限四化 四化歸零	
 		小限的天干 _小限四化 安四化
 		;
 		
 	: 小限十二宮四化 ( --- )
 		_小限命宮四化 十二宮四化歸零
		小限命宮的天干		_小限命宮四化  安四化
		小限兄弟宮的天干	_小限兄弟宮四化 安四化
		小限夫妻宮的天干	_小限夫妻宮四化 安四化
		小限子女宮的天干	_小限子女宮四化 安四化
		小限財帛宮的天干	_小限財帛宮四化 安四化
		小限疾厄宮的天干	_小限疾厄宮四化 安四化
		小限遷移宮的天干	_小限遷移宮四化 安四化
		小限僕役宮的天干	_小限僕役宮四化 安四化
		小限官祿宮的天干	_小限官祿宮四化 安四化
		小限田宅宮的天干	_小限田宅宮四化 安四化
		小限福德宮的天干	_小限福德宮四化 安四化
		小限父母宮的天干	_小限父母宮四化 安四化
		;
		
	: 流年四化 ( --- )
		_流年四化 四化歸零	
 		流年的天干 _流年四化 安四化
 		;
 		
 	: 流年十二宮四化 ( --- )
 		_流年命宮四化 十二宮四化歸零
		流年命宮的天干		_流年命宮四化  安四化
		流年兄弟宮的天干	_流年兄弟宮四化 安四化
		流年夫妻宮的天干	_流年夫妻宮四化 安四化
		流年子女宮的天干	_流年子女宮四化 安四化
		流年財帛宮的天干	_流年財帛宮四化 安四化
		流年疾厄宮的天干	_流年疾厄宮四化 安四化
		流年遷移宮的天干	_流年遷移宮四化 安四化
		流年僕役宮的天干	_流年僕役宮四化 安四化
		流年官祿宮的天干	_流年官祿宮四化 安四化
		流年田宅宮的天干	_流年田宅宮四化 安四化
		流年福德宮的天干	_流年福德宮四化 安四化
		流年父母宮的天干	_流年父母宮四化 安四化
		;
		
	: 流月四化 ( --- )
		_流月四化 四化歸零	
 		流月的天干 _流月四化 安四化
 		;
 		
 	: 流月十二宮四化 ( --- )
 		_流月命宮四化 十二宮四化歸零
		流月命宮的天干		_流月命宮四化  安四化
		流月兄弟宮的天干	_流月兄弟宮四化 安四化
		流月夫妻宮的天干	_流月夫妻宮四化 安四化
		流月子女宮的天干	_流月子女宮四化 安四化
		流月財帛宮的天干	_流月財帛宮四化 安四化
		流月疾厄宮的天干	_流月疾厄宮四化 安四化
		流月遷移宮的天干	_流月遷移宮四化 安四化
		流月僕役宮的天干	_流月僕役宮四化 安四化
		流月官祿宮的天干	_流月官祿宮四化 安四化
		流月田宅宮的天干	_流月田宅宮四化 安四化
		流月福德宮的天干	_流月福德宮四化 安四化
		流月父母宮的天干	_流月父母宮四化 安四化
		;		
		
	: 流日四化 ( --- )
		_流日四化 四化歸零	
 		流日的天干 _流日四化 安四化
 		;
 		
 	: 流日十二宮四化 ( --- )
 		_流日命宮四化 十二宮四化歸零
		流日命宮的天干		_流日命宮四化  安四化
		流日兄弟宮的天干	_流日兄弟宮四化 安四化
		流日夫妻宮的天干	_流日夫妻宮四化 安四化
		流日子女宮的天干	_流日子女宮四化 安四化
		流日財帛宮的天干	_流日財帛宮四化 安四化
		流日疾厄宮的天干	_流日疾厄宮四化 安四化
		流日遷移宮的天干	_流日遷移宮四化 安四化
		流日僕役宮的天干	_流日僕役宮四化 安四化
		流日官祿宮的天干	_流日官祿宮四化 安四化
		流日田宅宮的天干	_流日田宅宮四化 安四化
		流日福德宮的天干	_流日福德宮四化 安四化
		流日父母宮的天干	_流日父母宮四化 安四化
		;		
		
	: 流時四化 ( --- )
		_流時四化 四化歸零	
 		流時的天干 _流時四化 安四化
 		;
 		
 	: 流時十二宮四化 ( --- )
 		_流時命宮四化 十二宮四化歸零
		流時命宮的天干		_流時命宮四化  安四化
		流時兄弟宮的天干	_流時兄弟宮四化 安四化
		流時夫妻宮的天干	_流時夫妻宮四化 安四化
		流時子女宮的天干	_流時子女宮四化 安四化
		流時財帛宮的天干	_流時財帛宮四化 安四化
		流時疾厄宮的天干	_流時疾厄宮四化 安四化
		流時遷移宮的天干	_流時遷移宮四化 安四化
		流時僕役宮的天干	_流時僕役宮四化 安四化
		流時官祿宮的天干	_流時官祿宮四化 安四化
		流時田宅宮的天干	_流時田宅宮四化 安四化
		流時福德宮的天干	_流時福德宮四化 安四化
		流時父母宮的天干	_流時父母宮四化 安四化
		;		



	星情四化 子宮
	星情四化 丑宮	
	星情四化 寅宮
	星情四化 卯宮
	星情四化 辰宮
	星情四化 巳宮	
	星情四化 午宮
	星情四化 未宮
	星情四化 申宮
	星情四化 酉宮	
	星情四化 戌宮
	星情四化 亥宮
	