\ http://www.360doc.com/content/13/0627/15/12927974_295915590.shtml

: 命身主論斷 ( -- )
 s" 初習鬥術者，只要對星曜性質有所了解即可論人形性．是以對命身主因不解或困惑而忽略，其實命身主在斗術上佔有相當地位，就個人習得，探討如下，以供參考．" 斷文
 s" 一般說法：命身主乃統馭命身宮三方四正星曜之形性與形貌，但因顯像不明顯，而被忽略．" 斷文
 s" 命身主既是統馭命身宮三方之星曜，則陽宅風水之擇定，或許可以命身主為依據，尤以命無主星或雙星者，僅供參考．" 斷文
 s" 但若命身主出現在命身宮三方四正宮位裡，命身主常常成顯性作用．尤以命宮無主星或命身宮星曜閒弱時，一般看命宮強弱，除少數例外．" 斷文
 s" 是以星曜之廟旺利陷及長生十二神論，其實命身主座宮及所同星曜亦是參考因素之一．" 斷文
 s" 是以書雲二主逢劫空，衣食不足，謀為不遂．命身主是否被衝破，乃是判斷災厄輕重，是否死亡之因素之一．" 斷文
 s" 命主身主乃源於星宗法。西洋占星術有所謂的守護星: 比如天蠍座卯宮，守護星是火星、冥王星。" 斷文
 s" 而星宗以卯戌合火，以火為宮主，西洋則稱宮主星。" 斷文
 s" 鬥數就是承接了星宗的體系，故有命主、身主、宮主(夫妻主、兄弟主等等)。" 斷文
 s" 論諸星分屬南北斗化吉凶並分屬五行，紫微屬土中天星，南北斗化帝座為官祿主。天機星屬木男北斗化善為兄弟主。" 斷文
 s" 事實上十四主星都有所化，配合化、主、及星的陰陽五行就能抓住主星的賦性。" 斷文
 ;

: 命主論斷 ( -- ) 
 s" 命主乃先天俱有的特性，是指先天的格局與生俱有非自己今生努力的結果，乃先天魂所居之所，佛家曰人假四大地水火風而成形，此為之先天也。" 斷文
 s" 喜入於命、財、帛、官、祿、田、宅、子女、夫妻、福德宮與主星廟旺與長生帝旺等旺宮較好。" 斷文 
 s" 如果在友、疾、遷、父宮則次之，加煞星則更不好。" 斷文
 s" 命主是用來輔助命宮的，代表環境對人類命運的影響。" 斷文
 s" 命主所到的宮位，會因這個宮吉而成，也會因這所代表的意義也就有所不同，在分析判斷時，先看命主是何星曜，次看落入何宮稱，再看逢吉或逢凶，最後才來論斷是好是壞。" 斷文 
 s" 命主逢吉的人，可以在人生生涯中，盡量的去做最利於自己的選擇。" 斷文
 s" 而命主落位差又逢凶的人，也不必唉聲嘆氣，只要懂得兇在何處，問題出現在那裡，就可以趨吉避凶，這一生中也就沒有什麼悔吝了！" 斷文 
 s" 命主星是命宮的守護神，主宰人的富貴貧賤禍福壽夭，與精神思想有關，是先天具有的特性。在具體的運用中，命主星的好壞僅作為判斷命宮吉凶的補充。" 斷文
 s" 命主星宜廟旺、在生旺之宮、與吉星同宮則為吉論；若失陷、在死絕空亡之宮、與煞星同宮則為凶論。" 斷文
 s" 命主星廟旺、在生旺之宮、得宮生，可加強命宮的力量，再得吉星吉格，必可增強富貴福壽的力度；若逢失陷、在死絕之宮、受宮克，可減弱命宮的力量，再逢凶星兇格，則增強貧賤夭殘的力度。" 斷文
 ;


: 命主為貪狼 ( -- ) 
 s" 屬性:追求物質享受愛恨不一的慾望類型" 斷文
 s" 命主為貪狼，是官祿宮主，即表示事業上的成敗與人際關係息息相關，雖然官祿宮主有五顆，但命主為貪狼時，就凸顯了這顆星的重要性，也就是說人際關係對你命運會有很大的影響。" 斷文
 ;
 
: 命主為巨門 ( -- ) 
 s" 屬性: 杞人憂天而又愛發牢騷的是非類型" 斷文
 s" 命主為巨門，巨門化暗，亦化權，也主慾望，所以慾望會對他的命運構成很大的影響，當慾望得以控制，而巨門逢吉時，主成就大，而野心勃勃，而慾望無窮無盡時，就會因自己的私慾而造成人生的遺憾，容易出問題，大起大落。
 s" 對凶星的抵抗力較弱，所以最好不要再逢凶，否則真是雪上加霜，禍不單行。
 ;
 
: 命主為祿存 ( -- ) 
 s" 屬性: 慈心忠厚而又多才多藝的表現類型" 斷文
 s" 對凶星的抵抗力較弱，所以最好不要再逢凶，否則真是雪上加霜，禍不單行。" 斷文
 s" 命主為祿存，古書明載祿存是代表出生的環境。" 斷文
 s" 主社會地位、爵貴。" 斷文
 s" 命主是祿存的人，似乎不太好，因為要比家世、出生的環境。" 斷文
 s" 最好是出生在世家、官宦之家、書香門第。說真的，出生的環境並不是我們可以選擇的。" 斷文
 s" 但還是可以有補救的方法，那就是要在這一生當中，不斷的力爭上游，出人頭地，獲得社會地位與爵祿，將這二種結合在一起，命會比較好。" 斷文
 ;
 
: 命主為文曲 ( -- ) 
 s" 命主為文曲，文曲本身是一顆才藝之星，與知名度、才藝、讀書、考試、官位、科甲有關。若本身有官位的話，亦會偏重在兩榜進士上，會因環境而造就了他，所以要善用傳播媒體，要在他的行業中打響知名度才行。" 斷文
 s" 另外文曲亦代表情緒管理，所以命主是文曲的人，要特別注意自己的情緒，以免讓人覺得過於情緒化，甚至於是歇斯底里，那就不妙了。" 斷文
 s" 屬性: 悠閒儒雅而又口才辯佞的粉飾類型" 斷文
 s" 對凶星的抵抗力較弱，所以最好不要再逢凶，否則真是雪上加霜，禍不單行。" 斷文 
 ;
 
: 命主為廉貞 ( -- ) 
 s" 命主為廉貞星，廉貞星亦為官祿宮宮主，主控事業的表現、衝刺、爆發力。" 斷文
 s" 所以一生當中都脫離不了事業的打拼與奮鬥。假如廉貞星廟旺逢吉，只要在事業上有所奮鬥，就可以有不錯的成就，如落陷逢凶，則是沖得滿頭包時，也還是樂在其中。" 斷文
 s" 屬性: 心直口快而又狂傲任性的狂妄類型" 斷文
 ;
 
: 命主為武曲 ( -- ) 
 s" 屬性: 面對現實而又身體力行的武勇類型" 斷文
 s" 命主為武曲星，武曲為財帛主，也是一顆權曜，有很多人會誤解財帛主，一定是主其人一生會很有錢，其實不然，在財帛主中的武曲星，並不主一定會有錢，而是主財經理念，" 斷文
 s" 換言之，要有財經理念才行，要有專業的財經理念，才能把武曲星的生命特質顯現出來，更進一步的去創造累積他的財富，造就他生命的一切。" 斷文
 s" 而武曲星本身主孤，故不可一意孤行，過剛則損，反而對他而言，是一種負面的生命能量。
 ;
 
: 命主為破軍 ( -- ) 
 s" 屬性:動輒損人而又不顧後果的開創類型" 斷文
 s" 命主為破軍星，破軍為夫妻、子女、奴僕主，化耗，亦化權。" 斷文
 s" 所以這一生命運中所有的事務都與配偶、小孩、部屬，有著密不可分的關聯。" 斷文
 s" 如果這些人可以給予他助力，那肯定可以有相當不錯的表現，如果這些人是他人生中的包袱，也會使得他一生都在為這些人付出，而使得自己非常的疲累，一生無所獲。" 斷文 
 ;

: 命主星入命宮    ( -- ) s" 命主星入命宮，為龍歸大海，適得其所，英雄有用武之地，逢吉更吉，逢凶減兇。" 斷文 ;
: 命主星入身宮    ( -- ) s" 命主星入身宮，為龍歸大海，適得其所，英雄有用武之地，逢吉更吉，逢凶減兇。" 斷文 ;
: 命主星入兄弟宮  ( -- ) s" 命主星入兄弟宮，得兄弟的助力，吉則兄弟和睦有助，兇則不和少助。" 斷文 ;
: 命主星入奴僕宮  ( -- ) s" 命主星入奴僕宮，奴僕為卑賤的宮位，縱有吉星也勞碌。" 斷文 ;
: 命主星入遷移宮  ( -- ) s" 命主星入遷移宮，變動、遷動大，吉則增利，兇則減利。" 斷文 ;
: 命主星入田宅宮  ( -- ) s" 命主星入田宅宮，田宅為財庫，吉則增加積聚財富能力；兇則減少聚財能力。" 斷文 ;
: 命主星入子孫宮  ( -- ) s" 命主星入子孫宮，好比父母投靠子孫，子孫孝順，吉則增吉，兇則減兇。" 斷文 ;
: 命主星入夫妻宮  ( -- ) s" 命主星入夫妻宮，夫唱婦隨，夫妻和好，吉則增吉，兇則減兇。" 斷文 ;
: 命主星入疾厄宮  ( -- ) s" 命主星入疾厄宮，宮兇主疾病，宮吉主工作環境好，財祿少年發。" 斷文 ;
: 命主星入財官宮  ( -- ) s" 命主星入財官宮，倚靠財帛與事業，升官發財有望。" 斷文 ;
: 命主星入父母宮  ( -- ) s" 命主星入父母宮，得父母的籠愛和恩惠，前途光明。" 斷文 ;

: 身主論斷 ( -- ) 
 s" 身主乃後天造作的特質，是指後天的格局是您後天努力的結果是您一生的執著點，乃先天魄所居之所，未成形象前的執性，是先天所做所為導致如今的性為，應以前一年、月、日、時、分、秒視之，考承繼因緣所致成。" 斷文
 s" 其星宿以生年支安排。喜入命、財、帛、田宅、子女、夫妻、官祿、福德宮與主星廟旺與長生帝旺等宮較好。" 斷文
 s" 如果在兄、友、疾、遷、父宮則次之，加煞星則不好。" 斷文
 s" 身主星是身宮的守護神，主掌營養、修為、陰騭、福德等，與軀體、魄力、後天運程有關，和身宮一樣，是一生最執迷的地方，屬後天努力的因素。在具體運用中，身主星的好壞僅作為判斷身宮吉凶的補充。" 斷文 
 s" 身主星宜廟旺、在生旺之宮、與吉星同宮則為吉論；若失陷、在死絕空亡之宮、與煞星同宮則為凶論。" 斷文
 s" 身主星廟旺、在生旺之宮、得宮生，可加強身宮的力量，再得吉星吉格，必可增強富貴福壽的力度；若逢失陷、在死絕之宮、受宮克，可減弱命宮的力量，再逢凶星兇格，則增強貧賤夭殘的力度。" 斷文 
 ;

: 身主為火星 ( -- ) 
 s" 屬性:氣燥 橫發 乖咎" 斷文
 ;

: 身主為天相 ( -- ) 
 s" 屬性:輔導 明亮 桃花" 斷文
 ;
 
: 身主為天梁 ( -- ) 
 s" 屬性:理論 老大 蔽蔭" 斷文
 ;
 
: 身主為天同 ( -- ) 
 s" 屬性:享福 天真 空洞" 斷文
 ;
 
: 身主為文昌 ( -- ) 
 s" 屬性:科名 桃花 文筆" 斷文
 ;    
 
: 身主為天機 ( -- ) 
 s" 屬性:善變 主軸 隨順" 斷文
 ; 

: 身主星入命宮    ( -- ) s" 身主星入命宮，為龍歸大海，適得其所，英雄有用武之地，逢吉更吉，逢凶減兇。" 斷文 ;
: 身主星入身宮    ( -- ) s" 身主星入身宮，為龍歸大海，適得其所，英雄有用武之地，逢吉更吉，逢凶減兇。" 斷文 ;
: 身主星入兄弟宮  ( -- ) s" 身主星入兄弟宮，得兄弟的助力，吉則兄弟和睦有助，兇則不和少助。" 斷文 ;
: 身主星入奴僕宮  ( -- ) s" 身主星入奴僕宮，奴僕為卑賤的宮位，縱有吉星也勞碌。" 斷文 ;
: 身主星入遷移宮  ( -- ) s" 身主星入遷移宮，變動、遷動大，吉則增利，兇則減利。" 斷文 ;
: 身主星入田宅宮  ( -- ) s" 身主星入田宅宮，田宅為財庫，吉則增加積聚財富能力；兇則減少聚財能力。" 斷文 ;
: 身主星入子孫宮  ( -- ) s" 身主星入子孫宮，好比父母投靠子孫，子孫孝順，吉則增吉，兇則減兇。" 斷文 ;
: 身主星入夫妻宮  ( -- ) s" 身主星入夫妻宮，夫唱婦隨，夫妻和好，吉則增吉，兇則減兇。" 斷文 ;
: 身主星入疾厄宮  ( -- ) s" 身主星入疾厄宮，宮兇主疾病，宮吉主工作環境好，財祿少年發。" 斷文 ;
: 身主星入財官宮  ( -- ) s" 身主星入財官宮，倚靠財帛與事業，升官發財有望。" 斷文 ;
: 身主星入父母宮  ( -- ) s" 身主星入父母宮，得父母的籠愛和恩惠，前途光明。" 斷文 ;
