\ 本命遷移宮四化
\ 遷移宮四化飛星--化祿 

	: 遷移宮化祿入命宮斷文 ( --- ) 
		  s" 在外賺錢，自己能享受。" 斷文 
		 ;
		 
	: 遷移宮化祿入兄弟宮斷文 ( --- )
	     s" 在外能得兄弟之助賺錢，也能幫助弟兄。" 斷文 
		; 

	: 遷移宮化祿入夫妻宮斷文 ( --- )
	     s" 在外事業得意,能得到配偶之助。" 斷文 
		; 

	: 遷移宮化祿入子女宮斷文 ( --- )    
		 s" 主變動、驛馬宜外出、出國。" 斷文 
		; 

	: 遷移宮化祿入財帛宮斷文 ( --- )            
		 s" 在外財運。" 斷文 
		; 

	: 遷移宮化祿入疾厄宮斷文 ( --- )                        
		 s"  在外如意，身心愉快、人緣佳。" 斷文 
		 ; 

	: 遷移宮自化祿斷文 ( --- )           
		 s"  在外得意，賺錢容易，自賺自花、在外時間長。" 斷文 
		 ; 

	: 遷移宮化祿入僕役宮斷文 ( --- )            
		 s" 在外朋友多，人緣佳，交際廣、能得朋友之助。" 斷文 
		 ; 

	: 遷移宮化祿入官祿宮斷文 ( --- )
		  s"  在外賺錢機會多。" 斷文 
		 ; 

	: 遷移宮化祿入田宅宮斷文 ( --- )
		  s" 主變動、驛馬、宜出外。" 斷文 
		 ; 

	: 遷移宮化祿入福德宮斷文 ( --- )
		  s" 在外財運佳，可享受。" 斷文 
		 ; 

	: 遷移宮化祿入父母宮斷文 ( --- )
		  s" 在外有長輩貴人，少操心。" 斷文 
		 ; 

\ 遷移宮四化飛星--化權 

	: 遷移宮化權入命宮斷文 ( --- )
		  s" 在外得意，欲掌權，易有糾紛。" 斷文 
		 ; 

	: 遷移宮化權入兄弟宮斷文 ( --- )
		  s" 在外兄友多、交際手腕佳。" 斷文 
		 ; 

	: 遷移宮化權入夫妻宮斷文 ( --- )
		  s" 在外得意，配偶掌權，易有意見。" 斷文 
		 ; 

	: 遷移宮化權入子女宮斷文 ( --- )
		  s" 主變動、驛馬、動的跡象較小。" 斷文 
		 ; 

	: 遷移宮化權入財帛宮斷文 ( --- )
		  s" 在外為財忙碌。" 斷文 
		 ; 

	: 遷移宮化權入疾厄宮斷文 ( --- )
		  s" 在外如意，權力、慾望高，易有紛爭。" 斷文 
		 ; 

	: 遷移宮自化權斷文 ( --- )
		  s" 在外欲掌權，喜表現、易得罪小人，且個性強。" 斷文 
		 ; 

	: 遷移宮化權入僕役宮斷文 ( --- )
		  s" 在外兄友多、交際手腕佳。" 斷文 
		 ; 

	: 遷移宮化權入官祿宮斷文 ( --- )
		  s" 創業有衝勁、責任心重，任職易受上司賞識。" 斷文 
		 ; 

	: 遷移宮化權入田宅宮斷文 ( --- )
		  s" 主變動、驛馬、動的跡象較小。" 斷文 
		 ; 

	: 遷移宮化權入福德宮斷文 ( --- )
		  s" 在外財佳，享受較海派。" 斷文 
		 ; 

	: 遷移宮化權入父母宮斷文 ( --- )
		  s" 在外有長輩、貴人適時幫助。" 斷文 
		 ; 

\ 遷移宮四化飛星--化科 

	: 遷移宮化科入命宮斷文 ( --- )
		  s" 人緣佳，在外有貴人。" 斷文 
		 ; 

	: 遷移宮化科入兄弟宮斷文 ( --- )
		  s" 在外有兄弟幫助。" 斷文 
		 ; 

	: 遷移宮化科入夫妻宮斷文 ( --- )
		  s"  在外事業平順，使配偶無後顧之憂。" 斷文 
		 ;

	: 遷移宮化科入子女宮斷文 ( --- )
		  s"  主變動、驛馬動的跡象，但順利。" 斷文 
		 ; 

	: 遷移宮化科入財帛宮斷文 ( --- )
		  s"  在外財運平順。" 斷文 
		 ; 

	: 遷移宮化科入疾厄宮斷文 ( --- )
		  s"  人緣佳、有貴人。" 斷文 
		 ; 

	: 遷移宮自化科斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 遷移宮化科入僕役宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 遷移宮化科入官祿宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 遷移宮化科入田宅宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 遷移宮化科入福德宮斷文 ( --- )
		  s"  " 斷文 
		 ; 

	: 遷移宮化科入父母宮斷文 ( --- )
		  s" " 斷文 
		 ; 

\ 遷移宮因化飛星--化忌 

	: 遷移宮化忌入命宮斷文 ( --- )
		  s" 在外人緣不佳，有意外之災、不順。" 斷文 
		 ;

	: 遷移宮化忌入兄弟宮斷文 ( --- )
		  s"  在外兄友多損，交際手腕差。" 斷文 
		 ; 

	: 遷移宮化忌入夫妻宮斷文 ( --- )
		  s" 在外不順，替配偶增加麻煩，且事業不順。" 斷文 
		 ; 

	: 遷移宮化忌入子女宮斷文 ( --- )
		  s" 主變動、驛馬、較不順。" 斷文 
		 ; 

	: 遷移宮化忌入財帛宮斷文 ( --- )
		  s" 在外求財不如意。" 斷文 
		 ; 

	: 遷移宮化忌入疾厄宮斷文 ( --- )
		  s" 在外不順，影響身心。" 斷文 
		 ; 

	: 遷移宮自化忌斷文 ( --- )
		  s" 出外不順，常有糾紛，人緣欠佳，個性較古怪。" 斷文 
		 ; 

	: 遷移宮化忌入僕役宮斷文 ( --- )
		  s" 在外損及兄友，增加麻煩，且兄友無助。" 斷文 
		 ; 

	: 遷移宮化忌入官祿宮斷文 ( --- )
		  s" 在外多做少成，行事不順。" 斷文 
		 ; 

	: 遷移宮化忌入田宅宮斷文 ( --- )
		  s" 主變動、驛馬、較不順。" 斷文 
		 ; 

	: 遷移宮化忌入福德宮斷文 ( --- )
		  s" 在外不如意、福澤差、勞碌。" 斷文 
		 ; 

	: 遷移宮化忌入父母宮斷文 ( --- )
		  s" 在外行事不順，讓父母操心。" 斷文
		 	s" 外出不順，注意風寒和煩心之事。" 斷文
		 ;

	: 遷移宮自化祿	   ( --- ) 遷移宮的天干 化祿 遷移宮的地支	= if 遷移宮自化祿斷文			then ;
	: 遷移宮化祿入兄弟宮 ( --- ) 遷移宮的天干 化祿 兄弟宮的地支	= if 遷移宮化祿入兄弟宮斷文 	then ;
	: 遷移宮化祿入夫妻宮 ( --- ) 遷移宮的天干 化祿 遷移宮的地支	= if 遷移宮化祿入夫妻宮斷文 	then ;
	: 遷移宮化祿入子女宮 ( --- ) 遷移宮的天干 化祿 子女宮的地支 = if 遷移宮化祿入子女宮斷文 	then ;
	: 遷移宮化祿入財帛宮 ( --- ) 遷移宮的天干 化祿 財帛宮的地支 = if 遷移宮化祿入財帛宮斷文	then ;
	: 遷移宮化祿入疾厄宮 ( --- ) 遷移宮的天干 化祿 疾厄宮的地支 = if 遷移宮化祿入疾厄宮斷文	then ;
	: 遷移宮化祿入命宮 ( --- ) 遷移宮的天干 化祿 命宮的地支 = if 遷移宮化祿入命宮斷文	then ;
	: 遷移宮化祿入僕役宮 ( --- ) 遷移宮的天干 化祿 僕役宮的地支 = if 遷移宮化祿入僕役宮斷文 	then ;
	: 遷移宮化祿入官祿宮 ( --- ) 遷移宮的天干 化祿 官祿宮的地支 = if 遷移宮化祿入官祿宮斷文 	then ;
	: 遷移宮化祿入田宅宮 ( --- ) 遷移宮的天干 化祿 田宅宮的地支 = if 遷移宮化祿入田宅宮斷文 	then ;
	: 遷移宮化祿入福德宮 ( --- ) 遷移宮的天干 化祿 福德宮的地支 = if 遷移宮化祿入福德宮斷文 	then ;
	: 遷移宮化祿入父母宮 ( --- ) 遷移宮的天干 化祿 父母宮的地支 = if 遷移宮化祿入父母宮斷文 	then ;

	: 遷移宮自化權	   ( --- ) 遷移宮的天干 化權 遷移宮的地支	= if 遷移宮自化權斷文			then ;
	: 遷移宮化權入兄弟宮 ( --- ) 遷移宮的天干 化權 兄弟宮的地支	= if 遷移宮化權入兄弟宮斷文 	then ;
	: 遷移宮化權入夫妻宮 ( --- ) 遷移宮的天干 化權 遷移宮的地支	= if 遷移宮化權入夫妻宮斷文 	then ;
	: 遷移宮化權入子女宮 ( --- ) 遷移宮的天干 化權 子女宮的地支 = if 遷移宮化權入子女宮斷文 	then ;
	: 遷移宮化權入財帛宮 ( --- ) 遷移宮的天干 化權 財帛宮的地支 = if 遷移宮化權入財帛宮斷文	then ;
	: 遷移宮化權入疾厄宮 ( --- ) 遷移宮的天干 化權 疾厄宮的地支 = if 遷移宮化權入疾厄宮斷文	then ;
	: 遷移宮化權入命宮 ( --- ) 遷移宮的天干 化權 命宮的地支 = if 遷移宮化權入命宮斷文	then ;
	: 遷移宮化權入僕役宮 ( --- ) 遷移宮的天干 化權 僕役宮的地支 = if 遷移宮化權入僕役宮斷文 	then ;
	: 遷移宮化權入官祿宮 ( --- ) 遷移宮的天干 化權 官祿宮的地支 = if 遷移宮化權入官祿宮斷文 	then ;
	: 遷移宮化權入田宅宮 ( --- ) 遷移宮的天干 化權 田宅宮的地支 = if 遷移宮化權入田宅宮斷文 	then ;
	: 遷移宮化權入福德宮 ( --- ) 遷移宮的天干 化權 福德宮的地支 = if 遷移宮化權入福德宮斷文 	then ;
	: 遷移宮化權入父母宮 ( --- ) 遷移宮的天干 化權 父母宮的地支 = if 遷移宮化權入父母宮斷文 	then ;

	: 遷移宮自化科	   ( --- ) 遷移宮的天干 化科 遷移宮的地支	= if 遷移宮自化科斷文			then ;
	: 遷移宮化科入兄弟宮 ( --- ) 遷移宮的天干 化科 兄弟宮的地支	= if 遷移宮化科入兄弟宮斷文 	then ;
	: 遷移宮化科入夫妻宮 ( --- ) 遷移宮的天干 化科 遷移宮的地支	= if 遷移宮化科入夫妻宮斷文 	then ;
	: 遷移宮化科入子女宮 ( --- ) 遷移宮的天干 化科 子女宮的地支 = if 遷移宮化科入子女宮斷文 	then ;
	: 遷移宮化科入財帛宮 ( --- ) 遷移宮的天干 化科 財帛宮的地支 = if 遷移宮化科入財帛宮斷文	then ;
	: 遷移宮化科入疾厄宮 ( --- ) 遷移宮的天干 化科 疾厄宮的地支 = if 遷移宮化科入疾厄宮斷文	then ;
	: 遷移宮化科入命宮 ( --- ) 遷移宮的天干 化科 命宮的地支 = if 遷移宮化科入命宮斷文	then ;
	: 遷移宮化科入僕役宮 ( --- ) 遷移宮的天干 化科 僕役宮的地支 = if 遷移宮化科入僕役宮斷文 	then ;
	: 遷移宮化科入官祿宮 ( --- ) 遷移宮的天干 化科 官祿宮的地支 = if 遷移宮化科入官祿宮斷文 	then ;
	: 遷移宮化科入田宅宮 ( --- ) 遷移宮的天干 化科 田宅宮的地支 = if 遷移宮化科入田宅宮斷文 	then ;
	: 遷移宮化科入福德宮 ( --- ) 遷移宮的天干 化科 福德宮的地支 = if 遷移宮化科入福德宮斷文 	then ;
	: 遷移宮化科入父母宮 ( --- ) 遷移宮的天干 化科 父母宮的地支 = if 遷移宮化科入父母宮斷文 	then ;

	: 遷移宮自化忌	   ( --- ) 遷移宮的天干 化忌 遷移宮的地支	= if 遷移宮自化忌斷文			then ;
	: 遷移宮化忌入兄弟宮 ( --- ) 遷移宮的天干 化忌 兄弟宮的地支	= if 遷移宮化忌入兄弟宮斷文 	then ;
	: 遷移宮化忌入夫妻宮 ( --- ) 遷移宮的天干 化忌 遷移宮的地支	= if 遷移宮化忌入夫妻宮斷文 	then ;
	: 遷移宮化忌入子女宮 ( --- ) 遷移宮的天干 化忌 子女宮的地支 = if 遷移宮化忌入子女宮斷文 	then ;
	: 遷移宮化忌入財帛宮 ( --- ) 遷移宮的天干 化忌 財帛宮的地支 = if 遷移宮化忌入財帛宮斷文	then ;
	: 遷移宮化忌入疾厄宮 ( --- ) 遷移宮的天干 化忌 疾厄宮的地支 = if 遷移宮化忌入疾厄宮斷文	then ;
	: 遷移宮化忌入命宮 ( --- ) 遷移宮的天干 化忌 命宮的地支 = if 遷移宮化忌入命宮斷文	then ;
	: 遷移宮化忌入僕役宮 ( --- ) 遷移宮的天干 化忌 僕役宮的地支 = if 遷移宮化忌入僕役宮斷文 	then ;
	: 遷移宮化忌入官祿宮 ( --- ) 遷移宮的天干 化忌 官祿宮的地支 = if 遷移宮化忌入官祿宮斷文 	then ;
	: 遷移宮化忌入田宅宮 ( --- ) 遷移宮的天干 化忌 田宅宮的地支 = if 遷移宮化忌入田宅宮斷文 	then ;
	: 遷移宮化忌入福德宮 ( --- ) 遷移宮的天干 化忌 福德宮的地支 = if 遷移宮化忌入福德宮斷文 	then ;
	: 遷移宮化忌入父母宮 ( --- ) 遷移宮的天干 化忌 父母宮的地支 = if 遷移宮化忌入父母宮斷文 	then ;


	: 遷移宮四化 ( --- )
		遷移宮化祿入疾厄宮
		遷移宮化祿入兄弟宮
		遷移宮化祿入夫妻宮
		遷移宮化祿入子女宮
		遷移宮化祿入財帛宮
		遷移宮自化祿
		遷移宮化祿入命宮
		遷移宮化祿入僕役宮
		遷移宮化祿入官祿宮
		遷移宮化祿入田宅宮
		遷移宮化祿入福德宮
		遷移宮化祿入父母宮
		
		遷移宮化權入疾厄宮
		遷移宮化權入兄弟宮
		遷移宮化權入夫妻宮
		遷移宮化權入子女宮
		遷移宮化權入財帛宮
		遷移宮自化權
		遷移宮化權入命宮
		遷移宮化權入僕役宮
		遷移宮化權入官祿宮
		遷移宮化權入田宅宮
		遷移宮化權入福德宮
		遷移宮化權入父母宮
		
		遷移宮化科入疾厄宮
		遷移宮化科入兄弟宮
		遷移宮化科入夫妻宮
		遷移宮化科入子女宮
		遷移宮化科入財帛宮
		遷移宮自化科
		遷移宮化科入命宮
		遷移宮化科入僕役宮
		遷移宮化科入官祿宮
		遷移宮化科入田宅宮
		遷移宮化科入福德宮
		遷移宮化科入父母宮
		
		遷移宮化忌入疾厄宮
		遷移宮化忌入兄弟宮
		遷移宮化忌入夫妻宮
		遷移宮化忌入子女宮
		遷移宮化忌入財帛宮
		遷移宮自化忌
		遷移宮化忌入命宮
		遷移宮化忌入僕役宮
		遷移宮化忌入官祿宮
		遷移宮化忌入田宅宮
		遷移宮化忌入福德宮
		遷移宮化忌入父母宮
		;