張燕南的命盤 男 丁未 壬寅 辛亥 癸巳
壬 子 本命田宅宮 天同 太陰 生年天同化權 生年太陰化祿        
癸 丑 本命官祿宮 武曲 貪狼                      
壬 寅 本命僕役宮 太陽 巨門 火星   生年巨門化忌        
癸 卯 本命遷移宮 天相 鈴星                        
甲 辰 本命疾厄宮 天機 天梁 左輔 生年天機化科 地劫   
乙 巳 本命財帛宮 紫微 七殺 文昌 陀羅 天馬   
丙 午 本命子女宮 祿存 地空                        
丁 未 本命夫妻宮 擎羊                               
戊 申 本命兄弟宮                                     
己 酉 本命命宮   廉貞 破軍 文曲 天鉞          
庚 戌 本命父母宮 右弼                               
辛 亥 本命福德宮 天府 天魁                        
                
              
