			水瓶座 天同星 太陰星 化權星 化祿星              五星同宮		在本命田宅宮
			魔羯座 武曲星 貪狼星                                        三星同宮		在本命官祿宮
			人馬座 太陽星 巨門星 火星     化忌星              五星同宮		在本命僕役宮
			天蠍座 天相星 鈴星                                            三星同宮		在本命遷移宮
			天秤座 天機星 天梁星 左輔星 化科星 地劫星 六星同宮		在本命疾厄宮
			處女座 紫微星 七殺星 文昌星 陀羅星 天馬星 六星同宮		在本命財帛宮
			獅子座 祿存星 地空星                                        三星同宮		在本命子女宮
			巨蟹座 擎羊星                                                     同宮		在本命夫妻宮
			雙子座                                                                  			在本命兄弟宮
			金牛座 廉貞星 破軍星 文曲星 天鉞星              五星同宮		在本命命宮
			白羊座 右弼星                                                     同宮		在本命父母宮
			雙魚座 天府星 天魁星                                        三星同宮		在本命福德宮
	: 張燕南
		cls
		本命 192 dump	
		;