\ 本命疾厄宮四化
\ 疾厄宮四化飛星--化祿 

	: 疾厄宮化祿入命宮斷文 ( --- ) 
		  s" 有人緣、樂觀、身體佳。" 斷文 
		 ;
		 
	: 疾厄宮化祿入兄弟宮斷文 ( --- )
	     s" 與兄弟有緣，感情佳。" 斷文 
		; 

	: 疾厄宮化祿入夫妻宮斷文 ( --- )
	     s" 夫妻感情佳，疼愛妻(夫)子，性生活多。" 斷文 
		; 

	: 疾厄宮化祿入子女宮斷文 ( --- )     
		 s" 與子女緣佳，疼子女，且性生活多，沒節制。" 斷文 
		; 

	: 疾厄宮化祿入財帛宮斷文 ( --- )            
		 s" 財運佳，錢賺得輕鬆，較有長輩貴人助。" 斷文 
		; 

	: 疾厄宮自化祿斷文 ( --- )                       
		 s" 為人樂觀，不計較。" 斷文 
		 ; 

	: 疾厄宮化祿入遷移宮斷文 ( --- )            
		 s" 在外人緣佳，朋友多，喜玩樂。" 斷文 
		 ; 

	: 疾厄宮化祿入僕役宮斷文 ( --- )           
		 s" 與朋友緣佳，朋友多，且桃花較多。" 斷文 
		 ; 

	: 疾厄宮化祿入官祿宮斷文 ( --- )
		  s" 工作輕鬆愉快，同事間相處和睦。" 斷文 
		 ; 

	: 疾厄宮化祿入田宅宮斷文 ( --- )
		  s" 有財運、身體佳，在家平順。" 斷文 
		 ; 

	: 疾厄宮化祿入福德宮斷文 ( --- )
		  s" 人緣佳，福澤好，且身體佳。" 斷文 
		 ; 

	: 疾厄宮化祿入父母宮斷文 ( --- )
		  s" 與長輩有緣分，貴人多，在外得意。" 斷文 
		 ; 

\ 疾厄宮四化飛星--化權 

	: 疾厄宮化權入命宮斷文 ( --- )
		  s" 個性強，少年多災。" 斷文 
		 ; 

	: 疾厄宮化權入兄弟宮斷文 ( --- )
		  s" 與兄弟會有意見，會管兄弟。" 斷文 
		 ; 

	: 疾厄宮化權入夫妻宮斷文 ( --- )
		  s" 夫妻感情佳，性慾多，但較會管配偶，常有意見。" 斷文 
		 ; 

	: 疾厄宮化權入子女宮斷文 ( --- )
		  s" 與子女緣佳，管子女，且性生活多，沒節制。" 斷文 
		 ; 

	: 疾厄宮化權入財帛宮斷文 ( --- )
		  s" 賺錢較忙碌，錢的慾望大，較勞心。" 斷文 
		 ; 

	: 疾厄宮自化權斷文 ( --- )
		  s" 個性強且古怪、早熟。" 斷文 
		 ; 

	: 疾厄宮化權入遷移宮斷文 ( --- )
		  s" 在外忙碌，人緣佳，與朋友較有意見。" 斷文 
		 ; 

	: 疾厄宮化權入僕役宮斷文 ( --- )
		  s" 與朋友緣佳，想交更多的朋友。" 斷文 
		 ; 

	: 疾厄宮化權入官祿宮斷文 ( --- )
		  s" 工作較勞心，責任感重，管部屬同事。" 斷文 
		 ; 

	: 疾厄宮化權入田宅宮斷文 ( --- )
		  s" 財慾望高，在家掌權。" 斷文 
		 ; 

	: 疾厄宮化權入福德宮斷文 ( --- )
		  s" 人緣好，能力強，但勞碌勞心，且多災。" 斷文 
		 ; 

	: 疾厄宮化權入父母宮斷文 ( --- )
		  s" 有長輩適時幫助，在外常有意見糾紛。" 斷文 
		 ; 

\ 疾厄宮四化飛星--化科 

	: 疾厄宮化科入命宮斷文 ( --- )
		  s" 人緣佳，樂觀，身心愉快。" 斷文 
		 ; 

	: 疾厄宮化科入兄弟宮斷文 ( --- )
		  s" 與兄弟感情交往，適可而止。" 斷文 
		 ; 

	: 疾厄宮化科入夫妻宮斷文 ( --- )
		  s" 與配偶感情不和諧。" 斷文 
		 ;

	: 疾厄宮化科入子女宮斷文 ( --- )
		  s" 與子女緣佳，疼子女，且性生活多，但有節制。" 斷文 
		 ; 

	: 疾厄宮化科入財帛宮斷文 ( --- )
		  s" 錢財平順，量入為出。" 斷文 
		 ; 

	: 疾厄宮自化科斷文 ( --- )
		  s" 身體佳，風度好，病有良醫。" 斷文 
		 ; 

	: 疾厄宮化科入遷移宮斷文 ( --- )
		  s" 在外人緣佳與朋友交往適可而止，在外平安。" 斷文 
		 ; 

	: 疾厄宮化科入僕役宮斷文 ( --- )
		  s" 擇友而交，無損友。" 斷文 
		 ; 

	: 疾厄宮化科入官祿宮斷文 ( --- )
		  s" 工作輕鬆，同事相處融冾。" 斷文 
		 ; 

	: 疾厄宮化科入田宅宮斷文 ( --- )
		  s" 在家平順，錢財量入為出。" 斷文 
		 ; 

	: 疾厄宮化科入福德宮斷文 ( --- )
		  s" 人緣佳、身體亦佳，有貴人。" 斷文 
		 ; 

	: 疾厄宮化科入父母宮斷文 ( --- )
		  s" 與長輩相處融洽，有長輩貴人，在外平順。" 斷文 
		 ; 

\ 疾厄宮因化飛星--化忌 

	: 疾厄宮化忌入命宮斷文 ( --- )
		  s" 身體差，與朋友交往損害到自己身體。" 斷文 
		 	s" 主事業不賺錢。"  斷文		 
		 
		 ;

	: 疾厄宮化忌入兄弟宮斷文 ( --- )
		  s" 與兄弟緣分淡薄，感情不佳。" 斷文 
		 ; 

	: 疾厄宮化忌入夫妻宮斷文 ( --- )
		  s" 與配偶感情淡薄，生活不和諧。" 斷文
		 	s" 主事業不賺錢。"  斷文
		  
		 ; 

	: 疾厄宮化忌入子女宮斷文 ( --- )
		  s" 與子女緣薄，管子女，且性生活多，但有節制。" 斷文 
		 ; 

	: 疾厄宮化忌入財帛宮斷文 ( --- )
		  s" 錢財不順，為財勞碌而傷身。" 斷文 	 
		 ; 

	: 疾厄宮自化忌斷文 ( --- )
		  s" 體弱且較多病，勞碌，早熟。" 斷文 
		 ; 

	: 疾厄宮化忌入遷移宮斷文 ( --- )
		  s" 在外不順，與朋友交往損及身體，且較多災。" 斷文 
		 	s" 主事業不賺錢。"  斷文 
		 
		 ; 

	: 疾厄宮化忌入僕役宮斷文 ( --- )
		  s" 與朋友緣薄，因朋友而損害身體。" 斷文 
		 ; 

	: 疾厄宮化忌入官祿宮斷文 ( --- )
		  s" 工作不順，勞心勞力，同事相處不融洽。" 斷文 
		 ; 

	: 疾厄宮化忌入田宅宮斷文 ( --- )
		  s" 錢財不順，身體欠佳，勞碌。" 斷文 
		 ; 

	: 疾厄宮化忌入福德宮斷文 ( --- )
		  s" 體弱多病，人緣不佳，福澤差。" 斷文
		 		S" 主事業不賺錢。" 斷文 
		  
		 ; 

	: 疾厄宮化忌入父母宮斷文 ( --- )
		  s" 與長輩相處不佳，身體亦不好。在外不如意。" 斷文
		 	 s" 父母早逝。" 斷文
		 ;

	: 疾厄宮自化祿	   ( --- ) 疾厄宮的天干 化祿 疾厄宮的地支	= if 疾厄宮自化祿斷文			then ;
	: 疾厄宮化祿入兄弟宮 ( --- ) 疾厄宮的天干 化祿 兄弟宮的地支	= if 疾厄宮化祿入兄弟宮斷文 	then ;
	: 疾厄宮化祿入夫妻宮 ( --- ) 疾厄宮的天干 化祿 疾厄宮的地支	= if 疾厄宮化祿入夫妻宮斷文 	then ;
	: 疾厄宮化祿入子女宮 ( --- ) 疾厄宮的天干 化祿 子女宮的地支 = if 疾厄宮化祿入子女宮斷文 	then ;
	: 疾厄宮化祿入財帛宮 ( --- ) 疾厄宮的天干 化祿 財帛宮的地支 = if 疾厄宮化祿入財帛宮斷文	then ;
	: 疾厄宮化祿入命宮 ( --- ) 疾厄宮的天干 化祿 命宮的地支 = if 疾厄宮化祿入命宮斷文	then ;
	: 疾厄宮化祿入遷移宮 ( --- ) 疾厄宮的天干 化祿 遷移宮的地支 = if 疾厄宮化祿入遷移宮斷文	then ;
	: 疾厄宮化祿入僕役宮 ( --- ) 疾厄宮的天干 化祿 僕役宮的地支 = if 疾厄宮化祿入僕役宮斷文 	then ;
	: 疾厄宮化祿入官祿宮 ( --- ) 疾厄宮的天干 化祿 官祿宮的地支 = if 疾厄宮化祿入官祿宮斷文 	then ;
	: 疾厄宮化祿入田宅宮 ( --- ) 疾厄宮的天干 化祿 田宅宮的地支 = if 疾厄宮化祿入田宅宮斷文 	then ;
	: 疾厄宮化祿入福德宮 ( --- ) 疾厄宮的天干 化祿 福德宮的地支 = if 疾厄宮化祿入福德宮斷文 	then ;
	: 疾厄宮化祿入父母宮 ( --- ) 疾厄宮的天干 化祿 父母宮的地支 = if 疾厄宮化祿入父母宮斷文 	then ;

	: 疾厄宮自化權	   ( --- ) 疾厄宮的天干 化權 疾厄宮的地支	= if 疾厄宮自化權斷文			then ;
	: 疾厄宮化權入兄弟宮 ( --- ) 疾厄宮的天干 化權 兄弟宮的地支	= if 疾厄宮化權入兄弟宮斷文 	then ;
	: 疾厄宮化權入夫妻宮 ( --- ) 疾厄宮的天干 化權 疾厄宮的地支	= if 疾厄宮化權入夫妻宮斷文 	then ;
	: 疾厄宮化權入子女宮 ( --- ) 疾厄宮的天干 化權 子女宮的地支 = if 疾厄宮化權入子女宮斷文 	then ;
	: 疾厄宮化權入財帛宮 ( --- ) 疾厄宮的天干 化權 財帛宮的地支 = if 疾厄宮化權入財帛宮斷文	then ;
	: 疾厄宮化權入命宮 ( --- ) 疾厄宮的天干 化權 命宮的地支 = if 疾厄宮化權入命宮斷文	then ;
	: 疾厄宮化權入遷移宮 ( --- ) 疾厄宮的天干 化權 遷移宮的地支 = if 疾厄宮化權入遷移宮斷文	then ;
	: 疾厄宮化權入僕役宮 ( --- ) 疾厄宮的天干 化權 僕役宮的地支 = if 疾厄宮化權入僕役宮斷文 	then ;
	: 疾厄宮化權入官祿宮 ( --- ) 疾厄宮的天干 化權 官祿宮的地支 = if 疾厄宮化權入官祿宮斷文 	then ;
	: 疾厄宮化權入田宅宮 ( --- ) 疾厄宮的天干 化權 田宅宮的地支 = if 疾厄宮化權入田宅宮斷文 	then ;
	: 疾厄宮化權入福德宮 ( --- ) 疾厄宮的天干 化權 福德宮的地支 = if 疾厄宮化權入福德宮斷文 	then ;
	: 疾厄宮化權入父母宮 ( --- ) 疾厄宮的天干 化權 父母宮的地支 = if 疾厄宮化權入父母宮斷文 	then ;

	: 疾厄宮自化科	   ( --- ) 疾厄宮的天干 化科 疾厄宮的地支	= if 疾厄宮自化科斷文			then ;
	: 疾厄宮化科入兄弟宮 ( --- ) 疾厄宮的天干 化科 兄弟宮的地支	= if 疾厄宮化科入兄弟宮斷文 	then ;
	: 疾厄宮化科入夫妻宮 ( --- ) 疾厄宮的天干 化科 疾厄宮的地支	= if 疾厄宮化科入夫妻宮斷文 	then ;
	: 疾厄宮化科入子女宮 ( --- ) 疾厄宮的天干 化科 子女宮的地支 = if 疾厄宮化科入子女宮斷文 	then ;
	: 疾厄宮化科入財帛宮 ( --- ) 疾厄宮的天干 化科 財帛宮的地支 = if 疾厄宮化科入財帛宮斷文	then ;
	: 疾厄宮化科入命宮 ( --- ) 疾厄宮的天干 化科 命宮的地支 = if 疾厄宮化科入命宮斷文	then ;
	: 疾厄宮化科入遷移宮 ( --- ) 疾厄宮的天干 化科 遷移宮的地支 = if 疾厄宮化科入遷移宮斷文	then ;
	: 疾厄宮化科入僕役宮 ( --- ) 疾厄宮的天干 化科 僕役宮的地支 = if 疾厄宮化科入僕役宮斷文 	then ;
	: 疾厄宮化科入官祿宮 ( --- ) 疾厄宮的天干 化科 官祿宮的地支 = if 疾厄宮化科入官祿宮斷文 	then ;
	: 疾厄宮化科入田宅宮 ( --- ) 疾厄宮的天干 化科 田宅宮的地支 = if 疾厄宮化科入田宅宮斷文 	then ;
	: 疾厄宮化科入福德宮 ( --- ) 疾厄宮的天干 化科 福德宮的地支 = if 疾厄宮化科入福德宮斷文 	then ;
	: 疾厄宮化科入父母宮 ( --- ) 疾厄宮的天干 化科 父母宮的地支 = if 疾厄宮化科入父母宮斷文 	then ;

	: 疾厄宮自化忌	   ( --- ) 疾厄宮的天干 化忌 疾厄宮的地支	= if 疾厄宮自化忌斷文			then ;
	: 疾厄宮化忌入兄弟宮 ( --- ) 疾厄宮的天干 化忌 兄弟宮的地支	= if 疾厄宮化忌入兄弟宮斷文 	then ;
	: 疾厄宮化忌入夫妻宮 ( --- ) 疾厄宮的天干 化忌 疾厄宮的地支	= if 疾厄宮化忌入夫妻宮斷文 	then ;
	: 疾厄宮化忌入子女宮 ( --- ) 疾厄宮的天干 化忌 子女宮的地支 = if 疾厄宮化忌入子女宮斷文 	then ;
	: 疾厄宮化忌入財帛宮 ( --- ) 疾厄宮的天干 化忌 財帛宮的地支 = if 疾厄宮化忌入財帛宮斷文	then ;
	: 疾厄宮化忌入命宮 ( --- ) 疾厄宮的天干 化忌 命宮的地支 = if 疾厄宮化忌入命宮斷文	then ;
	: 疾厄宮化忌入遷移宮 ( --- ) 疾厄宮的天干 化忌 遷移宮的地支 = if 疾厄宮化忌入遷移宮斷文	then ;
	: 疾厄宮化忌入僕役宮 ( --- ) 疾厄宮的天干 化忌 僕役宮的地支 = if 疾厄宮化忌入僕役宮斷文 	then ;
	: 疾厄宮化忌入官祿宮 ( --- ) 疾厄宮的天干 化忌 官祿宮的地支 = if 疾厄宮化忌入官祿宮斷文 	then ;
	: 疾厄宮化忌入田宅宮 ( --- ) 疾厄宮的天干 化忌 田宅宮的地支 = if 疾厄宮化忌入田宅宮斷文 	then ;
	: 疾厄宮化忌入福德宮 ( --- ) 疾厄宮的天干 化忌 福德宮的地支 = if 疾厄宮化忌入福德宮斷文 	then ;
	: 疾厄宮化忌入父母宮 ( --- ) 疾厄宮的天干 化忌 父母宮的地支 = if 疾厄宮化忌入父母宮斷文 	then ;


	: 疾厄宮四化 ( --- )
		疾厄宮化祿入命宮
		疾厄宮化祿入兄弟宮
		疾厄宮化祿入夫妻宮
		疾厄宮化祿入子女宮
		疾厄宮化祿入財帛宮
		疾厄宮自化祿
		疾厄宮化祿入遷移宮
		疾厄宮化祿入僕役宮
		疾厄宮化祿入官祿宮
		疾厄宮化祿入田宅宮
		疾厄宮化祿入福德宮
		疾厄宮化祿入父母宮
		
		疾厄宮化權入命宮
		疾厄宮化權入兄弟宮
		疾厄宮化權入夫妻宮
		疾厄宮化權入子女宮
		疾厄宮化權入財帛宮
		疾厄宮自化權
		疾厄宮化權入遷移宮
		疾厄宮化權入僕役宮
		疾厄宮化權入官祿宮
		疾厄宮化權入田宅宮
		疾厄宮化權入福德宮
		疾厄宮化權入父母宮
		
		疾厄宮化科入命宮
		疾厄宮化科入兄弟宮
		疾厄宮化科入夫妻宮
		疾厄宮化科入子女宮
		疾厄宮化科入財帛宮
		疾厄宮自化科
		疾厄宮化科入遷移宮
		疾厄宮化科入僕役宮
		疾厄宮化科入官祿宮
		疾厄宮化科入田宅宮
		疾厄宮化科入福德宮
		疾厄宮化科入父母宮
		
		疾厄宮化忌入命宮
		疾厄宮化忌入兄弟宮
		疾厄宮化忌入夫妻宮
		疾厄宮化忌入子女宮
		疾厄宮化忌入財帛宮
		疾厄宮自化忌
		疾厄宮化忌入遷移宮
		疾厄宮化忌入僕役宮
		疾厄宮化忌入官祿宮
		疾厄宮化忌入田宅宮
		疾厄宮化忌入福德宮
		疾厄宮化忌入父母宮
		;

