\ 本命財帛宮四化
\ 財帛宮四化飛星--化祿 

	: 財帛宮化祿入命宮斷文 ( --- ) 
		  s" 靠自己能力賺錢。" 斷文 
		 ;
		 
	: 財帛宮化祿入兄弟宮斷文 ( --- )
	     s" 賺錢之後幫助兄弟。" 斷文 
		; 

	: 財帛宮化祿入夫妻宮斷文 ( --- )
	     s" 賺錢之後，能蔭配偶。" 斷文 
		; 

	: 財帛宮化祿入子女宮斷文 ( --- )  
		 s" 合夥事業能賺錢，或子女較有錢。" 斷文 
		; 

	: 財帛宮自化祿斷文 ( --- )           
		 s" 自己賺錢、自己花、錢來得容易、花得輕鬆。" 斷文 
		; 

	: 財帛宮化祿入疾厄宮斷文 ( --- )                       
		 s"  賺錢較輕鬆、愉快。" 斷文 
		 ; 

	: 財帛宮化祿入遷移宮斷文 ( --- )           
		 s"  在外得意，出外賺錢機會多。" 斷文 
		 ; 

	: 財帛宮化祿入僕役宮斷文 ( --- )            
		 s" 靠朋友幫助賺錢或會資助朋友。" 斷文 
		 ; 

	: 財帛宮化祿入官祿宮斷文 ( --- )
		  s"  財由事業上賺來。" 斷文 
		 ; 

	: 財帛宮化祿入田宅宮斷文 ( --- )
		  s" 投資不動產行業。" 斷文 
		 ; 

	: 財帛宮化祿入福德宮斷文 ( --- )
		  s" 賺了錢，自己有福享受。" 斷文 
		 ; 

	: 財帛宮化祿入父母宮斷文 ( --- )
		  s" 有長輩貴人相助，能孝敬父母。" 斷文 
		 ; 

\ 財帛宮四化飛星--化權 

	: 財帛宮化權入命宮斷文 ( --- )
		  s" 靠自己，對財的慾望大，有錢想再增加。" 斷文 
		 ; 

	: 財帛宮化權入兄弟宮斷文 ( --- )
		  s" 賺錢之後，幫助兄弟或財權落入兄弟手中。" 斷文 
		 ; 

	: 財帛宮化權入夫妻宮斷文 ( --- )
		  s" 投資賺錢再增資。" 斷文 
		 ; 

	: 財帛宮化權入子女宮斷文 ( --- )
		  s" 財權落入配偶手中。" 斷文 
		 ; 

	: 財帛宮自化權斷文 ( --- )
		  s" 錢財慾望高，且自掌財權、獨資佳。" 斷文 
		 ; 

	: 財帛宮化權入疾厄宮斷文 ( --- )
		  s" 賺錢較忙碌，勞心。" 斷文 
		 ; 

	: 財帛宮化權入遷移宮斷文 ( --- )
		  s" 在外活動力強，賺錢機會多。" 斷文 
		 ; 

	: 財帛宮化權入僕役宮斷文 ( --- )
		  s" 可與朋友合夥投資，但財錢掌握在朋友手中。" 斷文 
		 ; 

	: 財帛宮化權入官祿宮斷文 ( --- )
		  s" 投資賺錢後，想再增資。" 斷文 
		 ; 

	: 財帛宮化權入田宅宮斷文 ( --- )
		  s" 投資不動產，賺錢再投資、投資慾強。" 斷文 
		 ; 

	: 財帛宮化權入福德宮斷文 ( --- )
		  s" 享受較海派。" 斷文 
		 ; 

	: 財帛宮化權入父母宮斷文 ( --- )
		  s" 需要錢時，能得到長輩幫助。" 斷文 
		 ; 

\ 財帛宮四化飛星--化科 

	: 財帛宮化科入命宮斷文 ( --- )
		  s" 錢賺多少、算多少、不積極，隨遇而安。" 斷文 
		 ; 

	: 財帛宮化科入兄弟宮斷文 ( --- )
		  s" 量入為出，幫助兄弟。" 斷文 
		 ; 

	: 財帛宮化科入夫妻宮斷文 ( --- )
		  s"  錢財平穩、配偶為貴人之一。" 斷文 
		 ;

	: 財帛宮化科入子女宮斷文 ( --- )
		  s"  合夥事業平順，賺錢多少算多少、不計較。" 斷文 
		 ; 

	: 財帛宮自化科斷文 ( --- )
		  s"  財源平順,無風波。" 斷文 
		 ; 

	: 財帛宮化科入疾厄宮斷文 ( --- )
		  s"  賺錢較輕鬆、平順。" 斷文 
		 ; 

	: 財帛宮化科入遷移宮斷文 ( --- )
		  s" 在外求財平順、貴人現。" 斷文 
		 ; 

	: 財帛宮化科入僕役宮斷文 ( --- )
		 財帛宮的天干 化科 僕役宮的地支
		  s" 朋友不會損到自己的錢財。" 斷文 
		 ; 

	: 財帛宮化科入官祿宮斷文 ( --- )
		  s" 事業投費，財力平穩。" 斷文 
		 ; 

	: 財帛宮化科入田宅宮斷文 ( --- )
		  s" 財拿回家用，平順節儉，量入為出。" 斷文 
		 ; 

	: 財帛宮化科入福德宮斷文 ( --- )
		  s"  量入為出之享受。" 斷文 
		 ; 

	: 財帛宮化科入父母宮斷文 ( --- )
		  s" 賺錢平順，不會讓父母傷神。" 斷文 
		 ; 

\ 財帛宮因化飛星--化忌 

	: 財帛宮化忌入命宮斷文 ( --- )
		  s" 守財、賺錢不容易但節儉。" 斷文 
		 ;

	: 財帛宮化忌入兄弟宮斷文 ( --- )
		  s"  因兄弟之事破財，或財落入兄弟手中。" 斷文 
		 ; 

	: 財帛宮化忌入夫妻宮斷文 ( --- )
		  s" 因配偶之事而破財或賺的錢落入配偶手中。" 斷文 
		 ; 

	: 財帛宮化忌入子女宮斷文 ( --- )
		  s" 投資不一定賺錢，子女零用很少。" 斷文
		 s" 主財不聚，與朋友投資合夥，錢會被拿走。" 斷文
		  
		 ; 

	: 財帛宮自化忌斷文 ( --- )
		  s" 自賺自花，但賺錢較辛苦。" 斷文 
		 ; 

	: 財帛宮化忌入疾厄宮斷文 ( --- )
		  s" 賺錢勞碌屬靠體力勞動者。" 斷文 
		 ; 

	: 財帛宮化忌入遷移宮斷文 ( --- )
		  s" 在外不順，賺錢難，投資損失，花錢較吝。" 斷文 
		 ; 

	: 財帛宮化忌入僕役宮斷文 ( --- )
		  s" 因朋友損財。" 斷文 
		 		S" 借不到錢，向朋友錢財周轉有困難。" 斷文
		 
		 ; 

	: 財帛宮化忌入官祿宮斷文 ( --- )
		  s" 投資事業，不一定賺錢。" 斷文 
		 ; 

	: 財帛宮化忌入田宅宮斷文 ( --- )
		  s" 守財不易，且錢財不聚。" 斷文 
		 ; 

	: 財帛宮化忌入福德宮斷文 ( --- )
		  s" 不管賺錢與否，均要享受，是非較多。" 斷文 
		 ; 

	: 財帛宮化忌入父母宮斷文 ( --- )
		  s" 周轉較會不靈，恐因財傷身。" 斷文
		 	s" 錢財被倒。" 斷文
		  
		 ;

	: 財帛宮自化祿	   ( --- ) 財帛宮的天干 化祿 財帛宮的地支	= if 財帛宮自化祿斷文			then ;
	: 財帛宮化祿入兄弟宮 ( --- ) 財帛宮的天干 化祿 兄弟宮的地支	= if 財帛宮化祿入兄弟宮斷文 	then ;
	: 財帛宮化祿入夫妻宮 ( --- ) 財帛宮的天干 化祿 財帛宮的地支	= if 財帛宮化祿入夫妻宮斷文 	then ;
	: 財帛宮化祿入子女宮 ( --- ) 財帛宮的天干 化祿 子女宮的地支 = if 財帛宮化祿入子女宮斷文 	then ;
	: 財帛宮化祿入命宮 ( --- ) 財帛宮的天干 化祿 命宮的地支 = if 財帛宮化祿入命宮斷文	then ;
	: 財帛宮化祿入疾厄宮 ( --- ) 財帛宮的天干 化祿 疾厄宮的地支 = if 財帛宮化祿入疾厄宮斷文	then ;
	: 財帛宮化祿入遷移宮 ( --- ) 財帛宮的天干 化祿 遷移宮的地支 = if 財帛宮化祿入遷移宮斷文	then ;
	: 財帛宮化祿入僕役宮 ( --- ) 財帛宮的天干 化祿 僕役宮的地支 = if 財帛宮化祿入僕役宮斷文 	then ;
	: 財帛宮化祿入官祿宮 ( --- ) 財帛宮的天干 化祿 官祿宮的地支 = if 財帛宮化祿入官祿宮斷文 	then ;
	: 財帛宮化祿入田宅宮 ( --- ) 財帛宮的天干 化祿 田宅宮的地支 = if 財帛宮化祿入田宅宮斷文 	then ;
	: 財帛宮化祿入福德宮 ( --- ) 財帛宮的天干 化祿 福德宮的地支 = if 財帛宮化祿入福德宮斷文 	then ;
	: 財帛宮化祿入父母宮 ( --- ) 財帛宮的天干 化祿 父母宮的地支 = if 財帛宮化祿入父母宮斷文 	then ;

	: 財帛宮自化權	   ( --- ) 財帛宮的天干 化權 財帛宮的地支	= if 財帛宮自化權斷文			then ;
	: 財帛宮化權入兄弟宮 ( --- ) 財帛宮的天干 化權 兄弟宮的地支	= if 財帛宮化權入兄弟宮斷文 	then ;
	: 財帛宮化權入夫妻宮 ( --- ) 財帛宮的天干 化權 財帛宮的地支	= if 財帛宮化權入夫妻宮斷文 	then ;
	: 財帛宮化權入子女宮 ( --- ) 財帛宮的天干 化權 子女宮的地支 = if 財帛宮化權入子女宮斷文 	then ;
	: 財帛宮化權入命宮 ( --- ) 財帛宮的天干 化權 命宮的地支 = if 財帛宮化權入命宮斷文	then ;
	: 財帛宮化權入疾厄宮 ( --- ) 財帛宮的天干 化權 疾厄宮的地支 = if 財帛宮化權入疾厄宮斷文	then ;
	: 財帛宮化權入遷移宮 ( --- ) 財帛宮的天干 化權 遷移宮的地支 = if 財帛宮化權入遷移宮斷文	then ;
	: 財帛宮化權入僕役宮 ( --- ) 財帛宮的天干 化權 僕役宮的地支 = if 財帛宮化權入僕役宮斷文 	then ;
	: 財帛宮化權入官祿宮 ( --- ) 財帛宮的天干 化權 官祿宮的地支 = if 財帛宮化權入官祿宮斷文 	then ;
	: 財帛宮化權入田宅宮 ( --- ) 財帛宮的天干 化權 田宅宮的地支 = if 財帛宮化權入田宅宮斷文 	then ;
	: 財帛宮化權入福德宮 ( --- ) 財帛宮的天干 化權 福德宮的地支 = if 財帛宮化權入福德宮斷文 	then ;
	: 財帛宮化權入父母宮 ( --- ) 財帛宮的天干 化權 父母宮的地支 = if 財帛宮化權入父母宮斷文 	then ;

	: 財帛宮自化科	   ( --- ) 財帛宮的天干 化科 財帛宮的地支	= if 財帛宮自化科斷文			then ;
	: 財帛宮化科入兄弟宮 ( --- ) 財帛宮的天干 化科 兄弟宮的地支	= if 財帛宮化科入兄弟宮斷文 	then ;
	: 財帛宮化科入夫妻宮 ( --- ) 財帛宮的天干 化科 財帛宮的地支	= if 財帛宮化科入夫妻宮斷文 	then ;
	: 財帛宮化科入子女宮 ( --- ) 財帛宮的天干 化科 子女宮的地支 = if 財帛宮化科入子女宮斷文 	then ;
	: 財帛宮化科入命宮 ( --- ) 財帛宮的天干 化科 命宮的地支 = if 財帛宮化科入命宮斷文	then ;
	: 財帛宮化科入疾厄宮 ( --- ) 財帛宮的天干 化科 疾厄宮的地支 = if 財帛宮化科入疾厄宮斷文	then ;
	: 財帛宮化科入遷移宮 ( --- ) 財帛宮的天干 化科 遷移宮的地支 = if 財帛宮化科入遷移宮斷文	then ;
	: 財帛宮化科入僕役宮 ( --- ) 財帛宮的天干 化科 僕役宮的地支 = if 財帛宮化科入僕役宮斷文 	then ;
	: 財帛宮化科入官祿宮 ( --- ) 財帛宮的天干 化科 官祿宮的地支 = if 財帛宮化科入官祿宮斷文 	then ;
	: 財帛宮化科入田宅宮 ( --- ) 財帛宮的天干 化科 田宅宮的地支 = if 財帛宮化科入田宅宮斷文 	then ;
	: 財帛宮化科入福德宮 ( --- ) 財帛宮的天干 化科 福德宮的地支 = if 財帛宮化科入福德宮斷文 	then ;
	: 財帛宮化科入父母宮 ( --- ) 財帛宮的天干 化科 父母宮的地支 = if 財帛宮化科入父母宮斷文 	then ;

	: 財帛宮自化忌	   ( --- ) 財帛宮的天干 化忌 財帛宮的地支	= if 財帛宮自化忌斷文			then ;
	: 財帛宮化忌入兄弟宮 ( --- ) 財帛宮的天干 化忌 兄弟宮的地支	= if 財帛宮化忌入兄弟宮斷文 	then ;
	: 財帛宮化忌入夫妻宮 ( --- ) 財帛宮的天干 化忌 財帛宮的地支	= if 財帛宮化忌入夫妻宮斷文 	then ;
	: 財帛宮化忌入子女宮 ( --- ) 財帛宮的天干 化忌 子女宮的地支 = if 財帛宮化忌入子女宮斷文 	then ;
	: 財帛宮化忌入命宮 ( --- ) 財帛宮的天干 化忌 財帛宮的地支 = if 財帛宮化忌入命宮斷文	then ;
	: 財帛宮化忌入疾厄宮 ( --- ) 財帛宮的天干 化忌 疾厄宮的地支 = if 財帛宮化忌入疾厄宮斷文	then ;
	: 財帛宮化忌入遷移宮 ( --- ) 財帛宮的天干 化忌 遷移宮的地支 = if 財帛宮化忌入遷移宮斷文	then ;
	: 財帛宮化忌入僕役宮 ( --- ) 財帛宮的天干 化忌 僕役宮的地支 = if 財帛宮化忌入僕役宮斷文 	then ;
	: 財帛宮化忌入官祿宮 ( --- ) 財帛宮的天干 化忌 官祿宮的地支 = if 財帛宮化忌入官祿宮斷文 	then ;
	: 財帛宮化忌入田宅宮 ( --- ) 財帛宮的天干 化忌 田宅宮的地支 = if 財帛宮化忌入田宅宮斷文 	then ;
	: 財帛宮化忌入福德宮 ( --- ) 財帛宮的天干 化忌 福德宮的地支 = if 財帛宮化忌入福德宮斷文 	then ;
	: 財帛宮化忌入父母宮 ( --- ) 財帛宮的天干 化忌 父母宮的地支 = if 財帛宮化忌入父母宮斷文 	then ;
		 
	: 財帛宮四化 ( --- )
		財帛宮化祿入疾厄宮
		財帛宮化祿入兄弟宮
		財帛宮化祿入夫妻宮
		財帛宮化祿入子女宮
		財帛宮化祿入命宮
		財帛宮自化祿
		財帛宮化祿入遷移宮
		財帛宮化祿入僕役宮
		財帛宮化祿入官祿宮
		財帛宮化祿入田宅宮
		財帛宮化祿入福德宮
		財帛宮化祿入父母宮
		
		財帛宮化權入疾厄宮
		財帛宮化權入兄弟宮
		財帛宮化權入夫妻宮
		財帛宮化權入子女宮
		財帛宮化權入命宮
		財帛宮自化權
		財帛宮化權入遷移宮
		財帛宮化權入僕役宮
		財帛宮化權入官祿宮
		財帛宮化權入田宅宮
		財帛宮化權入福德宮
		財帛宮化權入父母宮
		
		財帛宮化科入疾厄宮
		財帛宮化科入兄弟宮
		財帛宮化科入夫妻宮
		財帛宮化科入子女宮
		財帛宮化科入命宮
		財帛宮自化科
		財帛宮化科入遷移宮
		財帛宮化科入僕役宮
		財帛宮化科入官祿宮
		財帛宮化科入田宅宮
		財帛宮化科入福德宮
		財帛宮化科入父母宮
		
		財帛宮化忌入疾厄宮
		財帛宮化忌入兄弟宮
		財帛宮化忌入夫妻宮
		財帛宮化忌入子女宮
		財帛宮化忌入命宮
		財帛宮自化忌
		財帛宮化忌入遷移宮
		財帛宮化忌入僕役宮
		財帛宮化忌入官祿宮
		財帛宮化忌入田宅宮
		財帛宮化忌入福德宮
		財帛宮化忌入父母宮
		;