
		cd 身命十二親宮
		fload 安身命主十二宮.f
		fload 命宮五行局.f
		fload 陰陽男女.f
		fload 安身命十二宮天干.f
		cd ..\紫微諸星
		fload 安紫微諸星.f
		cd ..\天府諸星
		fload 安天府諸星.f
		cd ..\年干諸星
		fload 安年干諸星.f
		cd ..\年支諸星
		fload 安年支諸星.f
		cd ..\年干支諸星
		fload 安年干支諸星.f
		cd ..\月系諸星
		fload 安月系諸星.f
		cd ..\日系諸星
		fload 安日系諸星.f
		cd ..\時系諸星
		fload 安時系諸星.f
		cd ..\五行十二長生諸星
		fload 安五行十二長生諸星.f
		cd ..
		
	: 排本命盤 ( --- )
		安身命主十二宮
		安本命十二宮天干
		安陰陽男女
		安命宮五行局
		安紫微諸星
		安天府諸星
		安年干諸星
		安年支諸星
		安年干支諸星
		安月系諸星
		安時系諸星
		安日系諸星
		安五行十二長生諸星
		本命十二宮四化
		;