\ 本命命宮四化
\ 命宮四化飛星--化祿 

	: 命宮自化祿斷文 ( --- )
		s" 表現樂觀，柔星化祿難免過柔或過度樂觀;剛星化祿則可剛柔並濟。" 斷文 
		;
			 
	: 命宮化祿入兄弟宮斷文 ( --- )
		s" 付出型的人，但有才付出，化祿是情誼。" 斷文 
		; 

	: 命宮化祿入夫妻宮斷文 ( --- )
		s" 婚姻緣早，異性朋友較多。" 斷文
	  s" 我對配偶好。" 斷文
	    ;

	: 命宮化祿入子女宮斷文 ( --- )
		s" 有子女、疼子女，可得貴子。" 斷文 
		;

	: 命宮化祿入財帛宮斷文 ( --- )
		s" 賺錢容易，靠自己努力賺錢，且易有偏財運。" 斷文
    s" 對賺錢用錢的心態是輕鬆的。" 斷文  
		;

	: 命宮化祿入疾厄宮斷文 ( --- )
		s" 為人較樂觀，易有惰性。" 斷文 
		s" 善於安撫自己的身心。" 斷文
		;

	: 命宮化祿入遷移宮斷文 ( --- )
		s"  在外人緣佳、貴人多、賺錢機會多，在外得意。" 斷文
		s"  外出較樂觀。" 斷文
		;

	: 命宮化祿入僕役宮斷文 ( --- )
		s" 在外朋友多、交際應酬亦多，朋友幫助大。" 斷文
		s" 付出型的人，但有才付出，化祿是情誼。" 斷文 
		;

	: 命宮化祿入官祿宮斷文 ( --- )
		s" 工作輕鬆薪水高，創業較能賺錢。" 斷文
		s" 關心事業及工作，對配偶也好。" 斷文
		;

	: 命宮化祿入田宅宮斷文 ( --- )
		 s" 家庭環境佳，布置豪華，且有祖業。" 斷文
		 s" 關心家務事。" 斷文 		 
		 ;
		 
	: 命宮化祿入福德宮斷文 ( --- )
		s" 多享受，老運好，福澤佳。" 斷文
		s" 喜歡心靈層次的學問。" 斷文
		;

	: 命宮化祿入父母宮斷文 ( --- )
		s" 有長輩緣，賞賜、提拔。" 斷文
	  s" 關心父母，並善於j文書，善於處理情緒。" 斷文 
		;
	


\ 命宮四化飛星--化權 

	: 命宮自化權斷文 ( --- )
		  s" 個性強、喜掌權、聰明能幹。" 斷文 
		 ; 

	: 命宮化權入兄弟宮斷文 ( --- )
		  s" 有兄弟，互為爭權，意見較多。" 斷文 
		 ; 

	: 命宮化權入夫妻宮斷文 ( --- )
		  s" 互為爭權，意見較多。" 斷文 
		 ; 

	: 命宮化權入子女宮斷文 ( --- )
		  s" 子女多、個性較強，管子女較嚴。" 斷文 
		 ; 

	: 命宮化權入財帛宮斷文 ( --- )
		  s" 掌財，主創業，適合做生意。" 斷文 
		 ; 

	: 命宮化權入疾厄宮斷文 ( --- )
		  s" 少年多災，調皮，桃花多，性慾強。" 斷文 
		 ; 

	: 命宮化權入遷移宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 命宮化權入僕役宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 命宮化權入官祿宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 命宮化權入田宅宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 命宮化權入福德宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 命宮化權入父母宮斷文 ( --- )
		  s" " 斷文 
		 ; 

\ 命宮四化飛星--化科 

	: 命宮自化科斷文 ( --- )
		  s" 人緣佳，在外有貴人。" 斷文 
		 ; 

	: 命宮化科入兄弟宮斷文 ( --- )
		  s" 在外有兄弟幫助。" 斷文 
		 ; 

	: 命宮化科入夫妻宮斷文 ( --- )
		  s"  在外事業平順，使配偶無後顧之憂。" 斷文 
		 ;

	: 命宮化科入子女宮斷文 ( --- )
		  s"  主變動、驛馬動的跡象，但順利。" 斷文 
		 ; 

	: 命宮化科入財帛宮斷文 ( --- )
		  s"  在外財運平順。" 斷文 
		 ; 

	: 命宮化科入疾厄宮斷文 ( --- )
		  s" 人緣佳、有貴人。" 斷文 
		 ; 

	: 命宮化科入遷移宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 命宮化科入僕役宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 命宮化科入官祿宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 命宮化科入田宅宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 命宮化科入福德宮斷文 ( --- )
		  s"  " 斷文 
		 ; 

	: 命宮化科入父母宮斷文 ( --- )
		  s" " 斷文 
		 ; 

\ 命宮因化飛星--化忌 

	: 命宮自化忌斷文 ( --- )
		  s" 為人慷慨,在外有是非。" 斷文 
		 ;

	: 命宮化忌入兄弟宮斷文 ( --- )
		  s" 本人為老么,朋友交不深。" 斷文 
		 ; 

	: 命宮化忌入夫妻宮斷文 ( --- )
		  s" 對配偶不放心,常感配偶愛我太少。" 斷文 
		 ; 

	: 命宮化忌入子女宮斷文 ( --- )
		  s" 管束子女,子女少,易損財,易有桃花,不喜在家,喜外出。" 斷文 
		 ; 

	: 命宮化忌入財帛宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 命宮化忌入疾厄宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 命宮化忌入遷移宮斷文 ( --- )
		  s" 在外不順，變化性大，多做少成。" 斷文 
		 ; 

	: 命宮化忌入僕役宮斷文 ( --- )
		  s"  朋友相處不佳，無法幫助。" 斷文 
		 ; 

	: 命宮化忌入官祿宮斷文 ( --- )
		  s" 為事業操心忙碌，工作時間多，所得少。" 斷文 
		 ; 

	: 命宮化忌入田宅宮斷文 ( --- )
		 s" 守財奴、祖業不豐，家內凌亂。" 斷文
		 s" 喜在家,為室內工作者." 斷文 	  
		 ; 

	: 命宮化忌入福德宮斷文 ( --- )
			s" 福德差、享受少、勞碌" 斷文
		 	s" 想錢沒錢,配偶必較累,勞形傷神." 斷文
		 ; 

	: 命宮化忌入父母宮斷文 ( --- )
			s" 父母緣薄、身體多災、欠佳。" 斷文
		 	s" 易出口傷人,或講話過份強調,力求驚心動魄所致." 斷文
		 	s" 主劫數" 斷文  
		 ;


	: 命宮自化祿	   ( --- ) 命宮的天干 化祿 命宮的地支	= if 命宮自化祿斷文			then ;
	: 命宮化祿入兄弟宮 ( --- ) 命宮的天干 化祿 兄弟宮的地支	= if 命宮化祿入兄弟宮斷文 	then ;
	: 命宮化祿入夫妻宮 ( --- ) 命宮的天干 化祿 命宮的地支	= if 命宮化祿入夫妻宮斷文 	then ;
	: 命宮化祿入子女宮 ( --- ) 命宮的天干 化祿 子女宮的地支 = if 命宮化祿入子女宮斷文 	then ;
	: 命宮化祿入財帛宮 ( --- ) 命宮的天干 化祿 財帛宮的地支 = if 命宮化祿入財帛宮斷文	then ;
	: 命宮化祿入疾厄宮 ( --- ) 命宮的天干 化祿 疾厄宮的地支 = if 命宮化祿入疾厄宮斷文	then ;
	: 命宮化祿入遷移宮 ( --- ) 命宮的天干 化祿 遷移宮的地支 = if 命宮化祿入遷移宮斷文	then ;
	: 命宮化祿入僕役宮 ( --- ) 命宮的天干 化祿 僕役宮的地支 = if 命宮化祿入僕役宮斷文 	then ;
	: 命宮化祿入官祿宮 ( --- ) 命宮的天干 化祿 官祿宮的地支 = if 命宮化祿入官祿宮斷文 	then ;
	: 命宮化祿入田宅宮 ( --- ) 命宮的天干 化祿 田宅宮的地支 = if 命宮化祿入田宅宮斷文 	then ;
	: 命宮化祿入福德宮 ( --- ) 命宮的天干 化祿 福德宮的地支 = if 命宮化祿入福德宮斷文 	then ;
	: 命宮化祿入父母宮 ( --- ) 命宮的天干 化祿 父母宮的地支 = if 命宮化祿入父母宮斷文 	then ;

	: 命宮自化權	   ( --- ) 命宮的天干 化權 命宮的地支	= if 命宮自化權斷文			then ;
	: 命宮化權入兄弟宮 ( --- ) 命宮的天干 化權 兄弟宮的地支	= if 命宮化權入兄弟宮斷文 	then ;
	: 命宮化權入夫妻宮 ( --- ) 命宮的天干 化權 命宮的地支	= if 命宮化權入夫妻宮斷文 	then ;
	: 命宮化權入子女宮 ( --- ) 命宮的天干 化權 子女宮的地支 = if 命宮化權入子女宮斷文 	then ;
	: 命宮化權入財帛宮 ( --- ) 命宮的天干 化權 財帛宮的地支 = if 命宮化權入財帛宮斷文	then ;
	: 命宮化權入疾厄宮 ( --- ) 命宮的天干 化權 疾厄宮的地支 = if 命宮化權入疾厄宮斷文	then ;
	: 命宮化權入遷移宮 ( --- ) 命宮的天干 化權 遷移宮的地支 = if 命宮化權入遷移宮斷文	then ;
	: 命宮化權入僕役宮 ( --- ) 命宮的天干 化權 僕役宮的地支 = if 命宮化權入僕役宮斷文 	then ;
	: 命宮化權入官祿宮 ( --- ) 命宮的天干 化權 官祿宮的地支 = if 命宮化權入官祿宮斷文 	then ;
	: 命宮化權入田宅宮 ( --- ) 命宮的天干 化權 田宅宮的地支 = if 命宮化權入田宅宮斷文 	then ;
	: 命宮化權入福德宮 ( --- ) 命宮的天干 化權 福德宮的地支 = if 命宮化權入福德宮斷文 	then ;
	: 命宮化權入父母宮 ( --- ) 命宮的天干 化權 父母宮的地支 = if 命宮化權入父母宮斷文 	then ;

	: 命宮自化科	   ( --- ) 命宮的天干 化科 命宮的地支	= if 命宮自化科斷文			then ;
	: 命宮化科入兄弟宮 ( --- ) 命宮的天干 化科 兄弟宮的地支	= if 命宮化科入兄弟宮斷文 	then ;
	: 命宮化科入夫妻宮 ( --- ) 命宮的天干 化科 命宮的地支	= if 命宮化科入夫妻宮斷文 	then ;
	: 命宮化科入子女宮 ( --- ) 命宮的天干 化科 子女宮的地支 = if 命宮化科入子女宮斷文 	then ;
	: 命宮化科入財帛宮 ( --- ) 命宮的天干 化科 財帛宮的地支 = if 命宮化科入財帛宮斷文	then ;
	: 命宮化科入疾厄宮 ( --- ) 命宮的天干 化科 疾厄宮的地支 = if 命宮化科入疾厄宮斷文	then ;
	: 命宮化科入遷移宮 ( --- ) 命宮的天干 化科 遷移宮的地支 = if 命宮化科入遷移宮斷文	then ;
	: 命宮化科入僕役宮 ( --- ) 命宮的天干 化科 僕役宮的地支 = if 命宮化科入僕役宮斷文 	then ;
	: 命宮化科入官祿宮 ( --- ) 命宮的天干 化科 官祿宮的地支 = if 命宮化科入官祿宮斷文 	then ;
	: 命宮化科入田宅宮 ( --- ) 命宮的天干 化科 田宅宮的地支 = if 命宮化科入田宅宮斷文 	then ;
	: 命宮化科入福德宮 ( --- ) 命宮的天干 化科 福德宮的地支 = if 命宮化科入福德宮斷文 	then ;
	: 命宮化科入父母宮 ( --- ) 命宮的天干 化科 父母宮的地支 = if 命宮化科入父母宮斷文 	then ;

	: 命宮自化忌	   ( --- ) 命宮的天干 化忌 命宮的地支	= if 命宮自化忌斷文			then ;
	: 命宮化忌入兄弟宮 ( --- ) 命宮的天干 化忌 兄弟宮的地支	= if 命宮化忌入兄弟宮斷文 	then ;
	: 命宮化忌入夫妻宮 ( --- ) 命宮的天干 化忌 命宮的地支	= if 命宮化忌入夫妻宮斷文 	then ;
	: 命宮化忌入子女宮 ( --- ) 命宮的天干 化忌 子女宮的地支 = if 命宮化忌入子女宮斷文 	then ;
	: 命宮化忌入財帛宮 ( --- ) 命宮的天干 化忌 財帛宮的地支 = if 命宮化忌入財帛宮斷文	then ;
	: 命宮化忌入疾厄宮 ( --- ) 命宮的天干 化忌 疾厄宮的地支 = if 命宮化忌入疾厄宮斷文	then ;
	: 命宮化忌入遷移宮 ( --- ) 命宮的天干 化忌 遷移宮的地支 = if 命宮化忌入遷移宮斷文	then ;
	: 命宮化忌入僕役宮 ( --- ) 命宮的天干 化忌 僕役宮的地支 = if 命宮化忌入僕役宮斷文 	then ;
	: 命宮化忌入官祿宮 ( --- ) 命宮的天干 化忌 官祿宮的地支 = if 命宮化忌入官祿宮斷文 	then ;
	: 命宮化忌入田宅宮 ( --- ) 命宮的天干 化忌 田宅宮的地支 = if 命宮化忌入田宅宮斷文 	then ;
	: 命宮化忌入福德宮 ( --- ) 命宮的天干 化忌 福德宮的地支 = if 命宮化忌入福德宮斷文 	then ;
	: 命宮化忌入父母宮 ( --- ) 命宮的天干 化忌 父母宮的地支 = if 命宮化忌入父母宮斷文 	then ;



	: 命宮四化 ( --- )
		命宮化祿入疾厄宮
		命宮化祿入兄弟宮
		命宮化祿入夫妻宮
		命宮化祿入子女宮
		命宮化祿入財帛宮
		命宮自化祿
		命宮化祿入遷移宮
		命宮化祿入僕役宮
		命宮化祿入官祿宮
		命宮化祿入田宅宮
		命宮化祿入福德宮
		命宮化祿入父母宮
		
		命宮化權入疾厄宮
		命宮化權入兄弟宮
		命宮化權入夫妻宮
		命宮化權入子女宮
		命宮化權入財帛宮
		命宮自化權
		命宮化權入遷移宮
		命宮化權入僕役宮
		命宮化權入官祿宮
		命宮化權入田宅宮
		命宮化權入福德宮
		命宮化權入父母宮
		
		命宮化科入疾厄宮
		命宮化科入兄弟宮
		命宮化科入夫妻宮
		命宮化科入子女宮
		命宮化科入財帛宮
		命宮自化科
		命宮化科入遷移宮
		命宮化科入僕役宮
		命宮化科入官祿宮
		命宮化科入田宅宮
		命宮化科入福德宮
		命宮化科入父母宮
		
		命宮化忌入疾厄宮
		命宮化忌入兄弟宮
		命宮化忌入夫妻宮
		命宮化忌入子女宮
		命宮化忌入財帛宮
		命宮自化忌
		命宮化忌入遷移宮
		命宮化忌入僕役宮
		命宮化忌入官祿宮
		命宮化忌入田宅宮
		命宮化忌入福德宮
		命宮化忌入父母宮
		;	 
