	: 星情 create
			0 , \ 所在的地支
			0 , \ 藏干
			0 , \ 廟陷
			;



\ 星情 紫微
\ 星情 天機
\ 星情 太陽
\ 星情 武曲
\ 星情 天同
\ 星情 廉貞

星情 天府
\ 星情 太陰
\ 星情 貪狼
\ 星情 巨門
星情 天相
\ 星情 天梁
\ 星情 七殺
\ 星情 破軍


星情 伏兵
星情 力士
星情 博士
星情 喜神
星情 大耗
星情 天官
星情 天福
星情 天鉞
星情 天魁
星情 奏書
星情 官府
星情 將軍
星情 小耗
星情 截空
\ 星情 擎羊
星情 病符
\ 星情 祿存
\ 星情 陀羅
星情 青龍
星情 飛廉

星情 天哭
星情 天喜
星情 天壽
星情 天才
星情 天虛
星情 孤辰
星情 寡宿
星情 破碎
星情 紅鸞
星情 蜚廉
星情 鳳閣
星情 龍池

星情 旬空

\ 星情 右弼
星情 天刑
星情 天姚
星情 天巫
星情 天月
星情 天馬
\ 星情 左輔
星情 解神
星情 陰煞

星情 三台
星情 八座
星情 天貴
星情 恩光


\ 星情 文曲
\ 星情 文昌
\ 星情 火星
\ 星情 鈴星
星情 台輔
星情 地劫
星情 天空
星情 封誥
	
星情 冠帶
星情 墓
星情 帝旺
星情 死
星情 沐浴
星情 病
星情 絕
星情 胎
星情 臨官
星情 衰
星情 長生
星情 養


星情 流陀
星情 流羊
	
星情 亡神
星情 劫煞
星情 咸池
星情 喪門
星情 天德
星情 天煞
星情 官符
星情 將星
星情 弔客
星情 息神
星情 指背
星情 攀鞍
星情 晦氣
星情 月煞
星情 歲建
星情 歲驛
星情 流大耗
星情 流小耗
星情 流病符
星情 災煞
星情 白虎
星情 華蓋
星情 貫索
星情 龍德

	星情 命宮
	星情 兄弟宮
	星情 夫妻宮
	星情 子女宮
	星情 財帛宮
	星情 疾厄宮
	星情 遷移宮
	星情 僕役宮
	星情 官祿宮
	星情 田宅宮
	星情 福德宮
	星情 父母宮
	
	星情 大限命宮
	星情 大限兄弟宮
	星情 大限夫妻宮
	星情 大限子女宮
	星情 大限財帛宮
	星情 大限疾厄宮
	星情 大限遷移宮
	星情 大限僕役宮
	星情 大限官祿宮
	星情 大限田宅宮
	星情 大限福德宮
	星情 大限父母宮
	星情 大限身宮

	星情 小限命宮
	星情 小限兄弟宮
	星情 小限夫妻宮
	星情 小限子女宮
	星情 小限財帛宮
	星情 小限疾厄宮
	星情 小限遷移宮
	星情 小限僕役宮
	星情 小限官祿宮
	星情 小限田宅宮
	星情 小限福德宮
	星情 小限父母宮
	星情 小限身宮



	星情 流年命宮
	星情 流年兄弟宮
	星情 流年夫妻宮
	星情 流年子女宮
	星情 流年財帛宮
	星情 流年疾厄宮
	星情 流年遷移宮
	星情 流年僕役宮
	星情 流年官祿宮
	星情 流年田宅宮
	星情 流年福德宮
	星情 流年父母宮
	星情 流年身宮
	
	星情 流月命宮
	星情 流月兄弟宮
	星情 流月夫妻宮
	星情 流月子女宮
	星情 流月財帛宮
	星情 流月疾厄宮
	星情 流月遷移宮
	星情 流月僕役宮
	星情 流月官祿宮
	星情 流月田宅宮
	星情 流月福德宮
	星情 流月父母宮
	星情 流月身宮
	
	星情 流日命宮
	星情 流日兄弟宮
	星情 流日夫妻宮
	星情 流日子女宮
	星情 流日財帛宮
	星情 流日疾厄宮
	星情 流日遷移宮
	星情 流日僕役宮
	星情 流日官祿宮
	星情 流日田宅宮
	星情 流日福德宮
	星情 流日父母宮
	星情 流日身宮
	
	星情 流時命宮
	星情 流時兄弟宮
	星情 流時夫妻宮
	星情 流時子女宮
	星情 流時財帛宮
	星情 流時疾厄宮
	星情 流時遷移宮
	星情 流時僕役宮
	星情 流時官祿宮
	星情 流時田宅宮
	星情 流時福德宮
	星情 流時父母宮
	星情 流時身宮			