: 天同天梁入命宮 ( -- ) 
 s" 天同天梁入命宮" 斷文
 s" 這是天同的組合中，最能逢凶化吉的一個格局，所謂「福蔭相聚不怕兇」，因同、梁2星都是男鬥的延壽之星，天同為「福星」，天量為「蔭星」，相較其他星，此2星一生發生意外、災難的機率比別人要低許多。" 斷文
 s" 同、梁不怕羊、陀、火、鈴、忌，逢到這些老鼠屎，頂多讓同、梁人享不得福、操勞些而已，但它的福蔭還是在的。" 斷文
 s"  天同天梁唯有截空或地空或地劫，會空掉其福份、庇蔭。" 斷文
 s" 當遇到大限、流年有凶險之事，依然能發揮『福蔭』的妙用，而化險為夷、遇難呈祥。" 斷文
 s" 但福蔭之星最怕地空、地劫、截空，這3空、不僅空掉了福份，也劫奪了「庇蔭」，一生運勢如飄萍般的隨波逐流。" 斷文
 s" 同、梁人的智慧超高，算是生來享福的（沒有老鼠屎），男性是一個參謀之才，心思慎密，老實有餘，女性是能幹旺夫，唯在婚姻上是冷淡的，有些同、梁女的情路，走的跌跌撞撞，更甚者嫁做偏房，或成為別人的外遇對象。" 斷文
 s" 此組合的缺點是同、梁人安於現狀，開創不足，全憑一張嘴，男性此種格局大都以守成為要，因其動作溫吞、欠缺積極的行事態度，若再會到煞星，反成為老謀深算的老奸人，喜歡玩心機，搞謀略。" 斷文
 s" 總之，同、梁人，為高壽的組合，若命宮三方四正有祿存，科、天魁、或天鉞、權、祿等交會，這才是「富貴揚名、壽高福全」的真正好命人。" 斷文
 s" 男生：聰敏睿智，思路敏捷，為人老成，但性格溫和、謙遜知禮。喜歡益智的遊戲，口才好，會耍嘴皮，幽默機伶，但說的都是「屁話」，倘一旦要用在正途上，反不善言語，有點口給，有些同、梁男很臘遢的，不重穿著、不愛打扮。" 斷文
 s" 女生：聰敏伶俐，活潑外向，會妝扮容貌，重視外觀穿著，童心未泯，好奇心重，身材渾圓、屬豐滿的體型，渾身散發成熟的風韻。愛吃零食，沒事喜歡閒磕牙、聊八卦。" 斷文
 s" 若同、梁女撇開感情事不談，還真的挺有福份的.。" 斷文
 ;
 
: 天同天梁入兄弟宮 ( -- ) s" 天同天梁入兄弟宮：手足間感情好、緣份足，彼此互通有無，亦能共創事業。若無煞星沖破，為「兄弟同心、其力斷金」。" 斷文 ;

: 天同天梁入夫妻宮 ( -- ) 
 s" 天同天梁入夫妻宮：男性娶年齡相近之妻，又有幫夫運。" 斷文 
 s" 但女性就糟了！或嫁老夫、或為偏房、或嫁再婚之男，總之、婚緣不美滿，亦難享夫福，若有老鼠屎入，婚姻不保，再婚的機率相當高，晚婚較好。" 斷文 
 ;
 
: 天同天梁入子女宮 ( -- ) s" 天同天梁入子女宮：子女聰敏伶俐、依賴心重，相處和睦、優秀成材，思想成熟，像個小大人。" 斷文 ;
: 天同天梁入財帛宮 ( -- ) s" 天同天梁入財帛宮：是穩定的上班族收入，只要不賭、不投機，一生錢財很平順，賺的是輕鬆財。" 斷文 ;
: 天同天梁入疾厄宮 ( -- ) s" 天同天梁入疾厄宮：腸胃不好、飲食口味較重，炒飯能力很強，需防「敗腎」，中年防糖尿病、膀胱易發炎，為易胖體，同時易得憂鬱症。" 斷文 ;
: 天同天梁入遷移宮 ( -- ) s" 天同天梁入遷移宮：親和力強、人緣好，老少咸宜，男性較老實，女性較風騷。" 斷文 ;
: 天同天梁入僕役宮 ( -- ) s" 天同天梁入僕役宮：朋友穩定、屬下得力、且有年長貴人助。若煞星在內，朋友、部屬皆不得力。" 斷文 ;
: 天同天梁入官祿宮 ( -- ) s" 天同天梁入官祿宮：是公職或大型企業的上班族。或一般穩定的上班族、或專業性、美容、藝術業。" 斷文 ;
: 天同天梁入田宅宮 ( -- ) s" 天同天梁入田宅宮：無論自置或祖產皆有機會，除非會到地空、截空、地劫。" 斷文 ;
: 天同天梁入福德宮 ( -- ) s" 天同天梁入福德宮：懶散、被動，不喜歡愛運動，固執、不夠圓融、不重外表。" 斷文 ;
: 天同天梁入父母宮 ( -- ) s" 天同天梁入父母宮：對父母孝順，緣份濃，能晨昏相處、若無老鼠屎父母高壽。" 斷文 ;
