:: 天同太陰入命宮 ( -- ) 
  s" 天同太陰入命宮" 斷文
  s" 這是天同的組合中，最悠閒、最安逸.的一個格局，若男性此種格局可就不妙了，除了欠缺積極的行事態度外，其感情世界也是多彩多姿的。" 斷文
  s" 女性也好不到哪兒去，一生為情所困是免不了的。" 斷文
  s" 同、陰人分子位與午位，坐落的位置會影響一生的格局，其中以在子位最為優勢，若再會到6吉星，形成「水澄桂萼格」，這是忠諫的文官，前途看好。" 斷文
  s" 午位的同、陰人因星居陷地，除了一生操勞，只怕也一事無成。想在事業上有所成就，那得比常人更加付出。" 斷文
  s" 同、陰人的格局較弱，對煞星毫無抗力，尤其對感情更是雪上加霜，因同、陰的五行皆屬水，水主桃花，無論男女，情慾都重，再者定力不夠，志氣不足，對感情看不開、放不下，因此影響事業心，是相當不智的！" 斷文
  s" 同、陰人與人為善，不俱攻擊性（除非會煞星太多），倘能把感情置於第2，則此生成就必不可限量的。" 斷文
  s" 天同坐命+文曲稱為煙消雲散格。是吉處藏兇之象，行事三分熱度、又會自我膨脹，碰到措折先行打退堂鼓，即使稍有成就，也是成一時、敗一世，此格局者不可不自我惕厲。" 斷文
  s" 天同+太陰唯有截空或地空或地劫，會空掉其福份" 斷文。
  s" 男生：異性緣好、桃花重，長的挺拔、穩重，很能討女人喜歡，生理早熟，戀愛早發，但婚姻卻來的晚，講起話來，輕聲細語，體貼入微，" 斷文
  s" 性情憂柔寡斷，尤其對感情當斷不斷的拖泥帶水，不會拒絕、不忍拒絕，因而易陷入感情的泥淖中，說好聽是「心太軟」，說明白點是「濫好人」。" 斷文
  s" 同、陰男人的優點是樂天派，他認為「山不轉、路轉。路不轉、人轉」，凡事總有峰迴路轉的一天，何必陷自己於絕境? 這是他處事的哲理，但對感情可完全不是那麼回事了！" 斷文
  s" 同、陰女生：聰敏伶俐，很會妝扮容貌，「ㄕㄞ、ㄋㄞ」是其最大的本錢，看起來同心未泯、不脫童稚之心，活潑、擅於裝可愛，溫柔體貼、善解人意，依賴心重，虛容心更重，愛享受、愛講八卦，對異性會放電，不懂拒絕，常有三角戀情纏身。" 斷文
  ;
 
: 天同太陰入兄弟宮 ( -- ) s" 天同太陰入兄弟宮：手足間感情濃鬱，若無煞星沖破，有個有求必應的好手足。" 斷文 ;
: 天同太陰入夫妻宮 ( -- ) s" 天同太陰入夫妻宮：男性可娶賢淑之妻，又有幫夫運。但女性就糟了！嫁夫無助、難享夫福，婚姻生活不平靜、又坎坷，若再有煞星進入婚姻不保，再婚的機率相當高，晚婚較好。" 斷文 ;
: 天同太陰入子女宮 ( -- ) s" 天同太陰入子女宮：子女聰敏伶俐、善解人意，文靜內向懶散，依賴心重，是來享福的。" 斷文 ;
: 天同太陰入財帛宮 ( -- ) s" 天同太陰入財帛宮：是穩定的上班族收入，只要不賭、不投機，一生錢財很平順。" 斷文 ;
: 天同太陰入疾厄宮 ( -- ) s" 天同太陰入疾厄宮：心臟機能不佳，心律不整，腸胃不好、胃下垂，視力不良，支氣管不好，飲食口味較重，需防著心肺係統的疾病，炒飯能力很強，中年防糖尿病、膀胱易發炎，小時易尿床。" 斷文 ;
: 天同太陰入遷移宮 ( -- ) s" 天同太陰入遷移宮：待人接物知禮，親和力強、人緣好，唯感情定力差。較安於現狀，一生無大的遷動" 斷文 ;。
: 天同太陰入僕役宮 ( -- ) s" 天同太陰入僕役宮：若煞星在內，朋友、部屬皆不得力，容易所遇非人。無煞沖，則交友順利。" 斷文 ;
: 天同太陰入官祿宮 ( -- ) s" 天同太陰入官祿宮：是公職或大型企業的上班族。亦或推銷、研發、服務業、餐飲業。" 斷文 ;
: 天同太陰入田宅宮 ( -- ) s" 天同太陰入田宅宮：同、陰入田宅宮，住宅光線暗，房屋老舊易漏水，若無煞星在內，即使無祖產可得，也能自置不動產。" 斷文 ;
: 天同太陰入福德宮 ( -- ) s" 天同太陰入福德宮：夜貓子，投機心強，懶散、被動，不喜歡劇中運動，重視生活品質與情趣。" 斷文 ;
: 天同太陰入父母宮 ( -- ) s" 天同太陰入父母宮：對父母孝而不順，雖能盡孝道，但僅僅吃穿而已。" 斷文 ;
