: 天同巨門入命宮 ( -- ) 
 s" 天同巨門入命宮" 斷文
 s" 這是天同的組合中，最..最不利感情的一個格局，同、巨人要修得感情的圓滿，真是不容易啊!" 斷文 
 s" 在多年的諮詢經驗中，同、巨人被列為~~感情殺手格的前3大.排名，無論男女皆同。" 斷文
 s" 請參考~婚姻 不是女人唯一的歸宿 。" 斷文
 s" 同、巨人的個性是很硬的，自負、自我主觀強，疑心病重又容易劃地自限，可他們的智慧卻不容忽視，口才好、批判力強，言辭犀利，卻能一針見血，往往讓人瞠目結舌，不知所以的該如何回應，" 斷文
 s" 對同、巨人而言，這是贏了面子輸了裡子的結果。" 斷文
 s" 同、巨女人是很顧家的，她是刀子嘴豆腐心，有點孤僻，不愛與人打交道，話不投機半句多的性情。" 斷文
 s" 男性則是缺乏衝刺利力、沒有開創性、傾向坐享其成的個性。" 斷文
 s" 難道情路難行、婚姻多挫真的是同、巨人的宿命嗎? 那倒也未必啦如果此組合能會到祿存，反而能成為一對胼手胝足的患難夫妻，婚姻還是被祝福的。" 斷文
 s" 但條件是夫妻宮不可有老鼠屎，否則婚照離、緣照破。" 斷文
 s" 總之，同、巨人，為波瀾與挫折的感情組合，有些女性因此走極端、怨天尤人，更甚者，為了強求一段不可得的感情，??往往賠了夫人又折兵，依然討不到歡心。" 斷文
 s" 能在情場中不受情傷又毅然而退的同. 巨人實在不多，最難的是她們是不甘心、不甘心才是讓自己受苦的主因。" 斷文
 s" 男生：思路敏捷，內向、細心，做事保守謹守，性格直爽，嘴快不饒人，自己以為口才好，但強詞奪理的成分高，多數同、巨男很難有大事業的。" 斷文
 s" 女生：看起來內相文靜，但實際思想很開放，多數同、巨女，佔有慾強、疑心病重又善妒。但她們的工作能力是不容忽視的，性格好強獨立、在群體中會成為一個意見領袖，對於藝術方面挺有興趣的。" 斷文
 s" 若同、巨女對感情能灑脫視之，不再讓自己陷於情困、情傷，以智慧而言，未來在事業上能有一片天的.。" 斷文
 ;
  
: 天同巨門入兄弟宮 ( -- ) s" 天同巨門入兄弟宮：手足間彼此有疏離感、緣份薄，意件難溝通，常有爭執，最好不要有金錢的瓜葛，更不宜共創事業。" 斷文 ;

: 天同巨門入夫妻宮 ( -- ) 
 s" 天同巨門入夫妻宮：無論男女婚姻欠圓滿！爭執、緣弱、聚少離多，還算輕微、若有老鼠屎入，婚姻不保，再婚的機率相當高，女性一婚、再婚、三婚也大有人在。" 斷文
 s" 除非夫妻宮三方四正會祿存，又沒煞星沖，則婚姻好合能長久。" 斷文
 ;
 
: 天同巨門入子女宮 ( -- ) s" 天同巨門入子女宮：子女依賴心重，親子關係不好、易爭執，且長大後各自為政，難以奉養，累的反而是父母。" 斷文 ;
: 天同巨門入財帛宮 ( -- ) s" 天同巨門入財帛宮：賺的都是勞心勞力之財，或帶有是非之財，或吃開口飯，再不投機財，錢財有耗損。" 斷文 ;
: 天同巨門入疾厄宮 ( -- ) s" 天同巨門入疾厄宮：腸胃不好、易長痔瘡，飲食口味較重，中年防發胖，及防糖尿病、膀胱易發炎，男性有攝護腺的隱憂。" 斷文 ;
: 天同巨門入遷移宮 ( -- ) s" 天同巨門入遷移宮：人緣好，但口舌是非多，所謂~人怕出名、豬怕肥，自己也是鐵尺不信邪。" 斷文 ;
: 天同巨門入僕役宮 ( -- ) s" 天同巨門入僕役宮：若煞星在內，朋友、部屬皆不得力、不宜合夥、不作保，擇友要謹慎，防小人、防背叛。" 斷文 ;
: 天同巨門入官祿宮 ( -- ) s" 天同巨門入官祿宮：宜公職或一般穩定的上班族、或金融保險、教育、藝術業。" 斷文 ;
: 天同巨門入田宅宮 ( -- ) s" 天同巨門入田宅宮：為白手起家之格，住宅要防生白蟻、漏水、除非會到地空、截空、地劫才有破產之慮。" 斷文 ;
: 天同巨門入福德宮 ( -- ) s" 天同巨門入福德宮：老來愈固執、愈孤單、口才雖好但不夠圓融、講話衝，常得罪人而不自知，老年生涯要做規劃。" 斷文 ;
: 天同巨門入父母宮 ( -- ) s" 天同巨門入父母宮：與父母相處有代溝，常頂嘴，多爭執、有些甚至少小就離開父母的庇護。" 斷文 ;