: 天機巨門入命宮 ( -- ) 
 S" 天機巨門入命宮 
 S" 聰敏有謀略才華內斂多疑善妒處事欠圓融個性倔強鐵齒嘴硬自負自我本位主義強親和力不足言語犀利常得罪人.除非會到'昌.曲才有化解." 斷文
 S" 此格局若是出生年次後一位數字是4和0(即民國44.54.64.74及50.60.70.80..等).這是屬於發明家. 研發高手." 斷文 
 S" 但要成為受人肯定的專業人士(就像李昌鈺博士以專業而揚名.)必須命宮三方會到文昌.文取.化科.天魁.天鉞.才能真正成格" 斷文
 S" 女性長的好看但屬冷豔之美若命宮再會到桃花星此生感情必然不流白機.巨之人此生想在感情上修得正果除非祿存相伴否則只怕是披荊斬棘了情路迢迢了" 斷文
 S" 男生: 個性保守不善言詞恃才傲物易流於剛愎自用曲高和寡常看別人不順眼雖聰敏穩重但人際關係實在要加強內心有懷才不遇之嘆" 斷文
 S" 女生: 虛榮心重言語保守不懂得讚美之詞脾氣古怪情緒起伏大很會ㄍ一ㄥ" 斷文
 ;

: 天機巨門入兄弟宮 ( -- ) S" 天機巨門入兄弟宮 兄弟不過三意見難溝通是非多手足少情各掃門前雪" 斷文 ;
: 天機巨門入夫妻宮 ( -- ) S" 天機巨門入夫妻宮 婚姻多挫折情路不堪常??愛上不該愛的人卻又勾勾纏更不利女性此生為情所傷再所難免" 斷文 ;
: 天機巨門入子女宮 ( -- ) S" 天機巨門入子女宮 子女頑皮好動雖聰敏.愛頂嘴有代溝長大各顧各的" 斷文 ;
: 天機巨門入財帛宮 ( -- ) S" 天機巨門入財帛宮 不宜賺投機財錢財難留欠理財概念更不宜賭" 斷文 ;
: 天機巨門入疾厄宮 ( -- ) S" 天機巨門入疾厄宮 呼吸系統口腔牙齒過敏心臟神經衰弱支氣管並須防結石" 斷文 ;
: 天機巨門入遷移宮 ( -- ) S" 天機巨門入遷移宮 人際欠佳環境適應力不好是非多口舌多易犯小人" 斷文 ;
: 天機巨門入僕役宮 ( -- ) S" 天機巨門入僕役宮 不宜合夥朋友無助還會受拖累宜慎加擇友易誤交損友部屬亦不牢靠" 斷文 ;
: 天機巨門入官祿宮 ( -- ) S" 天機巨門入官祿宮 貿易醫藥美工設計或服務業靠口吃飯若有魁.鉞同宮則宜公職也有做投機生意者" 斷文 ;
: 天機巨門入田宅宮 ( -- ) S" 天機巨門入田宅宮 在家喜歡擺威風住宅易生蛀蟲不宜木造過多" 斷文 ;
: 天機巨門入福德宮 ( -- ) S" 天機巨門入福德宮 好辯愛八卦投機心強疑心病重最愛打探小道消息" 斷文 ;
: 天機巨門入父母宮 ( -- ) S" 天機巨門入父母宮 親子關係不和有代溝難溝通父母緣薄常有口舌之爭" 斷文 ;
\ 以上是宮內無煞星的論法倘落入老鼠屎則會破壞宮內原有論述