: 天機天梁入命宮 ( -- )
 s" 天機天梁入命宮" 斷文
 s" 此格局若有昌.曲星及輔.弼交會在封建社會是個文官不愛財又清正廉明武官不怕死的忠良之士若有煞星來沖則為人城府太深自私自利以現代職業而論是個參謀長.秘書長的機要人員." 斷文
 s" 機.梁坐命者亦以孤來論個性孤僻長相老成天機不利兄弟天梁不利姐妹逢煞星則形成早刑晚孤會應驗在手足或婚姻上. 機.梁逢華蓋很有宗教之緣. 除非會到地空或截空較不孤僻." 斷文
 s" 能說善辯愛抬槓嘴巴不服輸智慧高精明幹練老謀深算組織力.企劃力.觀察力皆強. 愛鬥智愛講大道理會倚老賣老善談古論今是個打屁精但心地善良不擅拒絕人." 斷文
 s" 唯小心眼 愛計較 善妒 懶散邋遢" 斷文
 s" 男生: 怕老婆忠厚老實愛聊天愛強辯愛博奕(很多人愛賭) 投機心重反應敏捷天文地理無所不通處事會用策略" 斷文
 s" 女生: 精明能幹做事有分寸能孝順父母又顧家只要與人槓上常讓對方知難而退唯內心是孤寂的老時會將心靈寄託宗教" 斷文
 s" 以上是宮內無煞星的論法倘落入老鼠屎則會破壞宮內原有論述" 斷文
 ;
 
: 天機天梁入兄弟宮 ( -- ) s" 天機天梁入兄弟宮兄弟不過三若吉星交會手足感情淡薄平常無話說家加煞星需防兄弟爭訟是非多" 斷文;
: 天機天梁入夫妻宮 ( -- ) s" 天機天梁入夫妻宮晚婚居多且婚姻多波折貌合神離尤其不利女性女嫁老夫為宜男娶幼齒較佳" 斷文;
: 天機天梁入子女宮 ( -- ) s" 天機天梁入子女宮子息不旺頑皮好動但聰敏.善解人意" 斷文;
: 天機天梁入財帛宮 ( -- ) s" 天機天梁入財帛宮錢財難留理財要保守不宜賺投機財" 斷文;
: 天機天梁入疾厄宮 ( -- ) s" 天機天梁入疾厄宮肝.膽不佳(有羊.陀得防肝硬化) 心律不整心臟機能欠佳腸胃不好易拉肚膀胱炎男易腎虧女易性冷感" 斷文;
: 天機天梁入遷移宮 ( -- ) s" 天機天梁入遷移宮很有長輩緣愛往外跑人緣亦佳適合移民" 斷文;
: 天機天梁入僕役宮 ( -- ) s" 天機天梁入僕役宮若無煞星則朋友得力亦能或年長者之助" 斷文;
: 天機天梁入官祿宮 ( -- ) s" 天機天梁入官祿宮若有魁.鉞同宮則宜公職或服務業靠口吃飯企業界亦可" 斷文;
: 天機天梁入田宅宮 ( -- ) s" 天機天梁入田宅宮住家附近有醫院慈善團體樹木農作物若無煞星不動產能得長上之助" 斷文;
: 天機天梁入福德宮 ( -- ) s" 天機天梁入福德宮勞碌命凡事放不開投機心強老來精神孤單又寂寞(出生年次後數字是4者註意嗜賭如命)" 斷文;
: 天機天梁入父母宮 ( -- ) s" 天機天梁入父母宮能得父母庇蔭或受祖產父母高壽有宗教思想" 斷文;

