: 天機太陰入命宮 ( -- )
 s" 天機太陰入命宮????????此格局若有昌.曲星交會又無煞星來沖在封建社會可是個探花格以現代職業而論是經過國家特考的公務人員且身居官職的大主管是中年得意之運." 斷文 
 s" ~~聰敏機巧智慧高能說善辯思緒敏銳分析力觀察力佳小有才藝第六感強唯優柔寡斷內心穩定度不夠非常情緒化善變有時很ㄌㄨˊ愛幻想常孤芳自賞城府深易流於自斯愛計較" 斷文
 s" 男生: 機智幽默反應敏捷嘴上不服輸看起來很陽光桃花旺到暴很會做公關套交情" 斷文
 s" 女生: 體貼顧家常不知為何而煩思路細膩而神經質外表溫柔善解人意但纏功一流超會碎碎唸愛鑽牛角尖精明能幹也常因小失大" 斷文
 ;
: 天機太陰入兄弟宮 ( -- ) s" 天機太陰入兄弟宮 兄弟不過三若吉星交會手足感情尚佳兄弟間有人認義父母" 斷文;
: 天機太陰入夫妻宮 ( -- ) s" 天機太陰入夫妻宮 婚姻多波折 尤其不利女性" 斷文;
: 天機太陰入子女宮 ( -- ) s" 天機太陰入子女宮 子女聰敏好動善解人意體貼顧家" 斷文;
: 天機太陰入財帛宮 ( -- ) s" 天機太陰入財帛宮 屬於上班族的固定收入錢財難留不宜投機嗜賭否則財來財去的更快" 斷文;
: 天機太陰入疾厄宮 ( -- ) s" 天機太陰入疾厄宮 膽小四肢酸痛氣管不好痛風心臟機能欠佳易拉肚皮膚濕疹痔瘡" 斷文;
: 天機太陰入遷移宮 ( -- ) s" 天機太陰入遷移宮 在家待不住 愛往外跑" 斷文;
: 天機太陰入僕役宮 ( -- ) s" 天機太陰入僕役宮 朋友來去皆快不易交到知心朋友異性緣比同性緣好" 斷文;
: 天機太陰入官祿宮 ( -- ) s" 天機太陰入官祿宮 若有魁.鉞同宮則宜公職大都以行銷醫藥或技術之工作為主" 斷文;
: 天機太陰入田宅宮 ( -- ) s" 天機太陰入田宅宮 住家易搬遷或室內光線不佳或漏水屋" 斷文;
: 天機太陰入福德宮 ( -- ) s" 天機太陰入福德宮 容易操煩勞碌命憂患意識重責任感也重凡事放不開" 斷文;
: 天機太陰入父母宮 ( -- ) s" 天機太陰入父母宮 孝順 尊重長輩 母緣較好" 斷文;

\ 以上是宮內無煞星的論法倘落入老鼠屎則會破壞宮內原有論述