  太陽+太陰

????????日. 月喜歡借宮正坐命宮反而不利父.母親更不利婚姻男女同論此格局又稱~?格~.也就是像外表好看的金馬桶. 古時候借對宮坐命的日.月人若得文昌.文曲.化科.天魁.天鉞.相助可官封~~ 侯爵之位也就是現代的部長廳長之等級.

???????日. 月坐命之人受到陰陽衝激就算沒有老鼠屎來攪和性情多變陰晴不定善謊言因佔父母. 夫妻之星於一身. 必然與父母妻子老公無緣除非祿存相伴為害稍減.

?????借日. 月之人雖沒有刑剋父母之說但會應驗在自己的婚姻上總之感情是一生的痛

入命宮~~ 孝順顧家龜毛挑剔eq差情緒陰晴不定個性多變朝令夕改較為自私行事持續力不足三分鐘熱度. 好吹噓外表含蓄內斂內在性急毛燥.

男生: 個性看似保守實際外向好動投機心強較短視重短利有耐性卻無恆心本位主義強凡事以己利為重

女生: 愛管閒事愛插嘴外在溫柔內心倔強善變難測但家庭觀念重顧娘家

入兄弟宮~~ 手足之情忽冷忽熱時好時壞

入夫妻宮~~感情一明一暗易玩弄感情死灰復燃或腳踏兩條船是見怪不怪之事

入子女宮~~子女好動聰敏又有才華也代表"炒飯"花樣多"胃口"多變長大各顧各的

入財帛宮~~ 有2份收入的跡象工作時間不按朝九晚五的規律

入疾厄宮~~ 呼吸系統口腔牙齒過敏心臟神經衰弱支氣管並須防結石

入遷移宮~~宜遠離出生地發展喜歡往外跑在家待不住個性較活潑好動

入僕役宮~~若僕役宮在(未)男性的朋友或部屬幫助較大若僕役宮在(醜)女性的朋友或部屬幫助較大

入官祿宮~~工作時間不定或常會加班宜傳播界或技術業

入田宅宮~~若無煞星交會則房地產富足

入福德~~ 情緒化心情反覆無常逢挫折還會歇斯底里

入父母宮~~親子關係好雙親善良對父母尊重受父母影大

以上是宮內無煞星的論法倘落入老鼠屎則會破壞宮內原有論述