太陽+巨門 (又稱巨.日同臨格)
??????巨.日在寅或申的位置格局有落差的在寅宮才是成格因太陽的光掃除了巨門的暗把巨門的缺點改善許多因此又稱~~明日驅暗格但巨.日在申差別可大了黃昏的太陽沒啥威力因此反受制於巨門.
???????巨.日在寅者性格耿直對人忠誠度高大嗓門直腸子行事積極巨.日在申者行事3分鐘熱度凡事不堅持死了的鴨子嘴硬說話不得體得罪人是家常便飯.
入命宮~~ 男生: 塊頭大肚量大忠厚老實為人誠懇能吃苦保守內向話不多
??????????女生: 性情倔強待人熱忱重視打扮感情的佔有慾強敢愛敢恨情路難行在申位的女生反而有點男性化動作大剌剌不甘寂寞愛熱鬧疑心重但孝順顧家
????????巨.日的女生在感情的經營上亦是一波多折30歲前結婚婚姻難持久除非會祿存又無煞星沖
入兄弟宮~~ 手足之情雖還融洽只是各顧各的彼此幫助不大
入夫妻宮~~男命多半娶能幹的太太且是妻管嚴女命多半是嫁吃苦勤儉的老公即使沒有煞星攪局夫妻間口角蠻多的若煞星入當事人易有出軌的現象尤其是女命更甚.
入子女宮~~子女愛頂嘴親子間溝通不良多爭執小孩活動力旺在家待不住
入財帛宮~~ 只要沒煞星錢財算是穩定的這是上班族的財也可靠嘴吃飯
入疾厄宮~~ 有少年白的傾向皮膚不佳易長濕疹心臟機能弱支氣管也不好也要注意泌尿系列婦科之疾
入遷移宮~~ 閒不住愛往外跑在外是非. 口舌多常吃力不討好
入僕役宮~~若僕役宮有煞星要防被朋友出賣朋友多而無用對自己並無幫助
入官祿宮~~宜餐飲服務業研發教育行銷俱有專業性質之行業
入田宅宮~~在旺地又無煞星交會則房地產富足室內佈置品味高在申位則不以此論
入福德~~ 個性急動作慢疑心病重憂患意識強愈老愈孤僻神經質愛鑽牛角尖
入父母宮~~親子間溝通不良有心結孝而不順易有爭執講話沒大沒小.
以上是宮內無煞星的論法倘落入老鼠屎則會破壞宮內原有論述