太陽+天梁
????????陽.梁在卯或酉的位置落差是很大的論太陽坐命的人必先看他是日生還是夜生人再者看是幾月份生的太陽坐命最好是日生人於春夏月份生為最佳. 陽.梁在卯坐命稱為~日出雷門格此格局很棒又稱~升殿太陽的光芒化解了天樑的孤僻只是此格局不是經商之格它可能是醫生慈善團體金融機構司法工作學者教授. 公職
??????陽.梁在酉便不成格了西落的太陽做什麼事都3分鐘熱度投機心很強死了的鴨子嘴硬愛鑽法律漏洞膽小怕事愛打高空有的人還因酒色誤事.
??????陽.梁人的夫妻宮必為天同+巨門這是不利婚姻的組合之一. 感情波折多. 但也有人例外.婚姻的好壞與個人的經營有關不可以偏蓋全統而論之.
?
入命宮~~ 皮膚不好易長豆.常泛油光大嗓門隨性隨意不居小節穿著邋遢卯宮者長輩緣佳.
女生: 家庭觀念重顧娘家是個待人熱心的大姐頭外貌有點老氣動作大剌剌做事快手快腳
入兄弟宮~~ 手足之情融洽只要不逢煞星能兄友弟恭
入夫妻宮~~女命的老公老實只是當事人自己感情不定男命的老婆有幫夫運太太不是年齡大就是長相老成
入子女宮~~本身是25孝會溺愛子女因而養成子女的懶散
入財帛宮~~ 喜歡投資投機若煞星同宮錢怎麼來就怎麼去
入疾厄宮~~ 斷掌肝火旺腸胃不好心臟無力或左撇子神經衰弱香港腳濕疹性需求旺
入遷移宮~~ 個性好動 活躍 有長者緣
入僕役宮~~若僕役宮在(卯)可得年長的異性幫助較大若僕役宮在(酉)沒有知心友朋友相交互謀其利
入官祿宮~~宜餐飲不動產服務業醫療旅遊業或專業技術的行業
入田宅宮~~在旺地又無煞星交會則房地產富足或有祖產
入福德~~ 不愛乾淨不重外表女命則老來孤獨
入父母宮~~親子關係好對父母尊重且孝順但父緣弱些
以上是宮內無煞星的論法倘落入老鼠屎則會破壞宮內原有論述