: 廉貞天府入命宮 ( -- ) 
 s" 廉貞天府入命宮：" 斷文 ;
 s" 這是廉貞組合中最好的一個格局，又稱為~桃花帶財格，也稱為賺錢桃花。鬼靈精的廉貞與霸氣的天府混在一塊，其人做風強勢又囂張，個性急又主觀，一切向錢看，還外帶了些勢力眼，但！這也沒啥不對，至少廉. 府人務實些！" 斷文 ;
 s" 廉、府坐命者若逢文昌.文曲會讓當事人的氣質加分，知進退、人情事故都做的恰如其分、度量大、有容人之雅、舉手投足間，能撐得起場面，公關能力強，不論男女，都能揮灑出自己的舞台。" 斷文 ;
 s" 廉、府人腦筋靈活，擅於打算，又能無中生有，反應靈敏，足智多謀，結交異性，通常??是要人財兩得，也就是說廉、府人，要不要對此異性付出感情，最先考慮的是有沒有錢的問題。" 斷文 ;
 s" 此格局就不宜會到老鼠屎了，個性會變得霸道不講情理，自私、待人刻薄，投機心強、愛八卦、愛打小報告，男人易沉迷酒色之中，反而因此而觸刑法。" 斷文 ;
 s"  因廉貞與天府都主官非，此二星在一起，走法庭的機會，較其他星要來的多了！" 斷文 ;
 s" 廉、府人第一次婚姻，能長久經營的不多，面臨二度婚姻的機會很大，即使打離婚官司，也是脫離不了錢的糾葛！" 斷文 ;
 s"  (男命)個子不高但鬼點子到不少，異性緣好、性急敏捷，做事有氣魄，果斷幹練，口才佳，眼睛往上看，喜歡結交高層人士，很會攀親帶故的拉關係。" 斷文 ;
 s" (女命）精明幹練、好勝心強不服輸，性格獨立，多半是易胖體，身材較壯，予人一種粗枝大葉之感，最經不起別人的激將法，很有大姐頭的風範。" 斷文 ;
 ;
  
: 廉貞天府入兄弟宮 ( -- ) s" 廉貞天府入兄弟宮：手足雖多，但只是平常各顧各，較難得到他們的幫助，他們成就再好，跟自己一點關係也沒有。" 斷文 ;
: 廉貞天府入夫妻宮 ( -- ) s" 廉貞天府入夫妻宮：另一半氣質挺優的，精明能幹，大小事能一肩扛。唯要忍受其性急、霸道、嘮叨的個性。把錢交給他處理準沒錯。" 斷文 ;
: 廉貞天府入子女宮 ( -- ) s" 廉貞天府入子女宮：子女緣薄，原因是子女成就不錯，但事業心重、忙於自己家計，是無暇守在你身邊照顧或奉養的。" 斷文 ;
: 廉貞天府入財帛宮 ( -- ) s" 廉貞天府入財帛宮：只要沒老鼠屎搞破壞，錢財運是相當旺的，而且手邊現金不少，本身生活品質、品味皆高，是個重享受之人" 斷文 ;
: 廉貞天府入疾厄宮 ( -- ) s" 廉貞天府入疾厄宮：氣血不順、皮膚不佳、視力差、若有白虎對照，還需防肝癌或肝硬化，有人有斷掌之象。" 斷文 ;
: 廉貞天府入遷移宮 ( -- ) s" 廉貞天府入遷移宮：閒不住、愛往外跑，活動面寬，異性緣旺，有事找異性協助準沒錯。一生奇遇蠻多，可結識高層次朋友。" 斷文 ;
: 廉貞天府入僕役宮 ( -- ) s" 廉貞天府入僕役宮：朋友的層次、水準都高過於你，自己反成了攀附權貴、愛拉關係的角色，但他們對自己並無實質的幫助，只是滿足一下虛榮心罷了。" 斷文 ;
: 廉貞天府入官祿宮 ( -- ) s" 廉貞天府入官祿宮: 宜餐飲，娛樂，服裝，電機，工程，傳播，廣告...等大型企業工作，若無老鼠屎，中年後有創業機會." 斷文 ;
: 廉貞天府入田宅宮 ( -- ) s" 廉貞天府入田宅宮：若無煞星，不動產旺盛。宜早在名下置產。" 斷文 ;
: 廉貞天府入福德宮 ( -- ) s" 廉貞天府入福德宮：主觀固執，性急如風，嗓門大，愛漂亮重門面，花錢乾脆大方、老年後孤單嘮叨。" 斷文 ;
: 廉貞天府入父母宮 ( -- ) s" 廉貞天府入父母宮：與父親緣薄、有代溝，長輩固執霸道。有些人童年有破相之憂。" 斷文 ;