: 廉貞貪狼入命宮 ( -- )
 s" 廉貞貪狼入命宮" 斷文 
 s" 這可是紫微鬥數中的大桃花格局，廉貞為次桃花星，貪狼為桃花島主，2顆響噹噹的桃花星同入命宮，此人的魅力、惑力及電力可想而知，" 斷文
 s" 桃花星坐命者，男帥女媚，簡直是俊男美女的組合，就算外表沒有驚為天人的震撼，可舉手投足間、眉宇間、姿態間，就是會透出致命的吸引力，。" 斷文
 s" 但！還是有例外的，若三方會到空、劫，那長相真的很抱歉了！" 斷文
 s" 古書對廉、貪坐命者的評價相當糟糕！尤其是女人，那簡直是該千刀萬刮的狐狸精，男人除好色之外，一生運勢多兇多險，女人重淫、是個不安於室的花蝴蝶。" 斷文
 s" 因格局桃花過重，造成感情的複雜性是剪不斷、理還亂。" 斷文
 s" 廉、貪會同宮只有在巳、亥的位置，而寅、申位是2星對照，其威力不輸給同宮。此時若三方四正遇到文昌、文曲，這下可成了不折不扣的「淫火重」，" 斷文
 s" 男命是吃、喝、嫖、賭、毒、騙無所不為，女命是招蜂引蝶、人盡可夫的「墮落天使」。" 斷文
 s" 各位看到對廉、貪者如此無情的審判、和評價，心中都會「逃過一劫」般的鬆了口氣，但對廉、貪坐命的格友卻是喘喘不安了，天！怎麼會這樣？我不是這種人啊！我沒有這種狀況啊……？ ！" 斷文
 s" 各位別心急，以上所說，只是一種現象而已，未必會命中，但的確也有人在感情觀念上是很open的，這和一個人的家教、環境、交友..等都有直接的關係。能破解以上狀況，" 斷文
 s" 除非：1.逢空、劫，2.會到祿存，3.身宮坐天府或天相等穩重之星來導之為正。看命盤絕不可只憑一宮一星就獨下斷語，紫微鬥數萬變化千，任何一顆星都可能讓鄰坐星起化學變化，這在解盤上不可不慎ㄡ！" 斷文
 s" 廉貞貪狼入入命宮：(男命)異性緣好、口才佳、自以為很帥、不管有錢沒錢都很重視門面、穿著，在女人堆裡吃香。" 斷文
 s" 個高挺拔，幽默靈巧，唯缺乏自製力，易因情事而誤了前途，若再交友不慎，吃喝玩樂而喪志。" 斷文
 s" (女命）音色動人、姿態撩人，一張塗滿蜜糖的嘴，教天下男人覺得拒絕她是一種罪過，愛打扮、愛名牌、愛美食、更愛上流社會的杯桄？ ？ ，炒飯能力既強又大，生活離開吃、穿、性的誘惑。" 斷文
 s" 以上命宮狀況是在沒有老鼠屎的情形下，在論廉、貪格之時，無論煞星、吉星、桃花星都會對此格局產生變化的。" 斷文
 ;
 
: 廉貞貪狼入兄弟宮 ( -- ) s" 廉貞貪狼入兄弟宮：只要沒煞星，手足之情尚佳，只是平常各顧各、各玩各的。但可能會有不同血緣關係的兄弟姐妹。" 斷文 ;
: 廉貞貪狼入夫妻宮 ( -- ) s" 廉貞貪狼入夫妻宮：感情生活複雜，不利於婚姻，本身情事亦相當精彩。男命喜歡媚、翹、亮麗、愛ㄋㄞ的女生。女命愛體健、有肌肉的帥哥，但婚姻要持久，需老公年長些較宜。" 斷文 ;
: 廉貞貪狼入子女宮 ( -- ) s" 廉貞貪狼入子女宮：子女緣薄、或性格叛逆、獨立。廉、貪入此宮可能會有：1.領養他人的小孩，2.有與自己非血緣關係的子女(自己不知情)" 斷文 ;
: 廉貞貪狼入財帛宮 ( -- ) s" 廉貞貪狼入財帛宮：錢財皆是辛苦存來的，無丁點的偏財運，萬不可亂投資、亂投機，本身理財概念差，不宜管錢。對錢較貪，易因小失大。" 斷文 ;
: 廉貞貪狼入疾厄宮 ( -- ) s" 廉貞貪狼入疾厄宮：心臟機能差、氣血不順、肝火旺、視力差、若有白虎對照，男人需防肝癌，女人需防子宮頸癌。男、女都要注意因「性」惹出的毛病。" 斷文 ;
: 廉貞貪狼入遷移宮 ( -- ) s" 廉貞貪狼入遷移宮：閒不住、愛往外跑，異性緣旺，經不起外界引誘，要注意意外事故。" 斷文 ;
: 廉貞貪狼入僕役宮 ( -- ) s" 廉貞貪狼入僕役宮：朋友交往複雜，狐群狗黨也不少，但對自己無幫助，很難以誠相待，大難來臨各自飛，朋友能力雖不錯，都是好看而已。" 斷文 ;
: 廉貞貪狼入田宅宮 ( -- ) s" 廉貞貪狼入田宅宮：若無煞星，不動產旺盛。但子女較難盡孝道。" 斷文 ;
: 廉貞貪狼入福德宮 ( -- ) s" 廉貞貪狼入福德宮：有點勢力眼，防衛性強，不吃虧，愛佔便宜，固執、自我難溝通。" 斷文 ;
: 廉貞貪狼入父母宮 ( -- ) s" 廉貞貪狼入父母宮：與父母緣薄、有代溝，父母感情複雜，有2婚之象。再不自己有義父母。" 斷文 ;