
: 廉貞七殺入命宮 ( -- )
 s" 廉貞七殺入命宮" 斷文
 s" 在廉貞的組合中，廉殺的格局是不被看好的！" 斷文
 s" 廉貞的感性遇到七殺的衝動，個性上會有許多既衝突又矛盾的地方，廉殺人是先苦後甘的，在35歲以前除了辛苦和挫折之外，是沒什麼戰功或成果可言，" 斷文
 s" 若廉殺人少年早發，反而會到四十歲左右面臨人生的重挫，而讓他失去了抗壓的能力。" 斷文
 s" 廉殺人是屬於大雞晚啼的類型，企圖心旺、工作能力強、領導力也不錯，一般人很難想像外表看似一個堅毅果決的人，其實他的腦波磁場是很亂的，" 斷文
 s" 一件事情或一個想法永遠是理性與感性在糾葛，這種矛盾情節就是連當事人都說不出個所以然，正因如此也就影響到他未來的事業成就。" 斷文
 s" 廉殺同宮會構成一個大吉格，也會構成一個大凶格。在未宮坐命的廉殺，三方四正會祿入而不見老鼠屎衝破，此格局為積富之人，所謂積富是早年貧窮而後漸入佳境，列為富人。" 斷文
 s" 廉殺在遷移宮，若被凶星衝破此為「路上埋屍格」也就是說外出容易遇到重大的意外事故而危及生命，命盤有此狀況者，不可不慎。" 斷文 
 s" (男性)外表看似老實忠厚，實則性急、固執，吃苦耐勞也能打拼，獨當一面能力強，也能勤儉持家，為一根腸子通到底，不善於腦筋急轉彎，對於人情世故較為能冷感，七殺男心情鬱卒的比較多。" 斷文
 s" (女性)精明能幹，工作能力往往超過男人，因此會「代夫行權」，很有女強人的架勢，掌控慾強略帶虛榮心，雖也耐操耐磨，但理財的概念較弱，" 斷文
 s" 未宮坐命的廉殺女比較聒噪，醜宮的廉殺女較為沉默，但這些都不影響到她的工作能力。" 斷文
 ;
: 廉貞七殺入兄弟宮 ( -- ) s" 廉貞七殺入兄弟宮：兄弟無緣，欠缺手足之情，若無煞星衝破，各自為政而已。
: 廉貞七殺入夫妻宮 ( -- ) s" 廉貞七殺入夫妻宮：另一半愛吃醋，嘮叨、掌控慾強、異性緣好，廉殺入夫妻宮，情路難行，婚姻不得安寧。
: 廉貞七殺入子女宮 ( -- ) s" 廉貞七殺入子女宮：子女不多，少互動，緣分淡，子女頑皮不易管教，常讓父母頭痛。
: 廉貞七殺入財帛宮 ( -- ) s" 廉貞七殺入財帛宮：毫無理財概念，花錢只圖一個爽字，一生被錢追著跑，最好不要自己管錢，除非身宮有天府坐守還可以節制，此組合要存錢真難。
: 廉貞七殺入疾厄宮 ( -- ) s" 廉貞七殺入疾厄宮：容易體力透支，中年之後一些慢性病開始浮現，注意心血管的疾病，大腸過燥而便秘，偏頭痛、呼吸係統、筋骨酸痛、血壓偏高或偏低的不正常。
: 廉貞七殺入遷移宮 ( -- ) s" 廉貞七殺入遷移宮：個性急，喜歡搶黃燈，愛開快車，若遷移宮煞星過多一生意外頻繁，若大限的遷移宮不佳，則造成「路上埋屍」，客死他鄉，有此組合者，行車走路間不可不慎，若遷移宮吉星坐守，中年之後必可名利雙收。
: 廉貞七殺入僕役宮 ( -- ) s" 廉貞七殺入僕役宮：慎加擇友，容易被人拖累、出賣、嫁禍，而惹禍上身，友情不長久，以利為考量，這一生不合夥、不作保、錢財不外借，可減少損失。
: 廉貞七殺入官祿宮 ( -- ) s" 廉貞七殺入官祿宮：適合門市、電子、服務業、金融界、建築業。
: 廉貞七殺入田宅宮 ( -- ) s" 廉貞七殺入田宅宮：先天庫位較弱，錢財難留，要早在名下置產，住家附近較為雜亂，有廟宇、山崗、堆積物、老舊房舍、電塔、高樓、營房、警局。
: 廉貞七殺入福德宮 ( -- ) s" 廉貞七殺入福德宮：勞碌命閒不住，只想賺大錢，偏又錢材難留，欠缺精神享受，一生為情、為錢而奔走。
: 廉貞七殺入父母宮 ( -- ) s" 廉貞七殺入父母宮：只要沒有煞星進入，與父母溝通良好，重視父母，很有老人緣