
: 廉貞破軍入命宮 ( -- ) 
 s" 廉貞破軍入命宮
 s" 廉貞+破軍的組合，吉凶之間非常極端，此組合的三方四正若吉星來朝，煞星遠離，在古時可官拜公卿之位，一生榮華富貴絕少不了。若被煞星衝破，又無吉星來救（祿存+天馬）這是一個極端的自殺格局，就算有吉星來救，也是自殺後獲救的現象。
 s" 廉、破人的思想極端，作風霸道又善變，思想略顯灰色，反覆不定的性格有時令人無所適從，
 s" 廉、破人非常任性，經常強人所難而不自知，喜歡新鮮刺激、敢愛敢恨，感情世界既複雜又多變，這也是不利婚姻的組合。" 斷文
 s" 廉、破人佔有慾強、忌妒心強，只可他背叛別人，絕不允許別人背叛他。" 斷文
 s" 廉、破人的觀念「對我好是應該，錯一定是在對方。」" 斷文
 s" 應此在紫微鬥數眾組合之中，廉、破人的鴨霸、任性是很有名的，最讓人受不了的是他們得理不饒人，態度又吊兒郎當，做事我行我素，不太懂得尊重別人，" 斷文
 s" 因此這一生的運勢有如雲宵飛車一般，既驚險萬狀又大起大落。" 斷文
 s" 廉、破的組合若再與火星或鈴星同宮，為了愛情有自殺的傾向，得不到、愛不到就死給他看，自己得不到別人也休想得到，總之惹上了廉、破人就好像雙手沾上了「麥芽糖」既黏牙又難甩。" 斷文
 s" 要化解廉破人以上的特質，除非~" 斷文
 s" 1.會到祿存或天馬，來化解、改善星座的性質。" 斷文
 s" 2.身宮為天府，對此組合有壓制的能力。" 斷文
 s" 若無以上條件，則此組合是屬於高危險群的格局。" 斷文
 s" （男）：個性急、說話衝、口是心非、表裡不一、心機重、城府深、做事圓滑但用情不專，迎新送舊之間，信手拈來毫不眷戀。" 斷文
 s" 聲音好聽，有播音員的聲調，長相體面、玉樹臨風，有人特別喜歡留八字鬍，看起來帥帥的、壞壞的，而且性格有加。" 斷文
 s" 入命宮(女)：個性倔強、剛強、善妒、善變、多疑、掌控慾強、理不直氣也壯，經不起激將法，容易受到煽動、利用，愛貪小便宜，愛聽八卦、愛說八卦、愛打扮、愛比較，長的漂亮，虛榮心強。" 斷文
 s" 感情觀念開放，是物慾與情慾的結合，愛與不愛全在一念之間，用過就丟，毫不戀棧，對感情抱持著「寧可我負天下人，不可天下人負我」的霸氣態度。" 斷文
 ;
: 廉貞破軍入兄弟宮 ( -- ) s" 廉貞破軍入兄弟宮：手足無情，各自為政，當有利益衝突時，不惜對簿公堂，除非有吉星護盤。" 斷文 ;
: 廉貞破軍入夫妻宮 ( -- ) s" 廉貞破軍入夫妻宮：宮內若無煞星，夫妻情還算合諧，另一半個性、思想較為傳統保守。若宮內煞星坐守，當事人用情不專，另一半也喜歡拈花惹草，故不宜早婚。 " 斷文 ;
: 廉貞破軍入子女宮 ( -- ) s" 廉貞破軍入子女宮：子女叛逆，不易管教，破壞力強，親子之間有代溝，緣分也淡，子息不旺，流產機率高。 " 斷文 ;
: 廉貞破軍入財帛宮 ( -- ) s" 廉貞破軍入財帛宮：不善理財，也容易破財，投機心強，常常因小失大，若有桃花星加入??，錢財消耗在酒色、shopping之間，更加重錢財的消耗。 " 斷文 ;
: 廉貞破軍入疾厄宮 ( -- ) s" 廉貞破軍入疾厄宮：心血管、心臟、視力、上呼吸道過敏..等疾病都需要注意，口腔的病變也不容忽視。 " 斷文 ;
: 廉貞破軍入遷移宮 ( -- ) s" 廉貞破軍入遷移宮：一生多變動，又奔波，常有突發事故的事情發生，危機處理的能力較弱。 " 斷文 ;
: 廉貞破軍入朋友宮 ( -- ) s" 廉貞破軍入朋友宮：易交損友、易被朋友出賣、易受同事的牽連，欠缺得力的部屬，所交的朋友面善心惡，欠缺情義，即使宮內有吉星護盤，知心朋友也不多，一生要謹記不合夥、不作保、不要有金錢上的往來。 " 斷文 ;
: 廉貞破軍入官祿宮 ( -- ) s" 廉貞破軍入官祿宮：多半為白手起家的命格，但不宜從事製造業，適合貿易、旅遊、電子、機械、代理或服務業，若宮內有天魁、天鉞，可從事公職人員，若宮內煞星連連，事業起伏、破敗皆大，此時反不利創業。 " 斷文 ;
: 廉貞破軍入田宅宮 ( -- ) s" 廉貞破軍入田宅宮：居家附近的環境，新、舊之間落差很大，顯得雜亂無章，容易住到漏水屋、濕氣重的房子。若宮內煞星過多，會形成破庫。 " 斷文 ;
: 廉貞破軍入福德宮 ( -- ) s" 廉貞破軍入福德宮：勞碌命、閒不住，沒有理財概念，花錢如流水，欠缺精神享受，老來還得為五斗米奔波。 " 斷文 ;
: 廉貞破軍入父母宮 ( -- ) s" 廉貞破軍入父母宮：父母緣薄、互動不良，小時經常挨打，長輩感情複雜。 " 斷文 ;