?武曲+天府
?????????武曲帶出了5種不同的強勢格局其中格局最大.最好的莫過於武曲+天府的組合而此組合又以在"子" 的位置其格局最有成就鬥數中有所謂的3財星即武曲天府太陰. 但武曲與太陰是六合關係不可能同宮但武曲和天府則有機會構為雙財星同宮
???????當然囉! 屬於武曲進財的格局還包含了武曲+天相武曲+貪狼武曲+天府最喜歡入命宮或財帛宮或田宅或官祿宮或遷移宮若入其他宮位反而可惜了這2顆財星至於武曲+七殺及武曲+破軍這2種是武曲中最糟糕的破財格局此格局若自行創業的話多半是落得白忙一場的結局即使有一時的橫發但繼之而來的是橫破自己破財不說只怕還拖累週遭一票人
???武曲+七殺及武曲+破軍這組合一定破敗沒有例外嗎? 有! 除非會到祿存則可化解再不與截空同居會空掉其不知死活的個性
???武.府武.相武.貪等雖俱備了進財的格局但一定就坐等著發嗎? 未必! 還得(1)三方需會到祿存或化(2)三方不見煞星來沖這才能真正成進財格. 武.府武.相武.貪被錢追到跑路破產的人也不在少數啊! 逢煞星沖破的進財格在錢財上的漏洞比一般人要大的多了!
入命宮~~ 有點唯利是圖永遠向錢看外表強悍性集如風內心對錢是毫無安全感不管再怎麼花錢怎麼叫窮他們一定有個藏私房錢的秘密帳戶武府人的成就多半是中年之後顯現年輕必然要經過磨難挫折所幸他們還耐操耐磨的.
男生: 大方豪爽死鰾面子活受罪重義氣能冒險敢衝敢拼敢賭有衝勁企圖心旺一生以當" 老闆"為職志錢財的敏感度高哪兒有錢往哪鑽有時??反予人一種太現實太功利的印象因為他們不做無利可圖之事.
女生: 才智雙美精明能幹屬女強人型作風強勢.明快重吃重穿重品味但過於獨立的個性難免會代夫行權霸性的脾氣在感情上是失意的一群通常婚姻都不看好.在她們身上必易感受到"溫柔"二字.
入兄弟宮~~兄弟過於強勢手足感情尚佳但翻起臉來也挺嚇人的若有昌.??曲在內則為害稍減
入夫妻宮~~若煞星在內則婚姻多波折初婚不利二婚反而較好夫妻都很強勢都想控制對方尤其不利女性另一半雖說能幹但溝通不良是常有的事
入子女宮~~子女宮旺反主孤人數不多子女主觀自我性強獨立自主若宮內無煞星未來子女的成就都不錯
入財帛宮~~財星入財宮真是美呆了一生錢財不匱乏物質享受精神生活皆令人羨慕但若煞星坐內則是慘呆了財來財去的更快
入疾厄宮~~如此尊貴的星入此宮可惜到家不病則宜一病就是花錢.耗時的富貴病脾胃不佳易拉肚胃潰瘍胃酸打咯女生需防噸位加重
入遷移宮~~在家待不住人際好有長輩緣活動面寬愛往外跑要有成就必須先遠離家鄉發展
入僕役宮~~朋友都比你尊貴雖可交些有名望的朋友但泛泛之交毫無幫助有時還會被"吃夠夠"
入官祿宮~~若有魁.鉞同宮則宜公職此格局心比天高企圖心旺小工作小事業還看不上眼宜貿易傳播建築服務業資訊..等工作為主不宜合夥
入田宅宮~~住家坪數大樓層高財星最喜入庫可說庫旺大於財旺但會到煞星也是空歡喜一場破庫難留不動產易有耗損
入福德~~ 勞碌命憂患意識重凡事放不開愈老愈孤僻嘮叨霸道自我不講理喜歡戶外活動
入父母宮~~ 尊重長輩長輩有名望重視子女教育但反哺之心力不殆
以上是宮內無煞星的論法倘落入老鼠屎則會破壞宮內原有論述
?
雙主星入12宮~~武曲系列武.相篇2008-10-28 10:33
雙主星同宮因受到五行的影響在論法上略有不同現就以武曲系列的雙主星入12宮各別的論法