: 武曲貪狼入命宮 ( -- ) 
 S" 武曲貪狼入命宮" 斷文 
 S" 武曲的格局中有三大吉格，即武府、武相、武貪等格，古書雲：武貪不發少年人，意謂著武貪人需歷經磨難始能成就大器。" 斷文
 S" 武府為鉅富、武貪為鉅商，此2格都是旺在中年之後，但要成鉅富、鉅商談何容易？" 斷文
 S" 命格雖俱備了富有的條件，還得靠大運來執行它，有人雖是鉅富、鉅商格，可是一輩子走不到發跡的大運，空有此旺格，只能徒呼奈何！" 斷文
 S" 什麼是「一輩子走不到發跡的大運」？即破格之意，此格若有老鼠屎搞破壞、或大運有老鼠屎來攪局，鉅富、鉅商只是一場發財夢而已，即使發了，也是即成即敗，最後落得一場「曾經擁有」的回憶。" 斷文
 S" 武貪逢煞為奸商、武府逢煞為富不仁，二者在求財上都有不擇手段的嫌疑，尤其武貪人需吉星會合，始能成就富貴，若被眾老鼠屎沖破，反成百工雜技之人，一生福氣不全、?碌飄泊。" 斷文
 S" 武貪吉星簇擁，為人吝嗇愛財，武貪老鼠屎過多反而窮大方的慷慨過度，吉凶之間的反應真是兩極化啊！" 斷文
 S" 武貪格無論男女，身高不高，但門面都長得不錯，愛熱鬧、愛酒食，喜歡聚餐、玩樂，多半幼年家運很好。" 斷文
 S" 七顆老鼠屎中唯有火星、鈴星與武貪會形成「火貴格」，此又為「商場得意格」，七顆老鼠屎被踢掉2顆。但不可再與其他老鼠屎相會，否則格局破壞。" 斷文
 S" 坐命男性：保守內向，親和力強，重承諾、講義氣，尊重長輩，唯花錢不夠大器（除非會到老鼠屎），勤儉持家，能吃苦。" 斷文
 S" 女性：個性恰北北，會鑽牛角尖，閒不住、喜歡瞎忙，步調快，重視生活品質，沒事敷臉、做瑜伽、算是有幫夫運的賢內助，很會省錢（除非會到老鼠屎）" 斷文
 S" 若與火星或鈴星同宮，有代夫行權之能。" 斷文
 ;
: 武曲貪狼入兄弟宮 ( -- ) S" 武曲貪狼入兄弟宮：若無老鼠屎，手足情滿好的，但不可與錢有牽扯。" 斷文 ;
: 武曲貪狼入夫妻宮 ( -- ) S" 武曲貪狼入夫妻宮：感染挫折、困擾皆多，另一半能幹，需得晚婚，婚後桃花難免。" 斷文 ;
: 武曲貪狼入子女宮 ( -- ) S" 武曲貪狼入子女宮：自己是第25孝，若無老鼠屎破壞，子女有成就，獨立自成。" 斷文 ;
: 武曲貪狼入財帛宮 ( -- ) S" 武曲貪狼入財帛宮：對錢財多多益善，永不滿足，錢財自控，決不容許他人幹預、過問。" 斷文 ;
: 武曲貪狼入疾厄宮 ( -- ) S" 武曲貪狼入疾厄宮：中年需防糖尿病、皮膚易過敏、膀胱炎、心肺系統之疾、肝膽之疾。" 斷文 ;
: 武曲貪狼入遷移宮 ( -- ) S" 武曲貪狼入遷移宮：閒不住，易受外界誘惑，異性緣佳，人際也旺，最宜業務工作。" 斷文 ;
: 武曲貪狼入僕役宮 ( -- ) S" 武曲貪狼入僕役宮：易交玩樂之友，朋友、屬下靠不住，需防朋友劫財。" 斷文 ;
: 武曲貪狼入官祿宮 ( -- ) S" 武曲貪狼入官祿宮：宜技術業、代理業、金融業、護理人員、" 斷文 ;
: 武曲貪狼入田宅宮 ( -- ) S" 武曲貪狼入田宅宮：若無會到老鼠屎，田產必然富足，且幼小家運好。" 斷文 ;
: 武曲貪狼入福德宮 ( -- ) S" 武曲貪狼入福德宮：愛錢、會存私房錢，只重視自己享受，卻常忽略家人。" 斷文 ;
: 武曲貪狼入父母宮 ( -- ) S" 武曲貪狼入父母宮：若無會到老鼠屎，能孝順父母，但有些人可能會有「叔叔、阿姨」，父母婚姻出狀況，各有私情之象" 斷文 ;