武曲+天相
?????????武曲的剛毅碰到了天相多少化解了武曲的"寡宿" 特質在武曲的雙星組合中以女性而言武.相的柔性在外表看起來還有點女人味但私底下她還是有點粗線條的因對宮是破軍因此個性上仍有武.破的特性性格多變先禮後兵惹毛了她三字經罵給你聽. 翻臉如風速 .
?????????武.相的成就在申宮比寅宮好這是五行生剋的影響武.相人熱心很適合服務業很多武.相人都是雙職在身早.晚各有個不同性質的工作其理念是~賺錢第一武.相人三方會到天魁或天鉞這是公職的命格若會到文昌或文曲這可是文武雙全的格局了. 但以女性而言為破格若無祿存制化有些武.相女行為較放縱活像隻花蝴蝶的穿梭會到文昌或文曲武.相女找工作多半先以服務業為首選但服務業的種類繁多有些服務業的性質就耐人尋味了
?????武.相若與天馬同宮只要他(她)願意學舞必然有機會榮登~舞林高手~之榜因夫妻宮坐貪狼在感情的福份上較為薄弱些.
??????入命宮~~ 服務熱忱賺錢企圖心旺很有敬業精神耐操耐磨時時不忘找財路重形象凡事先豎立口卑重視品質不打馬虎眼自我要求甚高相對對人的要求也高因此達不到其要求者常被罵的狗血淋頭但他們待人是重承諾的.
男生: 循規蹈矩很有敬業精神理財概念也不差又能吃苦只要有錢賺兼幾個差都好唯身材不高性格內斂寡言大都有專業技能在身
女生: 精明能幹屬女強人型作風強勢.嘴帶菱角外型好看重吃重穿重品味個性固執豪爽看起來外柔內剛是個小辣椒女命大多從事服務業. 公關傳播財經也有些是特種的服務業囉.
入兄弟宮~~只要沒煞星手足感情深厚彼此互通有無且有通財之義.兄弟會多於姐妹.
入夫妻宮~~男命娶有幫夫運的太太女命嫁難得體貼較粗線條的老公感情是頭燒燒尾冷冷若煞星在內則婚姻難到老溝通不良是常有的事.
入子女宮~~子女自我性強獨立自主與子女的情感較淡.
入財帛宮~~財星入財宮一生錢財不匱乏若無煞星坐內節省又有理財觀念若煞星坐內萬不可從事金融業更不宜投資否則財來財去的更快
入疾厄宮~~支氣管呼吸系統泌尿系統疝氣攝護腺.煞星入還得注意大腸??癌.性能力佳
入遷移宮~~在家待不住活動面寬善於利用人際關係重面子講義氣愛往外跑要有成就必須先遠離家鄉發展一生較奔波.
入僕役宮~~不能與朋友合夥. 慎防友人劫財. 有煞星入. 易交無義氣之友. 容易被出賣
入官祿宮~~ 宜服飾. 精品珠寶餐飲財務貿易傳播服務業文化資訊..等行業
入田宅宮~~ 財星最喜入庫若三方無會到煞星不動產相當豐富甚至有祖產倘煞星沖破形成破庫難留房產易有耗損
入福德~~ 愛熱鬧愛漂亮喜歡戶外活動喜歡服務大眾熱忱雞婆
入父母宮~~ 雙親重視子女教育在愛護中成長若無煞星沖破親子感情佳
以上是宮內無煞星的論法倘落入老鼠屎則會破壞宮內原有論述