??武曲+七殺
????????武曲財星逢七殺，這真是不利錢財的組合，再者這兩顆星的五行都屬金，因此武殺坐命的人，個性剛烈，但外在舉止有度，不了解的人很難想像武殺人碰到挫折的時候，他是會歇斯底里的狂叫（有點像陳x妤）。
武殺人信奉的是拜錢教，終其一生為了錢衝！衝！衝！但因受到剛毅個性的緣故，只知進不知退，往往弄的自己精疲力盡，前功盡棄。武殺人憑著一股不妥協、不服輸、不向環境低頭的蠻力，有些幸運者到也因此讓他打出一片天，但成之於衝勁、敗之於衝勁，到頭來終究歸於零。這一生的運勢有如雲霄飛車，大起大落，令周遭人為之捏把冷汗。
????武殺人是一個好員工，因其耐操耐磨，又忠於職守，責任感重、有擔當，這樣的個性拿來當老闆，苦的就是員工了。因為他不是一個會體卹部屬的老闆，他認為老闆都能吃苦，員工憑什麼涼快？再加上權利慾望強、喜歡發號司令，有些武殺人拿著雞毛當令箭，在團體中難免會顧人怨。
其實武殺人面惡心善，雖然性急如風，講起話來鏗鏘有力、嗓門大，其實他像隻唬人的蜥蜴，看起來兇猛可怕，其實他是非常膽小的，武殺人重承諾、重義氣，先入為主，要改變他的想法，除非幫他換個腦袋還比較快。
男生：
性格固執，倔強的像頭牛，先入為主觀念重，決定的事是九牛拔不出的，一生奔波勞碌，耿直的脾氣不懂得腦筋急轉彎，喜怒形於色，是個最差的說謊家，說好聽點他是誠實善良，可是一般人會用「白目」來形容他！
女生：
武殺最不宜女命，個性又衝又直，作風男性化，霸道主觀，很有領袖特質，一個武殺女可以當兩個男人來用，她們處事一板一眼，經的起挑戰，在職場上能跟男人較量、較量，這樣的特質在婚姻上很難修得圓滿。
入兄弟宮：手足之情淡薄，多爭執，長大後，套句武俠小說的用語~「英雄上馬，各奔前程」。
入夫妻宮：不管男女都是感情多挫，不易婚配，即便結婚另一半沒有情調、不解風情，眼中只有錢，婚姻生活難得和諧。
入子女宮：子女緣薄，小孩個性剛烈不易管教，若有老鼠屎逢空，容易流產，嚴重者可能會生出有某方面缺陷的小孩。
入財帛宮：沒有金錢概念，出手大方花錢爽快，若做生意的話賠的比賺的多。此種組合是貧富一線間，昨天還是令人稱羨的富豪，一夕之間變成繞跑的逃難人。
入疾厄宮：1.腸胃不佳，注意直腸的病變。 2.脊椎不好，筋骨酸痛。 3.呼吸係統、支氣管不佳。 4.性需求旺盛，若有擎羊同宮易有血光之災。
入遷移宮：在家待不住喜歡往外跑，一生出國的機會不斷，在外喜歡結黨搞派，或參與社團。
入僕役宮：1.需防朋友劫財。 2.要慎加擇友，以免受陷害。 3.朋友在精不在多，萬不可有金錢來往。
入官祿宮：1.創業量力而為，保守經營。 2.適合旅遊、育樂、餐飲。 3.若要避免人生的大起不落，最好吃人頭路。
入田宅宮：白手起家，不適合自己管錢，若宮內有老鼠屎，不動產有破損的現象。
入福德：勞碌命閒不住，沒事也得找點事做免得會生病。花錢乾脆，只圖一個爽字，老來可能會到慈善機構當義工。
入父母宮：親子之間，溝通不良，常有意見之爭，父母之間其中有一個脾氣大，性格剛烈又頑固。