: 紫微天相入命宮 ( -- ) 
 S" 紫微天相入命宮" 斷文 
 S" 不論男女既帥又美氣質出眾玉樹臨風是個穿衣高手重形象愛面子熱心公益雞婆又心軟挑吃挑穿虛榮心過重此命格男人多半不得志女人易因奢華而入風塵" 斷文 
 S" 紫.相同宮成就未必順遂如果有左輔.右弼三方會見40歲後配上好大運始有成就展現" 斷文 
 ;
: 紫微天相入兄弟宮 ( -- ) S" 紫微天相入兄弟宮 手足感情雖好但對自己幫助不大" 斷文 ;
: 紫微天相入夫妻宮 ( -- ) S" 紫微天相入夫妻宮 早婚難持久晚婚尚能圓滿" 斷文 ;
: 紫微天相入子女宮 ( -- ) S" 紫微天相入子女宮 子女不旺 但小有才藝" 斷文 ;
: 紫微天相入財帛宮 ( -- ) S" 紫微天相入財帛宮 不善理財 來去皆速" 斷文 ;
: 紫微天相入疾厄宮 ( -- ) S" 紫微天相入疾厄宮 腎結石 胃酸" 斷文 ;
: 紫微天相入遷移宮 ( -- ) S" 紫微天相入遷移宮 他鄉遇貴" 斷文 ;
: 紫微天相入僕役宮 ( -- ) S" 紫微天相入僕役宮 朋友多.層次高 能得友人助" 斷文 ;
: 紫微天相入官祿宮 ( -- ) S" 紫微天相入官祿宮 宜吃.穿精品珠寶財經行業" 斷文 ;
: 紫微天相入田宅宮 ( -- ) S" 紫微天相入田宅宮 住宅高 幽情 附近有水道" 斷文 ;
: 紫微天相入福德宮 ( -- ) S" 紫微天相入福德宮 重外表重形象愈老愈嘮叨精神空虛" 斷文 ;
: 紫微天相入父母宮 ( -- ) S" 紫微天相入父母宮 與父母緣薄小時常挨打且有些父母感情出包" 斷文 ;
\ 以上是宮內無煞星的論法倘落入老鼠屎則會破壞宮內原有論述