: 紫微七殺入命宮 ( -- ) 
 S" 紫微七殺入命宮" 斷文
 S" 是個大男人或大女人個人色彩重崇尚自由不受世俗約束自負.自我主觀重易獨斷獨行表現慾.掌控慾皆強重享受愛旅遊家庭觀念淡傾向不婚族很會唱反調" 斷文
 S" 此命格有殺.破.狼的組合在內不論男.女若沒有吉星相伴一生如坐雲宵飛車但惡人沒膽紫.殺人外表霸氣實則紙老虎一隻女命外向能幹精打細算能旺夫但較為自私" 斷文
 S" 此組合若逢空當事人反為~狗掀門簾全仗一張嘴懶散被動欠行動力煞星愈多不利六親" 斷文
 ;
: 紫微七殺入兄弟宮 ( -- ) S" 紫微七殺入兄弟宮 手足緣薄 也不多 各自為政" 斷文 ;
: 紫微七殺入夫妻宮 ( -- ) S" 紫微七殺入夫妻宮 另一半嘮叨成性婚姻晚成或不婚感情多挫易出軌多爭執" 斷文 ;
: 紫微七殺入子女宮 ( -- ) S" 紫微七殺入子女宮 子女宮過旺不易管教子女叛逆雖成材但難盡孝心" 斷文 ;
: 紫微七殺入財帛宮 ( -- ) S" 紫微七殺入財帛宮 錢財一把抓不喜他人過問物慾高財來財去財運弱" 斷文 ;
: 紫微七殺入疾厄宮 ( -- ) S" 紫微七殺入疾厄宮 腸胃不佳胃下垂胃出血大腸之疾" 斷文 ;
: 紫微七殺入遷移宮 ( -- ) S" 紫微七殺入遷移宮 喜歡旅遊也會搞小團體宜遠離出生地" 斷文 ;
: 紫微七殺入僕役宮 ( -- ) S" 紫微七殺入僕役宮 朋友多份子雜容易誤交損友自己也不擅擇友" 斷文 ;
: 紫微七殺入官祿宮 ( -- ) S" 紫微七殺入官祿宮 為主管格宜具專業行之行業工作場所不穩定" 斷文 ;
: 紫微七殺入田宅宮 ( -- ) S" 紫微七殺入田宅宮 早年辛苦待40歲後庫才穩定" 斷文 ;
: 紫微七殺入福德宮 ( -- ) S" 紫微七殺入福德宮 膽小又操勞因優柔寡斷而錯失良機閒不住有待老來從事公益的念頭" 斷文 ;
: 紫微七殺入父母宮 ( -- ) S" 紫微七殺入父母宮 有代溝父母感情不睦但勤儉家教嚴" 斷文 ;
\ 以上是宮內無煞星的論法倘落入老鼠屎則會破壞宮內原有論述