	: 七殺朝斗格		cr ." 天府守垣格" cr

		;

	: 是七殺朝斗格? 	( -- )

		七殺的地支 寅 =
		if 	
			七殺朝斗格
			好的格局數增加
			then
		七殺的地支 子 =
		if 	
			七殺朝斗格
			好的格局數增加
			then                      
		;
    
	: 是七殺朝斗格? 	( -- )    
		七殺的地支 申 =
		if 	
			七殺仰斗格
			好的格局數增加
			then
      
		七殺的地支 子午 =
		if 	
			七殺仰斗格
			好的格局數增加
		then
    ;      
        
\s    
http://www.lnka.tw/html/topic/1045.html

富貴吉格——七殺朝斗格

七殺守命，入子午寅申宮，與祿存、科權祿、左右、昌曲、魁鉞加會為本格。七殺在寅申宮入廟，在子午宮旺地。七殺在申、午坐命為“朝斗”，在寅、子坐命為“仰斗”。此格帶有殺氣，自己發達而必有另一部份人遭殃，或所以而有不少人死在他的手下。

入此格者，多主武職權貴，統領百萬雄師，不然也是公司創始人，商界英才，大富無疑。有吉星加會，又有兇星加會則屬破格，主大起大落，暴發暴敗，縱然一時發達也難長久保持，并且結局大多不佳。不會吉星，則減為平常之格，不見吉星而見兇曜同宮加會，則為劣等命式，主兇惡、殘疾、奔波、犯罪、牢獄，又恐壽難長永。

詩曰：“格名朝斗貴無疑，入廟須教壽福齊。烈烈重重身顯耀，平生安穩好根基”；“七殺寅申子午宮，四夷拱手服英雄。魁鉞左右文昌會，科祿名高食萬鐘”。經云：“七殺朝斗，爵祿榮昌”；“七殺寅申子午，一生爵祿榮昌”；“朝斗仰斗，爵祿榮昌”；“七殺守命，廟旺，有謀略，見紫微加見諸吉，必為大將”；“七殺守命，得左右昌曲拱照，掌生殺之權，富貴出眾”；“七殺入命身宮，見吉，亦必歷受艱辛”。

如：墨索里尼，乾造1883癸未年六月二十六日未時生，七殺、祿存在子宮坐命，官祿宮破軍化祿，故其人能平步登云，把握國家政權。輔弼昌曲不會，孤家寡人之象，加會地劫、天空、火星，故壽數有限，必遭兇死。（癸未己未甲戌辛未，七歲）

湯化龍，乾造1874甲戌年十月十九日亥時生，七殺在子宮坐命，命宮有鈴星，身命同有劫空二煞，本不足奇，惟其身宮三方四正會化祿化權化科，亦有一時之顯達，但命宮有兇星，主一生不順，且壽命不長，于虛45歲時兇死。湯化龍為光緒時進士，留學日本，1909己酉年被推為湖北咨議局議長，武昌起義后，掠奪湖北軍政府民政長職位，排擠革命黨人，次年為眾議員院長，擁護袁世凱，同國民黨對抗。1914甲寅年任教育總長，次年辭職，1917年被段祺瑞任命為內務總長。因受孫中山為首的南方護法軍政府的通輯，被迫去職。段祺瑞內閣復活時不受重用，懷著嫉恨出國，1918年戊午，運行犯“七殺重逢”之兇限，在加拿大被國民黨籍華僑刺死。（甲戌乙亥戊子癸亥，三歲）

文天祥，乾造1236丙申年五月初二日子時生，七殺在午宮坐命，命宮有右弼吉星，官祿宮有文曲化科，七殺朝斗，平步青云，為大貴之格。二十一歲1256丙辰年中狀元。本命遭兇煞會聚而破格，命宮擎羊落陷，主人性格剛硬，寧死不屈，且三方會火星鈴星，福不全美，定屬壽夭之格，有牢獄之災，必遭兇死。文天祥歷任刑部郎官、知瑞贛等州。1275乙亥年元兵東下，文天祥在贛州組織義軍，入衛臨安，次年任右丞相兼樞密史，都督諸路軍馬，往元軍營中談判，被扣留。后于鎮江出險，流亡至通州，由海路南下，至福建與張世杰、陸秀夫等人堅持抗元。1277年在廣東海豐被俘，次年送至大都（今北京），迭經威逼利誘，寧死不屈，1283年（農歷壬午年）四十七歲，逢遇“羊陀迭并”、“七殺重逢”，尾月初九日于柴市英勇就義。遺著有《指南錄》、《文山先生全集》，其《過零丁洋》、《正氣歌》這兩首詩尤為昆裔所傳誦。（丙申甲午丁巳庚子，六歲） 

杜月笙，乾造1888戊子年七月十五日午時生（見窮通寶鑒），七殺、天馬在寅宮坐命，財帛宮貪狼化祿，對宮（福德）有鈴星激發，左右昌曲交會于財帛福德二宮，雖出生貧*，亦有異路前程，顯赫一時。凡七殺、擎羊、火星（或鈴星）、白虎會合于命宮三方四正，多是黑社會之大頭目。杜月笙少年時為舊上海賣水果的一個小癟三，干盡惡事，以販賣鴉片起家發跡，后成為上海法租界青幫頭子之一，與黃金榮、張嘯林并稱上海三大亨。他又是蔣介石的師兄，黑社會之大頭目，乃上海翻云覆雨之大流氓，從販賣鴉片到“工商界巨子”、及到“政界頭面人物”，歷盧永祥、孫傳芳、張宗昌、蔣介石幾個“王朝”而不倒，八面威風，著名中外朝野。1949年上海解放前夕，杜月笙移居香港，與京劇名演員孟小冬結婚，1951年辛卯，六十四歲，農歷七月十四日申時在香港病死。（戊子庚申乙丑壬午，五歲）

林則徐，乾造1785乙巳年七月二十六日子時生，七殺在申宮坐命，會魁鉞，遷移宮紫微化科，左右昌曲交會于財帛、福德二宮，為民族英雄，清末政治家。林則徐提倡經世之學，任東河河道總督時曾修治黃河，任江蘇巡撫時興修諸多水利。1838年戊戌，在湖廣總督任內，禁止鴉片，成效卓著，為禁煙派代表人物。旋受命為欽差大臣，赴廣東查禁鴉片輸入，次年緝獲英美煙販鴉片二百三十七萬斤，在虎門當眾銷毀。并積極籌備海防，創辦義軍。屢次打退英軍武裝挑釁。鴉片戰爭爆發后，因林則徐的嚴密設防，使英軍在廣東沒有辦法得逞，因受投降派污害，被革職，不久充軍新疆伊梨，曾在新疆興辦水利，墾辟屯田。1850年庚辰,太平天國起義爆發，被起用為欽差大臣前往廣西彈壓，在潮州途中被廣州十三行毒梟派人毒死，時年六十六歲。（乙巳甲申癸酉壬子，七歲）

朱德，開國元勛，乾造1886丙戌年冬月初六日辰時生，七殺、天馬、文曲在申宮坐命，輔弼相會，必為將帥，號令百萬雄師，橫掃天下。貪狼、陀羅在辰宮入廟守身宮，乃威武中所宜有者。1976年九十一歲，六月初旬日逝世。（丙戌己亥乙未庚辰，二歲）

明朝孝宗弘治天子，1470庚寅年七月初三日子時生（見三命通會），七殺、祿存在申宮坐命，財帛、福德有左右、昌曲交會，1487丁未年十八歲登基，1505乙丑年駕崩，在位十八年。（庚寅甲申己卯甲子）

端方，乾造1861辛酉年三月十一日申時生，滿州正白旗人。七殺右弼在申宮坐命，三方會昌曲，主貴。唯文昌化忌，沖照命垣陀羅惡星，不但壽命不長，而且必遭兇死。端方為出洋五大臣之一，1911入川彈壓保路運動，部下起義，被拘捕槍殺。（辛酉壬辰己亥壬申，四歲）