	: 三奇嘉會格		cr ." 三奇嘉會格" cr
		;

	: 是三奇嘉會格? 	( 某命盤 宮名  --- )
			三方四正會合
			化祿星 化權星 化科星 三星會合 相符
			0 <>	if 	
				三奇嘉會格
				好的格局數增加
				then
		;
 \s
 
 化祿、化權、化科三化曜稱為三奇，此三化曜會于命宮三方四正，便為三奇加會格。入本格者，志向弘遠，運氣極佳，有僥幸之惠，多意外好運及貴人之助，一生能成就大事大業。

三合正星入廟旺及三化曜亦廟旺得地，則為著名世界之格，巨富大貴。若命宮星辰廟旺，且三方會有兇星，仍有富貴聲名，只是比前者不及爾。若命宮星辰落陷且三方會有四煞劫空，或命重犯空亡者，雖有才華亦懷才不遇，難有大成，反減為平常之格。若宮中本無吉星調配得宜，縱有科權祿三奇，亦難有大器可能，反之若吉星配值得宜，即有化忌，地劫、天空也只是減些福爾，亦無大礙，運用之法端在一心，非文字所可盡言。大凡命有三奇者，絕非輕易之輩，觀其人其事必有異于凡人之處。

一、甲年生人
武曲天相在寅申坐命。（大富大貴）
紫微貪狼在卯酉坐命。（難富貴，縱富貴亦屬*人，須有左右或昌曲同宮方吉）
廉貞七殺在丑未坐命。（大富大貴）
武曲破軍在巳亥坐命。（難富貴）
廉貞天相在子午坐命。（大富大貴）
紫微七殺在巳亥坐命。（難大成）
武曲貪狼在丑未坐命。（可大富，須見火鈴同守方妙）
廉貞破軍在卯酉坐命。（可富，難大成）
紫微天相在辰戌坐命。（可富貴，有左右昌曲更吉）
紫微破軍在丑未坐命。（可富，難大成）
廉貞貪狼在巳亥坐命。（難有富貴，男游蕩，女淫*。亥宮主牢獄）
武曲七殺在卯酉坐命。（難大富貴。皆有殘疾，卯宮尤重。酉宮可富，難大成）
以上三方四正加會化祿、化權、化科三奇。

二、丁年生人
天機太陰在寅申坐命。（可富貴，難大成）
天梁在子午坐命。（大富大貴）
天同在辰戌坐命。（大富大貴）
天同在卯酉坐命。（大富貴）
天同太陰在子午坐命。（子宮大富貴。午宮不顯，女命淫*）
天機天梁在辰戌坐命。（可富貴）
命宮在寅或申無正曜，而對宮為巨門太陽者。（可富貴，難大成）
天同天梁在寅申坐命。（中等富貴，須風水配合可大成）
太陰在辰戌坐命。（大富大貴，見左右昌曲，生于夜晚更佳）
天機在子午坐命。（大富大貴）
命宮在丑或未無正曜，而對宮為太陰太陽者。（難大成，女命淫*）
以上三方四正加會化祿、化權、化科三奇。

丙年、辛年生人因有文昌和文曲化科，三奇加會并無固定，故不列出。乙、戊、己、庚、壬、癸年生者，并無三奇格出現，化祿、化權、化科永遠也不會在三方四正加會沖照。詩曰：“三奇拱向紫微宮，最喜人生命里逢。燮理陰陽真宰相，功名富貴不雷同”。經云：“科權祿拱，名譽昭彰”、“科權祿拱，定為折桂之高人”、“科權祿合，富貴雙全”、“化祿守命身官祿之位，科權相逢，必作大臣之職”、“化權守身命，科祿相逢，出將入相”、“化科守身命，權祿相逢，宰臣之貴”。