\ 本命夫妻宮四化
\ 夫妻宮四化飛星--化祿 

	: 夫妻宮化祿入命宮斷文 ( --- )
		  s" 夫妻緣好，感情佳。" 斷文 
		 ;
		 
	: 夫妻宮化祿入兄弟宮斷文 ( --- )
	     s" 配偶對自己的兄弟朋友態度好，會照顧兄友。" 斷文 
		; 

	: 夫妻宮自化祿斷文 ( --- )
	     s" 配偶人緣佳、個性隨和。" 斷文 
		; 

	: 夫妻宮化祿入子女宮斷文 ( --- )  
		 s" 與子女有緣、對子女好。" 斷文 
		; 

	: 夫妻宮化祿入財帛宮斷文 ( --- )         
		 s" 夫妻感情佳，且對自己之錢財有幫助。" 斷文 
		; 

	: 夫妻宮化祿入疾厄宮斷文 ( --- )                        
		 s" 夫妻感情佳，關心你的身體，有愛心。" 斷文 
		 ; 

	: 夫妻宮化祿入遷移宮斷文 ( --- )            
		 s"  夫妻緣早，感情佳，幫助賺錢。" 斷文 
		 ; 

	: 夫妻宮化祿入僕役宮斷文 ( --- )           
		 s" 配偶對自己的兄弟朋友態度好，會照顧兄友。" 斷文 
		 ; 

	: 夫妻宮化祿入官祿宮斷文 ( --- )
		  s" 配偶對事業有幫助，且配偶在外人緣佳。" 斷文 
		 ; 

	: 夫妻宮化祿入田宅宮斷文 ( --- )
		  s" 配偶與朋友佳，且夫妻感情好，生活美滿。" 斷文 
		 ; 

	: 夫妻宮化祿入福德宮斷文 ( --- )
		  s" 配偶自己有事業，能幫助錢財、能享受。" 斷文 
		 ; 

	: 夫妻宮化祿入父母宮斷文 ( --- )
		  s" 配偶與父母緣佳，相處融冾。" 斷文 
		 ; 

\ 夫妻宮四化飛星--化權 

	: 夫妻宮化權入命宮斷文 ( --- )
		  s" 夫妻緣好，但意見多。" 斷文 
		 ; 

	: 夫妻宮化權入兄弟宮斷文 ( --- )
		  s" 配偶對自己的兄弟朋友態度好，但也會意見較多。" 斷文 
		 ; 

	: 夫妻宮自化權斷文 ( --- )
		  s" 配偶個性強，會管對方。" 斷文 
		 ; 

	: 夫妻宮化權入子女宮斷文 ( --- )
		  s" 喜管子女及自己的兄弟，對田宅慾望高。" 斷文 
		 ; 

	: 夫妻宮化權入財帛宮斷文 ( --- )
		  s" 配偶掌財權，對自己之財能適時幫助。" 斷文 
		 ; 

	: 夫妻宮化權入疾厄宮斷文 ( --- )
		  s" 夫妻感情佳，強制性關心你的身體，桃花亦多。" 斷文 
		 ; 

	: 夫妻宮化權入遷移宮斷文 ( --- )
		  s" 較會管，常在外交際應酬。" 斷文 
		 ; 

	: 夫妻宮化權入僕役宮斷文 ( --- )
		  s" 配偶對自己的兄弟朋友態度好，但意見多。" 斷文 
		 ; 

	: 夫妻宮化權入官祿宮斷文 ( --- )
		  s" 配偶在外掌權，以免得罪人。且自己掌經營權。" 斷文 
		 ; 

	: 夫妻宮化權入田宅宮斷文 ( --- )
		  s" 配偶較會管他自己的朋友，且在家也欲掌權。" 斷文 
		 ; 

	: 夫妻宮化權入福德宮斷文 ( --- )
		  s" 配偶掌自己的事業權，能幫助錢財，有享受。" 斷文 
		 ; 

	: 夫妻宮化權入父母宮斷文 ( --- )
		  s" 配偶與父母意見多，但緣分佳。" 斷文 
		 ; 

\ 夫妻宮四化飛星--化科 

	: 夫妻宮化科入命宮斷文 ( --- )
		  s" 夫妻感情佳，相處融洽。" 斷文 
		 ; 

	: 夫妻宮化科入兄弟宮斷文 ( --- )
		  s" 配偶對自己的兄友隨和。" 斷文 
		 ; 

	: 夫妻宮自化科斷文 ( --- )
		  s"  配偶人緣佳，好面子，個性隨和、家世清明。" 斷文 
		 ;

	: 夫妻宮化科入子女宮斷文 ( --- )
		  s"  對子女較有愛心。" 斷文 
		 ; 

	: 夫妻宮化科入財帛宮斷文 ( --- )
		  s" 夫妻感情佳，沒錢時還會幫你調度。" 斷文 
		 ; 

	: 夫妻宮化科入疾厄宮斷文 ( --- )
		  s" 夫妻感情佳，有愛心，關心身體。" 斷文 
		 ; 

	: 夫妻宮化科入遷移宮斷文 ( --- )
		  s" 配偶為貴人幫手，使在外較平順。" 斷文 
		 ; 

	: 夫妻宮化科入僕役宮斷文 ( --- )
		  s" 配偶對自己的兄友隨和。" 斷文 
		 ; 

	: 夫妻宮化科入官祿宮斷文 ( --- )
		  s" 配偶在外人緣佳，平順、對事業有幫助。" 斷文 
		 ; 

	: 夫妻宮化科入田宅宮斷文 ( --- )
		  s" 配偶與他自己的朋友相處融洽，家庭生活美滿。" 斷文 
		 ; 

	: 夫妻宮化科入福德宮斷文 ( --- )
		  s" 配偶自己之工作平穩，量入為出。" 斷文 
		 ; 

	: 夫妻宮化科入父母宮斷文 ( --- )
		  s" 配偶與父母相處融冾，家庭環境佳。" 斷文 
		 ; 

\ 夫妻宮因化飛星--化忌 

	: 夫妻宮化忌入命宮斷文 ( --- )
		  s" 夫妻相處不融洽，多怨言。" 斷文 
		 ;

	: 夫妻宮化忌入兄弟宮斷文 ( --- )
		  s"  配偶與兄友無好印象、無緣。" 斷文 
		 ; 

	: 夫妻宮自化忌斷文 ( --- )
		  s" 夫妻緣薄，人緣不好。" 斷文 
		 ; 

	: 夫妻宮化忌入子女宮斷文 ( --- )
		  s" 配偶對子女不佳，或偏心，在家不習慣。" 斷文 
		 ; 

	: 夫妻宮化忌入財帛宮斷文 ( --- )
		  s" 夫妻因財起糾紛，且夫妻感情不好。" 斷文 
		 ; 

	: 夫妻宮化忌入疾厄宮斷文 ( --- )
		  s" 夫妻感情不佳，性生活不協調，桃花多。" 斷文 
		 ; 

	: 夫妻宮化忌入遷移宮斷文 ( --- )
		  s" 配偶在外無助，且夫妻緣薄，個性不和。" 斷文 
		 ; 

	: 夫妻宮化忌入僕役宮斷文 ( --- )
		  s" 配偶與兄友無好印象，無緣。" 斷文 
		 ; 

	: 夫妻宮化忌入官祿宮斷文 ( --- )
		  s" 配偶在外不順，對自己事業沒幫助。" 斷文 
		 ; 

	: 夫妻宮化忌入田宅宮斷文 ( --- )
		  s" 配偶與他自己的朋友相處不佳，朋友少。夫妻感情欠佳。" 斷文 
		 ; 

	: 夫妻宮化忌入福德宮斷文 ( --- )
		  s" 配偶事業不順或為家庭主婦。" 斷文 
		 ; 

	: 夫妻宮化忌入父母宮斷文 ( --- )
		 s" 配偶與父母不和，使自己精神差，且配偶吝嗇。" 斷文
		 s" 主夫妻緣薄。" 斷文
		 s" 配偶身體不好,或有開刀可能。" 斷文 
		 ;

	: 夫妻宮自化祿	   ( --- ) 夫妻宮的天干 化祿 夫妻宮的地支	= if 夫妻宮自化祿斷文			then ;
	: 夫妻宮化祿入兄弟宮 ( --- ) 夫妻宮的天干 化祿 兄弟宮的地支	= if 夫妻宮化祿入兄弟宮斷文 	then ;
	: 夫妻宮化祿入命宮 ( --- ) 夫妻宮的天干 化祿 命宮的地支	= if 夫妻宮化祿入命宮斷文 	then ;
	: 夫妻宮化祿入子女宮 ( --- ) 夫妻宮的天干 化祿 子女宮的地支 = if 夫妻宮化祿入子女宮斷文 	then ;
	: 夫妻宮化祿入財帛宮 ( --- ) 夫妻宮的天干 化祿 財帛宮的地支 = if 夫妻宮化祿入財帛宮斷文	then ;
	: 夫妻宮化祿入疾厄宮 ( --- ) 夫妻宮的天干 化祿 疾厄宮的地支 = if 夫妻宮化祿入疾厄宮斷文	then ;
	: 夫妻宮化祿入遷移宮 ( --- ) 夫妻宮的天干 化祿 遷移宮的地支 = if 夫妻宮化祿入遷移宮斷文	then ;
	: 夫妻宮化祿入僕役宮 ( --- ) 夫妻宮的天干 化祿 僕役宮的地支 = if 夫妻宮化祿入僕役宮斷文 	then ;
	: 夫妻宮化祿入官祿宮 ( --- ) 夫妻宮的天干 化祿 官祿宮的地支 = if 夫妻宮化祿入官祿宮斷文 	then ;
	: 夫妻宮化祿入田宅宮 ( --- ) 夫妻宮的天干 化祿 田宅宮的地支 = if 夫妻宮化祿入田宅宮斷文 	then ;
	: 夫妻宮化祿入福德宮 ( --- ) 夫妻宮的天干 化祿 福德宮的地支 = if 夫妻宮化祿入福德宮斷文 	then ;
	: 夫妻宮化祿入父母宮 ( --- ) 夫妻宮的天干 化祿 父母宮的地支 = if 夫妻宮化祿入父母宮斷文 	then ;

	: 夫妻宮自化權	   ( --- ) 夫妻宮的天干 化權 夫妻宮的地支	= if 夫妻宮自化權斷文			then ;
	: 夫妻宮化權入兄弟宮 ( --- ) 夫妻宮的天干 化權 兄弟宮的地支	= if 夫妻宮化權入兄弟宮斷文 	then ;
	: 夫妻宮化權入命宮 ( --- ) 夫妻宮的天干 化權 命宮的地支	= if 夫妻宮化權入命宮斷文 	then ;
	: 夫妻宮化權入子女宮 ( --- ) 夫妻宮的天干 化權 子女宮的地支 = if 夫妻宮化權入子女宮斷文 	then ;
	: 夫妻宮化權入財帛宮 ( --- ) 夫妻宮的天干 化權 財帛宮的地支 = if 夫妻宮化權入財帛宮斷文	then ;
	: 夫妻宮化權入疾厄宮 ( --- ) 夫妻宮的天干 化權 疾厄宮的地支 = if 夫妻宮化權入疾厄宮斷文	then ;
	: 夫妻宮化權入遷移宮 ( --- ) 夫妻宮的天干 化權 遷移宮的地支 = if 夫妻宮化權入遷移宮斷文	then ;
	: 夫妻宮化權入僕役宮 ( --- ) 夫妻宮的天干 化權 僕役宮的地支 = if 夫妻宮化權入僕役宮斷文 	then ;
	: 夫妻宮化權入官祿宮 ( --- ) 夫妻宮的天干 化權 官祿宮的地支 = if 夫妻宮化權入官祿宮斷文 	then ;
	: 夫妻宮化權入田宅宮 ( --- ) 夫妻宮的天干 化權 田宅宮的地支 = if 夫妻宮化權入田宅宮斷文 	then ;
	: 夫妻宮化權入福德宮 ( --- ) 夫妻宮的天干 化權 福德宮的地支 = if 夫妻宮化權入福德宮斷文 	then ;
	: 夫妻宮化權入父母宮 ( --- ) 夫妻宮的天干 化權 父母宮的地支 = if 夫妻宮化權入父母宮斷文 	then ;

	: 夫妻宮自化科	   ( --- ) 夫妻宮的天干 化科 夫妻宮的地支	= if 夫妻宮自化科斷文			then ;
	: 夫妻宮化科入兄弟宮 ( --- ) 夫妻宮的天干 化科 兄弟宮的地支	= if 夫妻宮化科入兄弟宮斷文 	then ;
	: 夫妻宮化科入命宮 ( --- ) 夫妻宮的天干 化科 命宮的地支	= if 夫妻宮化科入命宮斷文 	then ;
	: 夫妻宮化科入子女宮 ( --- ) 夫妻宮的天干 化科 子女宮的地支 = if 夫妻宮化科入子女宮斷文 	then ;
	: 夫妻宮化科入財帛宮 ( --- ) 夫妻宮的天干 化科 財帛宮的地支 = if 夫妻宮化科入財帛宮斷文	then ;
	: 夫妻宮化科入疾厄宮 ( --- ) 夫妻宮的天干 化科 疾厄宮的地支 = if 夫妻宮化科入疾厄宮斷文	then ;
	: 夫妻宮化科入遷移宮 ( --- ) 夫妻宮的天干 化科 遷移宮的地支 = if 夫妻宮化科入遷移宮斷文	then ;
	: 夫妻宮化科入僕役宮 ( --- ) 夫妻宮的天干 化科 僕役宮的地支 = if 夫妻宮化科入僕役宮斷文 	then ;
	: 夫妻宮化科入官祿宮 ( --- ) 夫妻宮的天干 化科 官祿宮的地支 = if 夫妻宮化科入官祿宮斷文 	then ;
	: 夫妻宮化科入田宅宮 ( --- ) 夫妻宮的天干 化科 田宅宮的地支 = if 夫妻宮化科入田宅宮斷文 	then ;
	: 夫妻宮化科入福德宮 ( --- ) 夫妻宮的天干 化科 福德宮的地支 = if 夫妻宮化科入福德宮斷文 	then ;
	: 夫妻宮化科入父母宮 ( --- ) 夫妻宮的天干 化科 父母宮的地支 = if 夫妻宮化科入父母宮斷文 	then ;

	: 夫妻宮自化忌	   ( --- ) 夫妻宮的天干 化忌 夫妻宮的地支	= if 夫妻宮自化忌斷文			then ;
	: 夫妻宮化忌入兄弟宮 ( --- ) 夫妻宮的天干 化忌 兄弟宮的地支	= if 夫妻宮化忌入兄弟宮斷文 	then ;
	: 夫妻宮化忌入命宮 ( --- ) 夫妻宮的天干 化忌 命宮的地支	= if 夫妻宮化忌入命宮斷文 	then ;
	: 夫妻宮化忌入子女宮 ( --- ) 夫妻宮的天干 化忌 子女宮的地支 = if 夫妻宮化忌入子女宮斷文 	then ;
	: 夫妻宮化忌入財帛宮 ( --- ) 夫妻宮的天干 化忌 財帛宮的地支 = if 夫妻宮化忌入財帛宮斷文	then ;
	: 夫妻宮化忌入疾厄宮 ( --- ) 夫妻宮的天干 化忌 疾厄宮的地支 = if 夫妻宮化忌入疾厄宮斷文	then ;
	: 夫妻宮化忌入遷移宮 ( --- ) 夫妻宮的天干 化忌 遷移宮的地支 = if 夫妻宮化忌入遷移宮斷文	then ;
	: 夫妻宮化忌入僕役宮 ( --- ) 夫妻宮的天干 化忌 僕役宮的地支 = if 夫妻宮化忌入僕役宮斷文 	then ;
	: 夫妻宮化忌入官祿宮 ( --- ) 夫妻宮的天干 化忌 官祿宮的地支 = if 夫妻宮化忌入官祿宮斷文 	then ;
	: 夫妻宮化忌入田宅宮 ( --- ) 夫妻宮的天干 化忌 田宅宮的地支 = if 夫妻宮化忌入田宅宮斷文 	then ;
	: 夫妻宮化忌入福德宮 ( --- ) 夫妻宮的天干 化忌 福德宮的地支 = if 夫妻宮化忌入福德宮斷文 	then ;
	: 夫妻宮化忌入父母宮 ( --- ) 夫妻宮的天干 化忌 父母宮的地支 = if 夫妻宮化忌入父母宮斷文 	then ;
		 
	: 夫妻宮四化 ( --- )
		夫妻宮化祿入疾厄宮
		夫妻宮化祿入兄弟宮
		夫妻宮化祿入命宮
		夫妻宮化祿入子女宮
		夫妻宮化祿入財帛宮
		夫妻宮自化祿
		夫妻宮化祿入遷移宮
		夫妻宮化祿入僕役宮
		夫妻宮化祿入官祿宮
		夫妻宮化祿入田宅宮
		夫妻宮化祿入福德宮
		夫妻宮化祿入父母宮
		
		夫妻宮化權入疾厄宮
		夫妻宮化權入兄弟宮
		夫妻宮化權入命宮
		夫妻宮化權入子女宮
		夫妻宮化權入財帛宮
		夫妻宮自化權
		夫妻宮化權入遷移宮
		夫妻宮化權入僕役宮
		夫妻宮化權入官祿宮
		夫妻宮化權入田宅宮
		夫妻宮化權入福德宮
		夫妻宮化權入父母宮
		
		夫妻宮化科入疾厄宮
		夫妻宮化科入兄弟宮
		夫妻宮化科入命宮
		夫妻宮化科入子女宮
		夫妻宮化科入財帛宮
		夫妻宮自化科
		夫妻宮化科入遷移宮
		夫妻宮化科入僕役宮
		夫妻宮化科入官祿宮
		夫妻宮化科入田宅宮
		夫妻宮化科入福德宮
		夫妻宮化科入父母宮
		
		夫妻宮化忌入疾厄宮
		夫妻宮化忌入兄弟宮
		夫妻宮化忌入命宮
		夫妻宮化忌入子女宮
		夫妻宮化忌入財帛宮
		夫妻宮自化忌
		夫妻宮化忌入遷移宮
		夫妻宮化忌入僕役宮
		夫妻宮化忌入官祿宮
		夫妻宮化忌入田宅宮
		夫妻宮化忌入福德宮
		夫妻宮化忌入父母宮
		;		 
