\ 本命田宅宮四化
\ 田宅宮四化飛星--化祿 

	: 田宅宮化祿入命宮斷文 ( --- ) 
		  s" " 斷文 
		 ;
		 
	: 田宅宮化祿入兄弟宮斷文 ( --- )
	     s" " 斷文 
		; 

	: 田宅宮化祿入夫妻宮斷文 ( --- )
	     s" " 斷文 
		; 

	: 田宅宮化祿入子女宮斷文 ( --- )     
		 s" " 斷文 
		; 

	: 田宅宮化祿入財帛宮斷文 ( --- )           
		 s" " 斷文 
		; 

	: 田宅宮化祿入疾厄宮斷文 ( --- )                      
		 s"  " 斷文 
		 ; 

	: 田宅宮化祿入遷移宮斷文 ( --- )           
		 s"  " 斷文 
		 ; 

	: 田宅宮化祿入僕役宮斷文 ( --- )            
		 s" " 斷文 
		 ; 

	: 田宅宮化祿入官祿宮斷文 ( --- )
		  s"  " 斷文 
		 ; 

	: 田宅宮自化祿斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化祿入福德宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化祿入父母宮斷文 ( --- )
		  s" " 斷文 
		 ; 

\ 田宅宮四化飛星--化權 

	: 田宅宮化權入命宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化權入兄弟宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化權入夫妻宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化權入子女宮斷文 ( --- )
		  s" 主" 斷文 
		 ; 

	: 田宅宮化權入財帛宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化權入疾厄宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化權入遷移宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化權入僕役宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化權入官祿宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮自化權斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化權入福德宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化權入父母宮斷文 ( --- )
		  s" " 斷文 
		 ; 

\ 田宅宮四化飛星--化科 

	: 田宅宮化科入命宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化科入兄弟宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化科入夫妻宮斷文 ( --- )
		  s"  " 斷文 
		 ;

	: 田宅宮化科入子女宮斷文 ( --- )
		  s"  " 斷文 
		 ; 

	: 田宅宮化科入財帛宮斷文 ( --- )
		  s"  " 斷文 
		 ; 

	: 田宅宮化科入疾厄宮斷文 ( --- )
		  s"  " 斷文 
		 ; 

	: 田宅宮化科入遷移宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化科入僕役宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化科入官祿宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮自化科斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化科入福德宮斷文 ( --- )
		  s"  " 斷文 
		 ; 

	: 田宅宮化科入父母宮斷文 ( --- )
		  s" " 斷文 
		 ; 

\ 田宅宮因化飛星--化忌 

	: 田宅宮化忌入命宮斷文 ( --- )
		  s" " 斷文 
		 ;

	: 田宅宮化忌入兄弟宮斷文 ( --- )
		  s"  " 斷文 
		 ; 

	: 田宅宮化忌入夫妻宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化忌入子女宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化忌入財帛宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化忌入疾厄宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化忌入遷移宮斷文 ( --- )
		  s" 主變動會搬家，財產靠自己掙。" 斷文 
		 ; 

	: 田宅宮化忌入僕役宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化忌入官祿宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮自化忌斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化忌入福德宮斷文 ( --- )
		  s" " 斷文 
		 ; 

	: 田宅宮化忌入父母宮斷文 ( --- )
		  s" 破財" 斷文
		 	s" 破產" 斷文
		 	s" 庫破" 斷文
		 ;

	: 田宅宮自化祿	   ( --- ) 田宅宮的天干 化祿 田宅宮的地支	= if 田宅宮自化祿斷文			then ;
	: 田宅宮化祿入兄弟宮 ( --- ) 田宅宮的天干 化祿 兄弟宮的地支	= if 田宅宮化祿入兄弟宮斷文 	then ;
	: 田宅宮化祿入夫妻宮 ( --- ) 田宅宮的天干 化祿 田宅宮的地支	= if 田宅宮化祿入夫妻宮斷文 	then ;
	: 田宅宮化祿入子女宮 ( --- ) 田宅宮的天干 化祿 子女宮的地支 = if 田宅宮化祿入子女宮斷文 	then ;
	: 田宅宮化祿入財帛宮 ( --- ) 田宅宮的天干 化祿 財帛宮的地支 = if 田宅宮化祿入財帛宮斷文	then ;
	: 田宅宮化祿入疾厄宮 ( --- ) 田宅宮的天干 化祿 疾厄宮的地支 = if 田宅宮化祿入疾厄宮斷文	then ;
	: 田宅宮化祿入遷移宮 ( --- ) 田宅宮的天干 化祿 遷移宮的地支 = if 田宅宮化祿入遷移宮斷文	then ;
	: 田宅宮化祿入僕役宮 ( --- ) 田宅宮的天干 化祿 僕役宮的地支 = if 田宅宮化祿入僕役宮斷文 	then ;
	: 田宅宮化祿入官祿宮 ( --- ) 田宅宮的天干 化祿 官祿宮的地支 = if 田宅宮化祿入官祿宮斷文 	then ;
	: 田宅宮化祿入命宮 ( --- ) 田宅宮的天干 化祿 命宮的地支 = if 田宅宮化祿入命宮斷文 	then ;
	: 田宅宮化祿入福德宮 ( --- ) 田宅宮的天干 化祿 福德宮的地支 = if 田宅宮化祿入福德宮斷文 	then ;
	: 田宅宮化祿入父母宮 ( --- ) 田宅宮的天干 化祿 父母宮的地支 = if 田宅宮化祿入父母宮斷文 	then ;

	: 田宅宮自化權	   ( --- ) 田宅宮的天干 化權 田宅宮的地支	= if 田宅宮自化權斷文			then ;
	: 田宅宮化權入兄弟宮 ( --- ) 田宅宮的天干 化權 兄弟宮的地支	= if 田宅宮化權入兄弟宮斷文 	then ;
	: 田宅宮化權入夫妻宮 ( --- ) 田宅宮的天干 化權 田宅宮的地支	= if 田宅宮化權入夫妻宮斷文 	then ;
	: 田宅宮化權入子女宮 ( --- ) 田宅宮的天干 化權 子女宮的地支 = if 田宅宮化權入子女宮斷文 	then ;
	: 田宅宮化權入財帛宮 ( --- ) 田宅宮的天干 化權 財帛宮的地支 = if 田宅宮化權入財帛宮斷文	then ;
	: 田宅宮化權入疾厄宮 ( --- ) 田宅宮的天干 化權 疾厄宮的地支 = if 田宅宮化權入疾厄宮斷文	then ;
	: 田宅宮化權入遷移宮 ( --- ) 田宅宮的天干 化權 遷移宮的地支 = if 田宅宮化權入遷移宮斷文	then ;
	: 田宅宮化權入僕役宮 ( --- ) 田宅宮的天干 化權 僕役宮的地支 = if 田宅宮化權入僕役宮斷文 	then ;
	: 田宅宮化權入官祿宮 ( --- ) 田宅宮的天干 化權 官祿宮的地支 = if 田宅宮化權入官祿宮斷文 	then ;
	: 田宅宮化權入命宮 ( --- ) 田宅宮的天干 化權 命宮的地支 = if 田宅宮化權入命宮斷文 	then ;
	: 田宅宮化權入福德宮 ( --- ) 田宅宮的天干 化權 福德宮的地支 = if 田宅宮化權入福德宮斷文 	then ;
	: 田宅宮化權入父母宮 ( --- ) 田宅宮的天干 化權 父母宮的地支 = if 田宅宮化權入父母宮斷文 	then ;

	: 田宅宮自化科	   ( --- ) 田宅宮的天干 化科 田宅宮的地支	= if 田宅宮自化科斷文			then ;
	: 田宅宮化科入兄弟宮 ( --- ) 田宅宮的天干 化科 兄弟宮的地支	= if 田宅宮化科入兄弟宮斷文 	then ;
	: 田宅宮化科入夫妻宮 ( --- ) 田宅宮的天干 化科 田宅宮的地支	= if 田宅宮化科入夫妻宮斷文 	then ;
	: 田宅宮化科入子女宮 ( --- ) 田宅宮的天干 化科 子女宮的地支 = if 田宅宮化科入子女宮斷文 	then ;
	: 田宅宮化科入財帛宮 ( --- ) 田宅宮的天干 化科 財帛宮的地支 = if 田宅宮化科入財帛宮斷文	then ;
	: 田宅宮化科入疾厄宮 ( --- ) 田宅宮的天干 化科 疾厄宮的地支 = if 田宅宮化科入疾厄宮斷文	then ;
	: 田宅宮化科入遷移宮 ( --- ) 田宅宮的天干 化科 遷移宮的地支 = if 田宅宮化科入遷移宮斷文	then ;
	: 田宅宮化科入僕役宮 ( --- ) 田宅宮的天干 化科 僕役宮的地支 = if 田宅宮化科入僕役宮斷文 	then ;
	: 田宅宮化科入官祿宮 ( --- ) 田宅宮的天干 化科 官祿宮的地支 = if 田宅宮化科入官祿宮斷文 	then ;
	: 田宅宮化科入命宮 ( --- ) 田宅宮的天干 化科 命宮的地支 = if 田宅宮化科入命宮斷文 	then ;
	: 田宅宮化科入福德宮 ( --- ) 田宅宮的天干 化科 福德宮的地支 = if 田宅宮化科入福德宮斷文 	then ;
	: 田宅宮化科入父母宮 ( --- ) 田宅宮的天干 化科 父母宮的地支 = if 田宅宮化科入父母宮斷文 	then ;

	: 田宅宮自化忌	   ( --- ) 田宅宮的天干 化忌 田宅宮的地支	= if 田宅宮自化忌斷文			then ;
	: 田宅宮化忌入兄弟宮 ( --- ) 田宅宮的天干 化忌 兄弟宮的地支	= if 田宅宮化忌入兄弟宮斷文 	then ;
	: 田宅宮化忌入夫妻宮 ( --- ) 田宅宮的天干 化忌 田宅宮的地支	= if 田宅宮化忌入夫妻宮斷文 	then ;
	: 田宅宮化忌入子女宮 ( --- ) 田宅宮的天干 化忌 子女宮的地支 = if 田宅宮化忌入子女宮斷文 	then ;
	: 田宅宮化忌入財帛宮 ( --- ) 田宅宮的天干 化忌 財帛宮的地支 = if 田宅宮化忌入財帛宮斷文	then ;
	: 田宅宮化忌入疾厄宮 ( --- ) 田宅宮的天干 化忌 疾厄宮的地支 = if 田宅宮化忌入疾厄宮斷文	then ;
	: 田宅宮化忌入遷移宮 ( --- ) 田宅宮的天干 化忌 遷移宮的地支 = if 田宅宮化忌入遷移宮斷文	then ;
	: 田宅宮化忌入僕役宮 ( --- ) 田宅宮的天干 化忌 僕役宮的地支 = if 田宅宮化忌入僕役宮斷文 	then ;
	: 田宅宮化忌入官祿宮 ( --- ) 田宅宮的天干 化忌 官祿宮的地支 = if 田宅宮化忌入官祿宮斷文 	then ;
	: 田宅宮化忌入命宮 ( --- ) 田宅宮的天干 化忌 命宮的地支 = if 田宅宮化忌入命宮斷文 	then ;
	: 田宅宮化忌入福德宮 ( --- ) 田宅宮的天干 化忌 福德宮的地支 = if 田宅宮化忌入福德宮斷文 	then ;
	: 田宅宮化忌入父母宮 ( --- ) 田宅宮的天干 化忌 父母宮的地支 = if 田宅宮化忌入父母宮斷文 	then ;		 
		 
	: 田宅宮四化 ( --- )
		田宅宮化祿入疾厄宮
		田宅宮化祿入兄弟宮
		田宅宮化祿入夫妻宮
		田宅宮化祿入子女宮
		田宅宮化祿入財帛宮
		田宅宮自化祿
		田宅宮化祿入遷移宮
		田宅宮化祿入僕役宮
		田宅宮化祿入官祿宮
		田宅宮化祿入命宮
		田宅宮化祿入福德宮
		田宅宮化祿入父母宮
		
		田宅宮化權入疾厄宮
		田宅宮化權入兄弟宮
		田宅宮化權入夫妻宮
		田宅宮化權入子女宮
		田宅宮化權入財帛宮
		田宅宮自化權
		田宅宮化權入遷移宮
		田宅宮化權入僕役宮
		田宅宮化權入官祿宮
		田宅宮化權入命宮
		田宅宮化權入福德宮
		田宅宮化權入父母宮
		
		田宅宮化科入疾厄宮
		田宅宮化科入兄弟宮
		田宅宮化科入夫妻宮
		田宅宮化科入子女宮
		田宅宮化科入財帛宮
		田宅宮自化科
		田宅宮化科入遷移宮
		田宅宮化科入僕役宮
		田宅宮化科入官祿宮
		田宅宮化科入命宮
		田宅宮化科入福德宮
		田宅宮化科入父母宮
		
		田宅宮化忌入疾厄宮
		田宅宮化忌入兄弟宮
		田宅宮化忌入夫妻宮
		田宅宮化忌入子女宮
		田宅宮化忌入財帛宮
		田宅宮自化忌
		田宅宮化忌入遷移宮
		田宅宮化忌入僕役宮
		田宅宮化忌入官祿宮
		田宅宮化忌入命宮
		田宅宮化忌入福德宮
		田宅宮化忌入父母宮
		;