\ 本命官祿宮四化
\ 官祿宮四化飛星--化祿 

	: 官祿宮化祿入命宮斷文 ( --- )
		  s" 靠自己能力賺錢，事業做得較平順。" 斷文 
		 ;
		 
	: 官祿宮化祿入兄弟宮斷文 ( --- )
	     s" 事業靠兄弟幫忙，合夥事業賺錢。" 斷文 
		; 

	: 官祿宮化祿入夫妻宮斷文 ( --- )
	     s" 事業能得到配偶的幫助，且平順賺錢。" 斷文 
		; 

	: 官祿宮化祿入子女宮斷文 ( --- )   
		 s" 可經營合夥事業，適合娛樂事業。" 斷文 
		; 

	: 官祿宮化祿入財帛宮斷文 ( --- )           
		 s" 賺了錢再投資、資金足。" 斷文 
		; 

	: 官祿宮化祿入疾厄宮斷文 ( --- )                        
		 s"  工作較輕鬆、愉快。" 斷文 
		 ; 

	: 官祿宮化祿入遷移宮斷文 ( --- )            
		 s"  在外有貴人，事業在外得意。" 斷文 
		 ; 

	: 官祿宮化祿入僕役宮斷文 ( --- )            
		 s" 同事相處融洽，與朋友合資事業賺錢。" 斷文 
		 ; 

	: 官祿宮自化祿斷文 ( --- )
		  s" 有創業力，自己賺錢自己花。" 斷文 
		 ; 

	: 官祿宮化祿入田宅宮斷文 ( --- )
		  s" 經營不動產生意。" 斷文 
		 ; 

	: 官祿宮化祿入福德宮斷文 ( --- )
		  s" 事業會賺錢，也能享受。" 斷文 
		 ; 

	: 官祿宮化祿入父母宮斷文 ( --- )
		  s" 事業能得父母支持，任職較高位。" 斷文 
		 ; 

\ 官祿宮四化飛星--化權 

	: 官祿宮化權入命宮斷文 ( --- )
		  s" 為事業忙碌，自掌權，創業力強。" 斷文 
		 ; 

	: 官祿宮化權入兄弟宮斷文 ( --- )
		  s" 合夥投資賺錢，經營權在兄弟手中。" 斷文 
		 ; 

	: 官祿宮化權入夫妻宮斷文 ( --- )
		  s" 事業因配偶之助賺錢，經營權在配偶手中。" 斷文 
		 ; 

	: 官祿宮化權入子女宮斷文 ( --- )
		  s" 賺錢慾望大。" 斷文 
		 ; 

	: 官祿宮化權入財帛宮斷文 ( --- )
		  s" 賺錢慾望大，再投資。" 斷文 
		 ; 

	: 官祿宮化權入疾厄宮斷文 ( --- )
		  s" 責任感重，較勞心。" 斷文 
		 ; 

	: 官祿宮化權入遷移宮斷文 ( --- )
		  s" 在外事業得意，賺錢機會多。" 斷文 
		 ; 

	: 官祿宮化權入僕役宮斷文 ( --- )
		  s" 朋友掌事業經營權，投資事業賺錢。" 斷文 
		 ; 

	: 官祿宮自化權斷文 ( --- )
		  s" 對事業較有創業能力，事業心重。" 斷文 
		 ; 

	: 官祿宮化權入田宅宮斷文 ( --- )
		  s" 營不動產生意，但慾望高。" 斷文 
		 ; 

	: 官祿宮化權入福德宮斷文 ( --- )
		  s" 事業賺錢，且排場大。" 斷文 
		 ; 

	: 官祿宮化權入父母宮斷文 ( --- )
		  s" 事業能得父母長輩支持，權在長輩手中。" 斷文 
		 ; 

\ 官祿宮四化飛星--化科 

	: 官祿宮化科入命宮斷文 ( --- )
		  s" 事業平順，適合任職上下班為宜。" 斷文 
		 ; 

	: 官祿宮化科入兄弟宮斷文 ( --- )
		  s" 合夥投資事業平順，彼此無意見，無口舌之爭。" 斷文 
		 ; 

	: 官祿宮化科入夫妻宮斷文 ( --- )
		  s"  事業平穩，配偶希望不要因事業太勞累。" 斷文 
		 ;

	: 官祿宮化科入子女宮斷文 ( --- )
		  s"  投資事業平順。" 斷文 
		 ; 

	: 官祿宮化科入財帛宮斷文 ( --- )
		  s"  賺錢平順,風波小。" 斷文 
		 ; 

	: 官祿宮化科入疾厄宮斷文 ( --- )
		  s"  工作輕鬆，看得平淡。" 斷文 
		 ; 

	: 官祿宮化科入遷移宮斷文 ( --- )
		  s" 事業在外有貴人相助，平順。" 斷文 
		 ; 

	: 官祿宮化科入僕役宮斷文 ( --- )
		  s" 與同事相處融洽，事業平順。" 斷文 
		 ; 

	: 官祿宮自化科斷文 ( --- )
		  s" 事業較平順。" 斷文 
		 ; 

	: 官祿宮化科入田宅宮斷文 ( --- )
		  s" 經營不動產生意平穩。" 斷文 
		 ; 

	: 官祿宮化科入福德宮斷文 ( --- )
		  s"  財平穩，無大風波。" 斷文 
		 ; 

	: 官祿宮化科入父母宮斷文 ( --- )
		  s" 父母長輩為事業上的貴人，任職則平順。" 斷文 
		 ; 

\ 官祿宮因化飛星--化忌 

	: 官祿宮化忌入命宮斷文 ( --- )
		  s" 事業不順,勞心勞力，常想換工作、變動工作。" 斷文 
		 ;

	: 官祿宮化忌入兄弟宮斷文 ( --- )
		  s"  投資事業不順，彼此較多意見紛爭。" 斷文 
		 ; 

	: 官祿宮化忌入夫妻宮斷文 ( --- )
		  s" 配偶在事業上幫不上忙。事業變化大。" 斷文 
		 ; 

	: 官祿宮化忌入子女宮斷文 ( --- )
		  s" 事業變化大，合夥不利。" 斷文 
		 ; 

	: 官祿宮化忌入財帛宮斷文 ( --- )
		  s" 賺錢較難，投資回收慢，資金不足。" 斷文 
		 ; 

	: 官祿宮化忌入疾厄宮斷文 ( --- )
		  s" 責任感重，但較勞碌，且事業不順。" 斷文 
		 ; 

	: 官祿宮化忌入遷移宮斷文 ( --- )
		  s" 在外工作常變動或不順。" 斷文 
		 ; 

	: 官祿宮化忌入僕役宮斷文 ( --- )
		  s" 因事業關係，讓朋友操心。" 斷文 
		 ; 

	: 官祿宮自化忌斷文 ( --- )
		  s" 事業較不順，賺錢較難。" 斷文 
		 ; 

	: 官祿宮化忌入田宅宮斷文 ( --- )
		  s" 經營不動產，但賺得少。且較勞碌。" 斷文 
		 ; 

	: 官祿宮化忌入福德宮斷文 ( --- )
		  s" 事業經營不善、破財、福澤差。" 斷文 
		 ; 

	: 官祿宮化忌入父母宮斷文 ( --- )
		  s" 事業得不到長輩之助。" 斷文
		 	s" 生意大敗。" 斷文
		 	s" 一敗塗地。" 斷文		 	
		 	s" 公司倒了。" 斷文
		 ;

	: 官祿宮自化祿	   ( --- ) 官祿宮的天干 化祿 官祿宮的地支	= if 官祿宮自化祿斷文			then ;
	: 官祿宮化祿入兄弟宮 ( --- ) 官祿宮的天干 化祿 兄弟宮的地支	= if 官祿宮化祿入兄弟宮斷文 	then ;
	: 官祿宮化祿入夫妻宮 ( --- ) 官祿宮的天干 化祿 官祿宮的地支	= if 官祿宮化祿入夫妻宮斷文 	then ;
	: 官祿宮化祿入子女宮 ( --- ) 官祿宮的天干 化祿 子女宮的地支 = if 官祿宮化祿入子女宮斷文 	then ;
	: 官祿宮化祿入財帛宮 ( --- ) 官祿宮的天干 化祿 財帛宮的地支 = if 官祿宮化祿入財帛宮斷文	then ;
	: 官祿宮化祿入疾厄宮 ( --- ) 官祿宮的天干 化祿 疾厄宮的地支 = if 官祿宮化祿入疾厄宮斷文	then ;
	: 官祿宮化祿入遷移宮 ( --- ) 官祿宮的天干 化祿 遷移宮的地支 = if 官祿宮化祿入遷移宮斷文	then ;
	: 官祿宮化祿入僕役宮 ( --- ) 官祿宮的天干 化祿 僕役宮的地支 = if 官祿宮化祿入僕役宮斷文 	then ;
	: 官祿宮化祿入命宮 ( --- ) 官祿宮的天干 化祿 命宮的地支 = if 官祿宮化祿入命宮斷文 	then ;
	: 官祿宮化祿入田宅宮 ( --- ) 官祿宮的天干 化祿 田宅宮的地支 = if 官祿宮化祿入田宅宮斷文 	then ;
	: 官祿宮化祿入福德宮 ( --- ) 官祿宮的天干 化祿 福德宮的地支 = if 官祿宮化祿入福德宮斷文 	then ;
	: 官祿宮化祿入父母宮 ( --- ) 官祿宮的天干 化祿 父母宮的地支 = if 官祿宮化祿入父母宮斷文 	then ;

	: 官祿宮自化權	   ( --- ) 官祿宮的天干 化權 官祿宮的地支	= if 官祿宮自化權斷文			then ;
	: 官祿宮化權入兄弟宮 ( --- ) 官祿宮的天干 化權 兄弟宮的地支	= if 官祿宮化權入兄弟宮斷文 	then ;
	: 官祿宮化權入夫妻宮 ( --- ) 官祿宮的天干 化權 官祿宮的地支	= if 官祿宮化權入夫妻宮斷文 	then ;
	: 官祿宮化權入子女宮 ( --- ) 官祿宮的天干 化權 子女宮的地支 = if 官祿宮化權入子女宮斷文 	then ;
	: 官祿宮化權入財帛宮 ( --- ) 官祿宮的天干 化權 財帛宮的地支 = if 官祿宮化權入財帛宮斷文	then ;
	: 官祿宮化權入疾厄宮 ( --- ) 官祿宮的天干 化權 疾厄宮的地支 = if 官祿宮化權入疾厄宮斷文	then ;
	: 官祿宮化權入遷移宮 ( --- ) 官祿宮的天干 化權 遷移宮的地支 = if 官祿宮化權入遷移宮斷文	then ;
	: 官祿宮化權入僕役宮 ( --- ) 官祿宮的天干 化權 僕役宮的地支 = if 官祿宮化權入僕役宮斷文 	then ;
	: 官祿宮化權入命宮 ( --- ) 官祿宮的天干 化權 命宮的地支 = if 官祿宮化權入命宮斷文 	then ;
	: 官祿宮化權入田宅宮 ( --- ) 官祿宮的天干 化權 田宅宮的地支 = if 官祿宮化權入田宅宮斷文 	then ;
	: 官祿宮化權入福德宮 ( --- ) 官祿宮的天干 化權 福德宮的地支 = if 官祿宮化權入福德宮斷文 	then ;
	: 官祿宮化權入父母宮 ( --- ) 官祿宮的天干 化權 父母宮的地支 = if 官祿宮化權入父母宮斷文 	then ;

	: 官祿宮自化科	   ( --- ) 官祿宮的天干 化科 官祿宮的地支	= if 官祿宮自化科斷文			then ;
	: 官祿宮化科入兄弟宮 ( --- ) 官祿宮的天干 化科 兄弟宮的地支	= if 官祿宮化科入兄弟宮斷文 	then ;
	: 官祿宮化科入夫妻宮 ( --- ) 官祿宮的天干 化科 官祿宮的地支	= if 官祿宮化科入夫妻宮斷文 	then ;
	: 官祿宮化科入子女宮 ( --- ) 官祿宮的天干 化科 子女宮的地支 = if 官祿宮化科入子女宮斷文 	then ;
	: 官祿宮化科入財帛宮 ( --- ) 官祿宮的天干 化科 財帛宮的地支 = if 官祿宮化科入財帛宮斷文	then ;
	: 官祿宮化科入疾厄宮 ( --- ) 官祿宮的天干 化科 疾厄宮的地支 = if 官祿宮化科入疾厄宮斷文	then ;
	: 官祿宮化科入遷移宮 ( --- ) 官祿宮的天干 化科 遷移宮的地支 = if 官祿宮化科入遷移宮斷文	then ;
	: 官祿宮化科入僕役宮 ( --- ) 官祿宮的天干 化科 僕役宮的地支 = if 官祿宮化科入僕役宮斷文 	then ;
	: 官祿宮化科入命宮 ( --- ) 官祿宮的天干 化科 命宮的地支 = if 官祿宮化科入命宮斷文 	then ;
	: 官祿宮化科入田宅宮 ( --- ) 官祿宮的天干 化科 田宅宮的地支 = if 官祿宮化科入田宅宮斷文 	then ;
	: 官祿宮化科入福德宮 ( --- ) 官祿宮的天干 化科 福德宮的地支 = if 官祿宮化科入福德宮斷文 	then ;
	: 官祿宮化科入父母宮 ( --- ) 官祿宮的天干 化科 父母宮的地支 = if 官祿宮化科入父母宮斷文 	then ;

	: 官祿宮自化忌	   ( --- ) 官祿宮的天干 化忌 官祿宮的地支	= if 官祿宮自化忌斷文			then ;
	: 官祿宮化忌入兄弟宮 ( --- ) 官祿宮的天干 化忌 兄弟宮的地支	= if 官祿宮化忌入兄弟宮斷文 	then ;
	: 官祿宮化忌入夫妻宮 ( --- ) 官祿宮的天干 化忌 官祿宮的地支	= if 官祿宮化忌入夫妻宮斷文 	then ;
	: 官祿宮化忌入子女宮 ( --- ) 官祿宮的天干 化忌 子女宮的地支 = if 官祿宮化忌入子女宮斷文 	then ;
	: 官祿宮化忌入財帛宮 ( --- ) 官祿宮的天干 化忌 財帛宮的地支 = if 官祿宮化忌入財帛宮斷文	then ;
	: 官祿宮化忌入疾厄宮 ( --- ) 官祿宮的天干 化忌 疾厄宮的地支 = if 官祿宮化忌入疾厄宮斷文	then ;
	: 官祿宮化忌入遷移宮 ( --- ) 官祿宮的天干 化忌 遷移宮的地支 = if 官祿宮化忌入遷移宮斷文	then ;
	: 官祿宮化忌入僕役宮 ( --- ) 官祿宮的天干 化忌 僕役宮的地支 = if 官祿宮化忌入僕役宮斷文 	then ;
	: 官祿宮化忌入命宮 ( --- ) 官祿宮的天干 化忌 命宮的地支 = if 官祿宮化忌入命宮斷文 	then ;
	: 官祿宮化忌入田宅宮 ( --- ) 官祿宮的天干 化忌 田宅宮的地支 = if 官祿宮化忌入田宅宮斷文 	then ;
	: 官祿宮化忌入福德宮 ( --- ) 官祿宮的天干 化忌 福德宮的地支 = if 官祿宮化忌入福德宮斷文 	then ;
	: 官祿宮化忌入父母宮 ( --- ) 官祿宮的天干 化忌 父母宮的地支 = if 官祿宮化忌入父母宮斷文 	then ;

	: 官祿宮四化 ( --- )
		官祿宮化祿入疾厄宮
		官祿宮化祿入兄弟宮
		官祿宮化祿入夫妻宮
		官祿宮化祿入子女宮
		官祿宮化祿入財帛宮
		官祿宮自化祿
		官祿宮化祿入遷移宮
		官祿宮化祿入僕役宮
		官祿宮化祿入命宮
		官祿宮化祿入田宅宮
		官祿宮化祿入福德宮
		官祿宮化祿入父母宮
		
		官祿宮化權入疾厄宮
		官祿宮化權入兄弟宮
		官祿宮化權入夫妻宮
		官祿宮化權入子女宮
		官祿宮化權入財帛宮
		官祿宮自化權
		官祿宮化權入遷移宮
		官祿宮化權入僕役宮
		官祿宮化權入命宮
		官祿宮化權入田宅宮
		官祿宮化權入福德宮
		官祿宮化權入父母宮
		
		官祿宮化科入疾厄宮
		官祿宮化科入兄弟宮
		官祿宮化科入夫妻宮
		官祿宮化科入子女宮
		官祿宮化科入財帛宮
		官祿宮自化科
		官祿宮化科入遷移宮
		官祿宮化科入僕役宮
		官祿宮化科入命宮
		官祿宮化科入田宅宮
		官祿宮化科入福德宮
		官祿宮化科入父母宮
		
		官祿宮化忌入疾厄宮
		官祿宮化忌入兄弟宮
		官祿宮化忌入夫妻宮
		官祿宮化忌入子女宮
		官祿宮化忌入財帛宮
		官祿宮自化忌
		官祿宮化忌入遷移宮
		官祿宮化忌入僕役宮
		官祿宮化忌入命宮
		官祿宮化忌入田宅宮
		官祿宮化忌入福德宮
		官祿宮化忌入父母宮
		;