\ 安四化星

變數 化祿星表
  ' 安廉貞星 , ' 安天機星 , ' 安天同星 , ' 安太陰星 , ' 安貪狼星 ,
  ' 安武曲星 , ' 安太陽星 , ' 安巨門星 , ' 安天梁星 , ' 安破軍星 ,
: 安化祿星 ( 年干 化祿星表 命宮五行局 生日 --- 化祿所在地支 )
  安紫微星 -rot
  表參考
  execute
  ;

變數 化權星表
  ' 安破軍星 , ' 安天梁星 , ' 安天機星 , ' 安天同星 , ' 安太陰星 ,
  ' 安貪狼星 , ' 安武曲星 , ' 安太陽星 , ' 安紫微星 , ' 安巨門星 ,
: 安化權星 ( 年干 化權星表 紫微所在地支  --- 化權所在地支 )
  表參考 -rot
  execute
  ;

變數 化科星表
  ' 安武曲星 , ' 安紫微星 , ' 安文昌星 , ' 安天機星 , ' 安右弼星 ,
  ' 安天梁星 , ' 安太陰星 , ' 安文曲星 , ' 安左輔星 , ' 安太陰星 ,
: 安化科星 ( 年干 化科星表 紫微所在地支  --- 化科所在地支 )
  表參考 -rot
  execute
  ;

變數 化忌星表
  ' 安太陽星 , ' 安太陰星 , ' 安廉貞星 , ' 安巨門星 , ' 安天機星 ,
  ' 安文曲星 , ' 安天同星 , ' 安文昌星 , ' 安武曲星 , ' 安貪狼星 ,
: 安化忌星 ( 年干 化忌星表 紫微所在地支  --- 化忌所在地支 )
  表參考  -rot
  execute
  ;
