問：紫微所主若何？

答：紫微屬土，乃中天星之尊、為帝，主造化樞機，人生主宰，仗五行有萬物，以人命為之立定數安星躔，各根所司，處年數內，常掌爵祿，諸宮降伏，能消百惡。須看三台，輓絲L守命是中台，前一位是上台，後一位是下台，俱看在廟旺之鄉否？
有何吉凶之星守照，如廟旺化吉甚妙，陷又化忌甚凶，吉限不美，凶陷則凶也。
喜輔弼為之相佐，天相昌曲為之部從，魁鉞為之傳令，日月為之分司，祿存為主爵之司，天府為帑藏之主，其威能降七殺、制火鈴。
人之身命若值祿存宮，又得日月三合相照，貴不可言。
無輔弼同行，則為孤君，雖美不足，更與諸煞同宮，或諸煞會照，則君子在野，小人在位，主人奸詐不善，平生惡積。
與囚同居，無左右相佐，定為胥吏，如落疾厄、兄弟、奴僕、相貌四陷宮，主人勞碌，作事不成，雖得相助，亦不為福。
更宜詳何宮度，應究星躔之論。
若居身命官祿三宮，最要左右守衛，天相祿馬交馳，不落空亡，更坐生旺之人，可為貴論。
若左右拱照，亦作貴論。
如魁鉞三合，星會吉星，則在三台八座矣。
帝會文曲拱照，再得美限扶持，必文職之選。帝降七殺為權，有吉星至，帝相有氣，諸吉咸集，作武官之格。
財帛田宅左右拱衛，更與太陰武曲同宮、不分惡限，必為財賦之官。武曲祿存同宮，命中尤為奇特。
男女宮得佐吉祥，主生貴子，若獨守無相佐，為孤君，則子貧孤老矣。
妻妾宮會吉，男女主貴夫婦，亦要無破。
遷移雖是強宮，更要相佐，吉星照命，則因人之貴。
福德男行陷地，女為妙樂，逢吉則吉，逢凶則凶。

歌曰：
紫微原屬土官祿宮主星 　
有相為有用無相為孤君 　
諸宮皆降福逢凶福自申 　
文昌發科甲文曲受皇恩 　
僧道有師號快樂度春秋 　
眾星皆拱照為吏協公平 　
女人會帝座遇吉事貴人 　
若與桃花會飄蕩落風塵 　
擎羊火鈴聚鼠竊狗偷群 　
三方有吉拱方作貴人評 　
若還無輔弼諸惡共飲凌 　
帝為無道主考究要知因 　
二限若遇帝喜氣自然新

